{
    "video_id": "7KuLMe6KSVQ",
    "title": "Apple Fixed the Problem they Created. - iPhone 15 with USB-C Announcement",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-09-13T10:10:07Z",
    "video_url": "https://www.youtube.com/watch?v=7KuLMe6KSVQ",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "iPhone 15",
        "iPhone 15 Pro",
        "Apple Watch Series 9",
        "Apple Watch Ultra 2",
        "A17 Pro",
        "A16 Bionic",
        "Apple Event",
        "LTT"
    ],
    "views": 1296450,
    "likes": 60979,
    "comments_count": 4087,
    "description": "Check out MotionGrey’s ergonomic workplace solutions at https://lmg.gg/motiongrey  and use code LINUS for 10% off!\n\nCheck out Ugreen's 1st Nexode 300W GaN Charger using the links below.\nAmazon US  ($70 OFF during 9/11-9/18):   https://bit.ly/3R3x4Z1\nOfficial Store US ($70 OFF during 9/11-9/18):   https://bit.ly/3PsJFnv\nAmazon CA ( C$95 OFF during 9/19-1/.3 ) :  https://bit.ly/3Z5bFRm\n\nThe lightning cable is DEAD. Thanks to the European Union, Apple has to swap standards to what the rest of the world has been using for years. But if you want the full BENEFIT of USB-C, you might need to shell out some big bucks for the iPhone 15 Pro…\n\nDiscuss on the forum: https://linustechtips.com/topic/1531202-apple-fixed-the-problem-they-created/\n\nPre-order the iPhone 15 Series: https://lmg.gg/eZGEz\nCheck out Samsung's S23 Series of Phones: https://lmg.gg/qhryL\nCheck out Google's Pixel Series of Phones: https://lmg.gg/qhryL\n\nPurchases made through some store links may provide some compensation to Linus Media Group.\n\n► GET MERCH: https://lttstore.com\n► GET EXCLUSIVE CONTENT ON FLOATPLANE: https://lmg.gg/lttfloatplane\n► SPONSORS, AFFILIATES, AND PARTNERS: https://lmg.gg/partners\n► EQUIPMENT WE USE TO FILM LTT: https://lmg.gg/LTTEquipment\n► OUR WAN PODCAST GEAR: https://lmg.gg/wanset\n\nFOLLOW US \n---------------------------------------------------  \nTwitter: https://twitter.com/linustech\nFacebook: http://www.facebook.com/LinusTech\nInstagram: https://www.instagram.com/linustech\nTikTok: https://www.tiktok.com/@linustech\nTwitch: https://www.twitch.tv/linustech\n\nMUSIC CREDIT\n---------------------------------------------------\nIntro: Laszlo - Supernova\nVideo Link: https://www.youtube.com/watch?v=PKfxmFU3lWY\niTunes Download Link: https://itunes.apple.com/us/album/supernova/id936805712\nArtist Link: https://soundcloud.com/laszlomusic\n\nOutro: Approaching Nirvana - Sugar High\nVideo Link: https://www.youtube.com/watch?v=ngsGBSCDwcI\nListen on Spotify: http://spoti.fi/UxWkUw\nArtist Link: http://www.youtube.com/approachingnirvana\n\nIntro animation by MBarek Abdelwassaa https://www.instagram.com/mbarek_abdel/\nMonitor And Keyboard by vadimmihalkevich / CC BY 4.0  https://geni.us/PgGWp\nMechanical RGB Keyboard by BigBrotherECE / CC BY 4.0 https://geni.us/mj6pHk4\nMouse Gamer free Model By Oscar Creativo / CC BY 4.0 https://geni.us/Ps3XfE\n\nhttps://www.theverge.com/2022/6/7/23156361/european-union-usb-c-wired-charging-iphone-lightning-ewaste\nhttps://en.wikipedia.org/wiki/USB-C\nhttps://9to5mac.com/2015/03/14/apple-invent-usb-type-c/\nhttps://www.wired.com/story/apple-iphone-15-usb-c/https://www.wired.com/2015/03/life-macbooks-single-port-wont-easyyet/\n\nWatch the Apple Event: https://www.youtube.com/watch?v=ZiP1l7jlIIA\n\nCHAPTERS\n---------------------------------------------------\n0:00 Intro\n1:20 USB-C \n4:15 A17 Pro\n6:30 iPhone 15 Pro\n7:30 iPhone 15\n8:45 Apple Watches\n10:20 Conclusion\n12:01 Outro",
    "description_links": [
        "https://lmg.gg/motiongrey",
        "https://bit.ly/3R3x4Z1",
        "https://bit.ly/3PsJFnv",
        "https://bit.ly/3Z5bFRm",
        "https://linustechtips.com/topic/1531202-apple-fixed-the-problem-they-created/",
        "https://lmg.gg/eZGEz",
        "https://lmg.gg/qhryL",
        "https://lmg.gg/qhryL",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE",
        "https://www.theverge.com/2022/6/7/23156361/european-union-usb-c-wired-charging-iphone-lightning-ewaste",
        "https://en.wikipedia.org/wiki/USB-C",
        "https://9to5mac.com/2015/03/14/apple-invent-usb-type-c/",
        "https://www.wired.com/story/apple-iphone-15-usb-c/https://www.wired.com/2015/03/life-macbooks-single-port-wont-easyyet/",
        "https://www.youtube.com/watch?v=ZiP1l7jlIIA"
    ],
    "transcript": "Never again. This cable has been one of the worst parts of living in Apple's walled garden ecosystem. But thanks to the European Union, Tim Apple has been forced to join the rest of the modern world and move over to the universally accepted standard of USB-C. At least that's the version of events that the government would have you believe. According to Apple, this was all totally of their own volition. Definitely not because they lost a protracted legal battle. Anywho, regardless of the reason, I see this as an absolute win. But depending which iPhone you buy, it might be more or less of a win. You see, USB-C isn't so much a standard specification as it is a menu of optional specifications. So not every iPhone, or every cable for that matter, is going to support the same features. We'll get into that later. The bottom line for now though, is universal charging is finally here no matter what device you're using, or which segue I do, to our sponsor. Ugreen, what's better than power? Unlimited power. Ugreen's 300 watt multi-port GaN charger is packed with features like PD 3.1 hyperfast charging, four high power USB-C ports, and more. Check it out at the link below. Apple actually has a long history of innovation when it comes to USB-C. They were heavily involved in the development of the standard, contributing over 20% of the engineers, according to 9to5Mac. They were the first to announce a USB-C laptop, which was a big deal since it supported data transfer and charging over a single port. And they shipped the first USB-C iOS device, the iPad Pro, almost five years ago with support for all kinds of cool things like external storage and peripherals and high resolution displays. And now that's all coming to the iPhone, sort of. If you had Apple's iPhone 15 and Apple Watch announcement up on your secondary monitor, you might've missed how they glossed over a teeny tiny detail regarding the switch to USB-C. That's right, it's goodbye lightning, but hello again to our dear friend, USB 2.0, who recently celebrated their 23rd birthday. Happy belated, buddy. So yeah, just like the old lightning cable, USB-C on the regular iPhone 15 is stuck at a 2000 era transfer speed of just 480 megabit per second. It's not unusable if all you're doing is sending the odd file over the wires, but it is pretty outdated compared to the competition. For context, Samsung moved their flagships to USB 3 10 years ago, and you need to go all the way down to their A series devices to find anything that's still using USB 2 today. However, to Apple's credit, if you pony up for the iPhone 15 Pro, you not only get support for USB 3, but it runs at a whopping 10 gigabit per second, which might not matter for those small file transfers I talked about before, but it could matter for some of the features that Apple just introduced. More on those later. First, let's talk about the aspect of USB-C that most people are going to care about, charging. You get a C2C cable in the box, so that's good, but like many recent mobile products, there is no included wall wart, so hopefully you already have one. Also, it should be noted that both the 15 and the 15 Pro are still limited to 20 watt charging. So if you're the kind of person who just gets bothered when the capability of a standard is not fully utilized, well, then you might prefer the 210 watt charging of a Redmi Note 12 Explorer, but personally, I don't care. The fact that I only have to carry around one type of cable now for my Switch, my laptop, my phone, my friend's phone who won't buy the same kind as me and now we have different colored bubbles, it's just such a relief that I am not gonna complain about minor things like charging watts. And besides, with Apple's focus on overall platform efficiency, their batteries tend to be smaller than the competition, so these new devices should charge in about an hour. Now let's talk about the next big thing, performance. The all new A17 Pro processor is kinda exciting. It's built on TSMC's cutting edge three nanometer process and inside it, you'll find six CPU cores, six GPU cores, and as far as I can tell, an angry tiger that looks ready to absolutely shred any workload you throw at this thing. I mean, look at this. Genshin Impact looks great on the iPhone 15 Pro, and that's cool, but my mind wasn't really blown until they showed Resident Evil Village and the RE4 remake, as far as I can tell, running locally on a flippin' iPhone. I mean, I just about wore out my X key seeing how smooth and beautiful the footage looked given that they didn't do the demo live, but if this is real and reflective of the gaming experience, Nintendo's handheld competition from Valve is the least of their concerns. It's kinda nuts. Hardware accelerated ray tracing, metal FX upscaling, up to a terabyte of storage, 6.1 inch screen with 460 pixels per inch, 1600 nit peak brightness in HDR, Wi-Fi 60 AV1 decoding, and up to 29 hours of video playback on battery. I mean, sure, gaming is bound to eat through that battery life a little bit faster, but even with the hefty price tag of $1,000 for the base Pro model, considering the weight and the size of the device and the fact that it does all the other stuff it does and you're gonna be carrying it around with you anyway, you guys are gonna have to download this video before I delete it, but I think Apple's pricing might actually be justified. There is a downside, not many games are built for metal, but if Apple's new porting tools do gain traction, that caveat might end up aging like fine milk, just like your old Android devices that are sitting in a drawer with zero modern software support. Another thing Apple keeps doing right is supporting older devices, even if it ends up slowing them down a bit. And you might not care a whole lot about the extra performance of this new chip today. I certainly don't, as long as my phone's fast enough, whatever, but in five years when your iPhone is getting the freshest updates, it could make the difference between feeling the need to upgrade or still feeling completely fine on your now many generations old device. Don't get me wrong, regardless of how pro they are, I'm still not thrilled that phones randomly cost over a thousand freaking dollars now. But given the alleged cost of the latest manufacturing nodes, I'm also not that surprised. And it's hard to argue that the value is not there. With the A17 Pro at its heart, the iPhone 15 Pro is looking like the biggest generational leap in at least a little while. I'm talking spatial video capture that you can upload to the Apple Vision Pro that might become affordable at some point. The ability to capture ProRes footage straight out of that high-speed USB port into an external storage device for easy ingest and video editing. The titanium materials that make it the lightest pro model ever, the thinner bezels, the replaceable back glass, I mean, that's super cool. A customizable action button, finally. Like, okay, this is kind of sick, guys. And up to 5X telephoto zoom on the Pro Max. Like, the gang's all here, guys. It's a pretty compelling package. If there was ever a generation to skip and a generation to buy, it seems like they're called 14 and 15. Even the non-Pro 15 has a lot going for it here. I mean, you might hate the lighter colors compared to the more adult Pro line. And you might be disappointed, like I am, that it stuck with the last generation A16 bionic chip, which, come to think of it, is probably the reason that it's also saddled with USB 2. But it is still a formidable performer and it comes with a slew of upgrades, like machine-learned voice isolation during your calls, a roadside assistance program in partnership with AAA to flesh out their SOS emergency features, a second-gen ultra wideband chip to help find friends or items in crowded or cluttered spaces, and the cool dynamic island feature that hit the iPhone 14 Pro. That is now on the 15 and the 15 Pro with some minor improvements. They have crammed a lot into these tiny devices, kind of like how we crammed a lot into our new stubby version of the LTT screwdriver. Get yours today, lttstore.com. Speaking of small devices, they also talked about the new Apple Watch Series 9 and Ultra 2. Both of them are featuring the S9 system-in-a-package, or SIP, with 5.6 billion transistors, with a B. That is more transistors. And I know this is not an apples-to-apples comparison, but that is more than a GTX 680. And speaking of graphics, it boasts a 30% faster GPU. I don't know if Apple Watches ever necessarily felt like they were too slow, but if you consider how much they're trying to offload to this thing now, it might just need all that processing power. Siri requests are now going to be handled locally. Finding your iPhone by using your watch has never been easier, and the screen has never been brighter or dimmer, for that matter, managing to run it anywhere from 2,000 or 3,000 nits, depending on if you wanna pay Lord money or King money for a watch, all the way down to just one. The coolest feature, though, and one that, if we're being realistic, is probably gonna start a new trend where people make this gesture when they want people to shut up, is the double-tap hand gesture controls that you can use to answer or end phone calls when you're wearing the watch. You just double-tap and you've hung up. How cool would it be if that worked in real life? Someone's like talking at you while you're trying to focus, and you're just like. I wanted to do it pretty badly when they showed the cringy mother nature skit to boast about how carbon neutral they are. I mean, don't get me wrong. I am stoked for any progress that we can make towards reducing our impact on the planet, but wow, that was something else. To save you from having to watch it, long story short, by 2030, they are aiming to be net zero across their entire business, but just Apple, next time, please just tell us that. Or better yet, tell us that you've also improved your repairability. There were a few other things, better health features with biking support and advanced metrics, name drop on watchOS 10, better ping that iPhone support, automatic home pod connectivity, waypoints and precision finding. There's a depth app for diving. So if you're a diver, that's pretty cool. Most of this though is, hey, that's cool, but kind of niche and things that only some of you will care about. And if you do, we're gonna have links to the pre-order page down below. They start shipping September 22nd. We'll also have some alternative phones linked down below, but I gotta say, considering everything Apple showed off today, it's starting to feel like the grass is looking pretty green inside that walled garden. Green, like this segue to our sponsor. Motion gray, not taking care of your spine during your daily grind is a recipe for back pain. So why would anyone even have that recipe? Throw it in the trash and use this other one from Motion Gray for ergonomic workplace solutions at affordable prices, duh. Motion Gray's sit to stand desks come in a wide variety of models and sizes, are simple to assemble and have a bunch of accessories. So they definitely have something to suit your needs. Assuming you are in fact a vertebrate and not some variety of tentacled mollusk. And even then you'd probably still like it. With a wide range of ergonomic chairs focusing on adjustability, affordability and maximum comfort, Motion Gray wants to improve your comfort level. Check out Motion Gray at the link below and use code Linus for 10% off your purchase. If you guys enjoyed this video, check out the WWDC coverage that we did earlier this year that was focused on the Apple Vision Pro and iOS 17.",
    "transcript_keywords": [
        "Apple Vision Pro",
        "Apple",
        "Pro",
        "USBC",
        "iPhone",
        "Motion gray",
        "Apple Watch",
        "Apple Vision",
        "Vision Pro",
        "USB",
        "Tim Apple",
        "Apple Watch Series",
        "Apple iPhone",
        "kind",
        "charging",
        "devices",
        "Pro model",
        "cool",
        "Watch",
        "gray"
    ],
    "transcript_entities": [
        [
            "almost five years ago",
            "DATE"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "Valve",
            "ORG"
        ],
        [
            "USB-C",
            "ORG"
        ],
        [
            "3 10 years ago",
            "DATE"
        ],
        [
            "USB 2",
            "ORG"
        ],
        [
            "USB 3",
            "ORG"
        ],
        [
            "zero",
            "CARDINAL"
        ],
        [
            "Ultra 2",
            "WORK_OF_ART"
        ],
        [
            "210 watt",
            "QUANTITY"
        ],
        [
            "10%",
            "PERCENT"
        ],
        [
            "GPU",
            "ORG"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "WWDC",
            "EVENT"
        ],
        [
            "RE4",
            "PRODUCT"
        ],
        [
            "Apple Watches",
            "PERSON"
        ],
        [
            "20 watt",
            "QUANTITY"
        ],
        [
            "LTT",
            "ORG"
        ],
        [
            "2000",
            "DATE"
        ],
        [
            "Wi-Fi 60",
            "ORG"
        ],
        [
            "Nintendo",
            "ORG"
        ],
        [
            "Linus",
            "PERSON"
        ],
        [
            "three nanometer",
            "QUANTITY"
        ],
        [
            "GaN",
            "ORG"
        ],
        [
            "14",
            "CARDINAL"
        ],
        [
            "September 22nd",
            "DATE"
        ],
        [
            "the Apple Vision Pro",
            "ORG"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "2030",
            "CARDINAL"
        ],
        [
            "Tim Apple",
            "PERSON"
        ],
        [
            "SOS",
            "ORG"
        ],
        [
            "First",
            "ORDINAL"
        ],
        [
            "300 watt",
            "QUANTITY"
        ],
        [
            "460 pixels per inch",
            "QUANTITY"
        ],
        [
            "watts",
            "LOC"
        ],
        [
            "10 gigabit per",
            "QUANTITY"
        ],
        [
            "about an hour",
            "TIME"
        ],
        [
            "2,000",
            "CARDINAL"
        ],
        [
            "A16",
            "PRODUCT"
        ],
        [
            "up to 29 hours",
            "TIME"
        ],
        [
            "C2C",
            "GPE"
        ],
        [
            "Redmi Note 12 Explorer",
            "ORG"
        ],
        [
            "6.1 inch",
            "QUANTITY"
        ],
        [
            "USB 2.0",
            "ORG"
        ],
        [
            "USB-C.",
            "ORG"
        ],
        [
            "earlier this year",
            "DATE"
        ],
        [
            "CPU",
            "ORG"
        ],
        [
            "the A17 Pro",
            "ORG"
        ],
        [
            "six",
            "CARDINAL"
        ],
        [
            "TSMC",
            "ORG"
        ],
        [
            "Samsung",
            "ORG"
        ],
        [
            "23rd",
            "ORDINAL"
        ],
        [
            "1600",
            "CARDINAL"
        ],
        [
            "Android",
            "PRODUCT"
        ],
        [
            "four",
            "CARDINAL"
        ],
        [
            "S9",
            "PRODUCT"
        ],
        [
            "Apple Watch",
            "ORG"
        ],
        [
            "9to5Mac",
            "CARDINAL"
        ],
        [
            "a thousand freaking dollars",
            "MONEY"
        ],
        [
            "Motion Gray",
            "PERSON"
        ],
        [
            "Siri",
            "PERSON"
        ],
        [
            "10",
            "CARDINAL"
        ],
        [
            "A17 Pro",
            "PRODUCT"
        ],
        [
            "3,000",
            "CARDINAL"
        ],
        [
            "15",
            "CARDINAL"
        ],
        [
            "Switch",
            "ORG"
        ],
        [
            "five years",
            "DATE"
        ],
        [
            "second",
            "ORDINAL"
        ],
        [
            "Resident Evil Village",
            "ORG"
        ],
        [
            "daily",
            "DATE"
        ],
        [
            "over 20%",
            "PERCENT"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "the European Union",
            "ORG"
        ],
        [
            "30%",
            "PERCENT"
        ],
        [
            "Ugreen",
            "ORG"
        ],
        [
            "AAA",
            "ORG"
        ],
        [
            "FX",
            "ORG"
        ],
        [
            "1,000",
            "MONEY"
        ],
        [
            "ProRes",
            "ORG"
        ],
        [
            "USB",
            "ORG"
        ],
        [
            "5.6 billion",
            "CARDINAL"
        ],
        [
            "the iPad Pro",
            "PRODUCT"
        ],
        [
            "just 480 megabit",
            "QUANTITY"
        ]
    ]
}