{
    "video_id": "ieHv_bJ7mog",
    "title": "The Holiday PC Buyer's Guide - 2022",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-11-02T17:04:47Z",
    "video_url": "https://www.youtube.com/watch?v=ieHv_bJ7mog",
    "category": "Science & Technology",
    "tags": [
        "holiday",
        "buyers",
        "guide",
        "pc build",
        "amazon",
        "$500 pc",
        "$1000 pc",
        "$300 pc",
        "cheap pc",
        "cheap gaming pc",
        "$1500 pc",
        "$2000 pc",
        "christmas gifts"
    ],
    "views": 1043416,
    "likes": 39938,
    "comments_count": 1920,
    "description": "Thanks to Amazon for sponsoring our 2022 Holiday Buyers Guide! We have our built out PC kits below, but if you're looking for gifts this season, check out Amazon's own Holiday Gift Guide at https://geni.us/nXANf7e and their Electronics Showcase at https://geni.us/Q9zJA.\n\nLooking to build a new PC for yourself or someone else? We've got you covered this holiday season at a ton of different price points in our latest Holiday Buyers Guide.\n\nDiscuss on the forum: https://linustechtips.com/topic/1465010-the-ultimate-holiday-buyers-guide-2022-sponsored/\n\n$300 Build\n\nBuy an AMD Ryzen 5 4600G: https://geni.us/5JoQ13\nBuy a Gigabyte GA A320M S2H Micro ATX: https://geni.us/Ams7Aa\nBuy a Kit of Patriot Signature Line 8GB DDR4: https://geni.us/w7kHXJ\nBuy a Teamgroup T-Force Vulcan Z 240GB SSD: https://geni.us/Itf6\nBuy a Zalman S3 ATX Mid Tower Case: https://geni.us/SG9KB19\nBuy a Thermaltake Smart 430 W 80+ PSU: https://geni.us/YcL3\nBuy an Amazon Basics Keyboard and Mouse: https://geni.us/GHWNw\n\n$500 Build\n\nBuy an AMD Ryzen 5 4600G: https://geni.us/5JoQ13\nBuy an ASRock B550 PG Riptide Micro ATX: https://geni.us/1C3FmvV\nBuy a Kit of Corsair Vengeance 3200 16GB DDR4: https://geni.us/zILm2\nBuy a Crucial P3 Plus 1 TB M.2 PCIe SSD: https://geni.us/BrRQt\nBuy a Fractal Design Focus G ATX Mid Tower Case: https://geni.us/ks6NxI\nBuy a Thermaltake Smart BX1 750 W 80+ Bronze PSU: https://geni.us/D7SF\n\n$1000 Build\n\nBuy an Intel Core i5-12400F: https://geni.us/PDKAzcq\nBuy an MSI Pro Z690-P DDR4 ATX LGA1700: https://geni.us/siRh\nBuy a kit of Corsair Vengeance LPX 16 GB DDR4: https://geni.us/tdQh\nBuy an ASRock Radeon RX6700XT CLD 12G: https://geni.us/AiEzv\nBuy a DIYPC Shadow H3 ARGB ATX Mid Tower Case: https://geni.us/l3id1Bd\nBuy a Thermaltake Smart BM2 750 W 80+ Bronze PSU: https://geni.us/JLPH6\n\n$1500 Build\n\nBuy an Intel Core i5-12600K: https://geni.us/9ua9M26\nBuy a Thermalright Peerless Assassin 120 SE Cooler: https://geni.us/y7C5Ih2\nBuy an Asrock Z690 PG Riptide ATX LGA 1700: https://geni.us/VBHBMaJ\nBuy a kit of Corsair Vengeance 16GB DDR4: https://geni.us/rPXP\nBuy an ASRock Phantom D OC Rdeon RX 6900 XT: https://geni.us/1kAvEZ\nBuy a Fractal Design Focus 2 RGB ATX Midtower Case: https://geni.us/UUE4\nBuy a Thermaltake Smart BX1 750W 80+ Bronze PSU: https://geni.us/DbH2j\n\n$2000 Build\n\nBuy an Intel Core i5-13600KF: https://geni.us/5snhEa\nBuy a Thermalright Peerless Assassin 120 SE Cooler: https://geni.us/NIQik3o\nBuy an MSI Proz Z790-P Wifi DDR4 ATX LGA1700: https://geni.us/vu6gBc\nBuy a Kit of 16GB Corsair Vengeance RGB Pro SL DDR4: https://geni.us/ppXe\nBuy a Seagate Barracuda Compute 2 TB HDD: https://geni.us/cUMnG\nBuy a Samsung 980 Pro 2 TB M.2 PCIe NVME SSD: https://geni.us/57TBeH9\nBuy a Phanteks Eclipse P500A D RGB ATX Mid Tower Case: https://geni.us/FdRxWdr\nBuy an Asus Rog Strix 750 W 80+ Gold Modular PSU: https://geni.us/kRIUl\n\nYou can find a wide variety of inexpensive tech accessories through AmazonBasics at https://geni.us/VvoBd\n\nPurchases made through some store links may provide some compensation to Linus Media Group.\n\n► GET MERCH: https://lttstore.com\n► SUPPORT US ON FLOATPLANE: https://www.floatplane.com/ltt\n► AFFILIATES, SPONSORS & REFERRALS: https://lmg.gg/sponsors\n► PODCAST GEAR: https://lmg.gg/podcastgear\n\n\nFOLLOW US \n---------------------------------------------------  \nTwitter: https://twitter.com/linustech\nFacebook: http://www.facebook.com/LinusTech\nInstagram: https://www.instagram.com/linustech\nTikTok: https://www.tiktok.com/@linustech\nTwitch: https://www.twitch.tv/linustech\n\nMUSIC CREDIT\n---------------------------------------------------\nIntro: Laszlo - Supernova\nVideo Link: https://www.youtube.com/watch?v=PKfxmFU3lWY\niTunes Download Link: https://itunes.apple.com/us/album/supernova/id936805712\nArtist Link: https://soundcloud.com/laszlomusic\n\nOutro: Approaching Nirvana - Sugar High\nVideo Link: https://www.youtube.com/watch?v=ngsGBSCDwcI\nListen on Spotify: http://spoti.fi/UxWkUw\nArtist Link: http://www.youtube.com/approachingnirvana\n\nIntro animation by MBarek Abdelwassaa https://www.instagram.com/mbarek_abdel/\nMonitor And Keyboard by vadimmihalkevich / CC BY 4.0  https://geni.us/PgGWp\nMechanical RGB Keyboard by BigBrotherECE / CC BY 4.0 https://geni.us/mj6pHk4\nMouse Gamer free Model By Oscar Creativo / CC BY 4.0 https://geni.us/Ps3XfE\n\nCHAPTERS\n---------------------------------------------------\n0:00 Intro\n0:38 Our $300 Build: The APU Super Saver\n2:17 Our $500 Build: A Nice, Upgradable Start\n4:14 Our $1000 Build: Getting into the GPUs\n6:33 Our $1500 Build: How about some 4K?\n7:33 Our $2000 Build: More Bang for a little more Buck\n8:51 Conclusion",
    "description_links": [
        "https://geni.us/nXANf7e",
        "https://geni.us/Q9zJA.",
        "https://linustechtips.com/topic/1465010-the-ultimate-holiday-buyers-guide-2022-sponsored/",
        "https://geni.us/5JoQ13",
        "https://geni.us/Ams7Aa",
        "https://geni.us/w7kHXJ",
        "https://geni.us/Itf6",
        "https://geni.us/SG9KB19",
        "https://geni.us/YcL3",
        "https://geni.us/GHWNw",
        "https://geni.us/5JoQ13",
        "https://geni.us/1C3FmvV",
        "https://geni.us/zILm2",
        "https://geni.us/BrRQt",
        "https://geni.us/ks6NxI",
        "https://geni.us/D7SF",
        "https://geni.us/PDKAzcq",
        "https://geni.us/siRh",
        "https://geni.us/tdQh",
        "https://geni.us/AiEzv",
        "https://geni.us/l3id1Bd",
        "https://geni.us/JLPH6",
        "https://geni.us/9ua9M26",
        "https://geni.us/y7C5Ih2",
        "https://geni.us/VBHBMaJ",
        "https://geni.us/rPXP",
        "https://geni.us/1kAvEZ",
        "https://geni.us/UUE4",
        "https://geni.us/DbH2j",
        "https://geni.us/5snhEa",
        "https://geni.us/NIQik3o",
        "https://geni.us/vu6gBc",
        "https://geni.us/ppXe",
        "https://geni.us/cUMnG",
        "https://geni.us/57TBeH9",
        "https://geni.us/FdRxWdr",
        "https://geni.us/kRIUl",
        "https://geni.us/VvoBd",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Got a gamer in your life who's looking for an upgrade? Itching to spend your holiday bonus? Or maybe your computer just exploded and you need to fix fast. Well, thanks to Amazon sponsoring this video, we've got you covered with our 2022 Holiday Buyer's Guide. Because not only is building a reasonably priced gaming rig actually viable for a change, you might be surprised to see just how low prices can go if you're willing to buy last year's model. DDR5? More like DDR bye. (bright upbeat music) We're kicking things off with our APU Super Saver build for the casual gamer out there who just needs something that works. We managed to get our cheapest system built for a little over $300. It's not pretty and it comes with a major caveat. Our Gigabyte GA-A320M motherboard does not support our hexacore Ryzen 5 4600G with Vega 7 graphics out of the box. But if you have access to an older AM4 CPU like a 2400G, you can update the BIOS and you are good to go. However, if you're willing to shell out about $20 extra you can avoid this hassle by simply going with an A520 board instead. I think it's probably worth the 20 to $30, but when our budget is this low, every penny counts. And it shows. How many of you out there are using 4gig sticks of DDR4? Well, we are. And our 2 1/2 inch SSD is only 240 gigs to boot. Get it? 'Cause it's your boot drive and the rest of your storage? Anyway, we've gone with the Zelman S3. The cheapest ATX case we could find, but if you've got an old home computer collecting dust, you could probably save a buck or 50 and just use that. If you're on this tight of a budget you might also consider picking up an Amazon Basics mouse and keyboard. They're affordable and they just work. As for our power supply, well, it hopefully will work. It's only 430 watts, 80 Plus. Not 80 Plus Bronze, just 80 Plus. But it's from Thermaltake who should reply to your emails if you have any problems. And for under $30, we can't really complain even if it's not gonna give us a lot of room for upgrades. Leading us to our first upgrade, our $500 build. If you're a gamer, you know you're going to want a dedicated GPU eventually. An APU is fine to get started, but if you spend a bit extra now, you can make sure your system has enough power and storage for the future. Maybe some faster RAM, even a nicer case. For a couple hundred bucks more, let's see what we can get. First order of business. Goodbye, 256 gigs SATA SSD. Hello, Crucial P3 Plus 1TB NVMe SSD. At $84, it's a steal. And while our budget doesn't allow us to improve our processor now, almost anything that we would upgrade to later is going to support Gen4 speeds. That's why we're going with the ASRock B550M PG Riptide motherboard. Not only does it support a Gen4 drive, but what gaming rig would be complete without ARGB headers and some motherboard armor. Memory was another huge upgrade for a small price since DDR4 is so cheap right now. We even managed to squeeze in more RGB with this 2x8 gig CORSAIR Vengeance kit running at 3,200 mega transfers per second CL16. And once you can afford a graphics card, you'll need some more juice. So, we've upgraded to another Thermaltake power supply. This time, with 80 Plus Bronze efficiency and a 750 watt rating. Now to be clear, this category was full of tough choices. I mean, we had to pick between either an APU build but with a good upgrade path or a relatively low tiered GPU build that was going to make some compromises and might not perform as well as you might hope anyway. There is, however, a middle ground if you're willing to take a little bit of risk and maybe spend a bit more like 600 bucks, because there are a lot of great deals in the used graphics card market right now thanks to the recent crypto crash. We've got a few recent budget build videos that you can check out if you want to stray from the safe path of new warranty cloud purchases. At our next price tier, a thousand dollars. You absolutely could go buy a $500 GPU, slap it into our previous system and call it a day. However, both Intel and AMD have released their latest and greatest offering upgrade paths that are unavailable to our AM4 socket $500 build. Friendship ended with 4600G. Now, Core i5 12400F is my best friend. Unlike the higher end of Intel's 12th Gen processors, this little guy doesn't have any efficiency cores, but it boosts a little higher than our previous six-core CPU and wins out in both single and multi-threaded workloads. Now that we don't need integrated graphics, we're gonna save a couple of bucks and get the F version and this PRO Z690P motherboard from MSI which should give us a phenomenal upgrade path thanks to its beefy VRMs and its ability to unlock K series chips. Now, since 13th Gen still supports DDR4, we're not shooting ourselves in the foot by sticking with the same CORSAIR Vengeance modules from before and our Crucial P3's Gen4 speeds will now be taken advantage of. Now, some of you are probably screaming at me right now. \"Linus, the 5600X is on sale on Amazon for $160. You fool!\" And you're absolutely right. With a cheap B550 motherboard we could save almost $200 right now. But that sale won't last forever and upgrading later to a 5800X3D could end up costing you a pretty penny if you can find one. If you do decide to go AMD now though, you'll have more than enough leftover to pick up a screwdriver from lttstore.com. Thanks to the other recent price reductions from AMD, you can now get an ASRock RX 6700 XT for as low as $390. 12 gigs of VRAM on a 192 bit bus, a boost clock of over 2,500 megahertz. I mean, it might not be the NVIDIA when it comes to ray tracing or streaming, but this thing is a beast for either 1080P or even 1440P gaming. As for our case, it's still good enough for now but we would recommend going a little over budget and maybe getting something nicer like this or this with slightly improved cable management and creature comforts. It can just make the build a little bit more pleasant. But if a little more pleasant isn't enough for you, if you're thinking of maybe going 4K. At our $1,500 price point, over half of our budget is going towards our CPU and our GPU. We're sticking with AMD again, going for the 6900 XT which is gonna give us great rasterization game performance for under $700 and we're getting a faster CPU. Now with efficiency cores, the 12600K. We also upgraded our boot drive to a Samsung 980 Pro. And finally, we're getting a nicer case with Fractal's Focus 2 RGB mid tower. For our cooler, we chose the Thermalright Peerless Assassin 120 SE ARGB. A decent cooler for just 40 bucks that should be plenty for a Core i5. If looks are more important to you you can actually save some money here and not upgrade to the 980 Pro, spending it on a nicer looking case or cooler instead, or maybe a fully modular power supply. And another valid option would be to bump your memory up to 3600 mega transfers per second. We felt that 3200 was good enough for us. For now though. And besides, we still need some upgrades for our $2,000 build. This time around, we're building in a case that we've used lots throughout the last couple of years. The Phanteks P500A Digital, and we're gonna need that thing for all the juicy storage that we've now got with a 2TB 7200 hard drive that goes along with our 980 Pro that we have now doubled in size to 2TB as well. We're still using only 16 gigs of DDR4 memory but it's now running at 3,600 mega transfers per second CL18, and we bumped our GPU up to a Radeon RX 6950 XT. That 750 watt power supply should still be okay as long as we stick to gaming and don't try to overclock the snot out of our Core i5 13600 KF. But we're gonna upgrade to an 80 Plus Gold efficiency, fully modular unit for a bit of a cleaner look and peace of mind. A good chunk of change also went to purchasing a Z790 board with integrated wifi. So, if you don't mind sticking with the older chipset and you don't need wireless, you could actually save a bit of money there and leave the old motherboard. The hard drive is also not necessarily required but hard drives have gotten wildly inexpensive these days and it's nice to have a spot to save any extra files you have. Particularly to something that's a little easier to recover data from. Honestly, I was expecting to find more NVIDIA cards in today's builds. But the reality is that AMD has made some aggressive price reductions recently. And with free prime shipping through Amazon it was kind of a no-brainer. Thanks again to them for sponsoring this video. I mean, no joke, just using PCPartPicker, they were usually the cheapest option anyway, particularly if you already have a prime membership and they're going to have more sales as we move closer to Black Friday and the holiday season. So, keep your eyes peeled. As for now, we're gonna have all these products listed, linked in the description down below. If you enjoyed this video, be sure to check out our recent budget builds like the $69 gaming PC and the upgrade that we made to it later. The secondhand market is super wild right now. Good time to build a PC.",
    "transcript_keywords": [
        "upgrade",
        "Holiday Buyer Guide",
        "build",
        "bit",
        "budget",
        "GPU",
        "AMD",
        "save",
        "case",
        "motherboard",
        "good",
        "Amazon",
        "CPU",
        "power supply",
        "price",
        "drive",
        "power",
        "PRO",
        "holiday",
        "gaming"
    ],
    "transcript_entities": [
        [
            "ASRock",
            "ORG"
        ],
        [
            "a little over $300",
            "MONEY"
        ],
        [
            "Radeon",
            "ORG"
        ],
        [
            "SSD",
            "ORG"
        ],
        [
            "RGB",
            "ORG"
        ],
        [
            "2 1/2 inch",
            "QUANTITY"
        ],
        [
            "GPU",
            "ORG"
        ],
        [
            "12th Gen",
            "ORG"
        ],
        [
            "the holiday season",
            "DATE"
        ],
        [
            "120",
            "CARDINAL"
        ],
        [
            "1,500",
            "MONEY"
        ],
        [
            "AMD",
            "ORG"
        ],
        [
            "over 2,500 megahertz",
            "QUANTITY"
        ],
        [
            "700",
            "MONEY"
        ],
        [
            "69",
            "MONEY"
        ],
        [
            "over half",
            "CARDINAL"
        ],
        [
            "Crucial P3 Plus 1TB",
            "ORG"
        ],
        [
            "3,200",
            "CARDINAL"
        ],
        [
            "Linus",
            "PERSON"
        ],
        [
            "256",
            "CARDINAL"
        ],
        [
            "5600X",
            "CARDINAL"
        ],
        [
            "3600",
            "CARDINAL"
        ],
        [
            "every penny",
            "MONEY"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "2022",
            "DATE"
        ],
        [
            "1440P",
            "CARDINAL"
        ],
        [
            "APU",
            "PRODUCT"
        ],
        [
            "last year's",
            "DATE"
        ],
        [
            "First",
            "ORDINAL"
        ],
        [
            "2400",
            "CARDINAL"
        ],
        [
            "80",
            "CARDINAL"
        ],
        [
            "12600K.",
            "CARDINAL"
        ],
        [
            "Amazon",
            "ORG"
        ],
        [
            "MSI",
            "ORG"
        ],
        [
            "almost $200",
            "MONEY"
        ],
        [
            "the last couple of years",
            "DATE"
        ],
        [
            "Gen4",
            "ORG"
        ],
        [
            "CPU",
            "ORG"
        ],
        [
            "1080P",
            "CARDINAL"
        ],
        [
            "a couple hundred bucks",
            "MONEY"
        ],
        [
            "six",
            "CARDINAL"
        ],
        [
            "the 980 Pro",
            "ORG"
        ],
        [
            "as low as $",
            "MONEY"
        ],
        [
            "Thermalright",
            "ORG"
        ],
        [
            "Intel",
            "ORG"
        ],
        [
            "192",
            "CARDINAL"
        ],
        [
            "Vega",
            "PERSON"
        ],
        [
            "ATX",
            "ORG"
        ],
        [
            "2,000",
            "MONEY"
        ],
        [
            "Amazon Basics",
            "ORG"
        ],
        [
            "30",
            "MONEY"
        ],
        [
            "only 240",
            "CARDINAL"
        ],
        [
            "84",
            "MONEY"
        ],
        [
            "a thousand dollars",
            "MONEY"
        ],
        [
            "Ryzen 5 4600",
            "LAW"
        ],
        [
            "XT",
            "PRODUCT"
        ],
        [
            "only 430 watts,",
            "QUANTITY"
        ],
        [
            "APU Super Saver",
            "PRODUCT"
        ],
        [
            "PG Riptide",
            "ORG"
        ],
        [
            "Digital",
            "ORG"
        ],
        [
            "2x8",
            "CARDINAL"
        ],
        [
            "12",
            "CARDINAL"
        ],
        [
            "about $20",
            "MONEY"
        ],
        [
            "Gigabyte GA-",
            "PERSON"
        ],
        [
            "CORSAIR Vengeance",
            "ORG"
        ],
        [
            "3200",
            "CARDINAL"
        ],
        [
            "these days",
            "DATE"
        ],
        [
            "just 40 bucks",
            "MONEY"
        ],
        [
            "12400F",
            "DATE"
        ],
        [
            "F",
            "PRODUCT"
        ],
        [
            "a couple of bucks",
            "MONEY"
        ],
        [
            "second",
            "ORDINAL"
        ],
        [
            "ARGB",
            "ORG"
        ],
        [
            "the 20 to $30",
            "MONEY"
        ],
        [
            "390",
            "MONEY"
        ],
        [
            "TB",
            "ORG"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "NVIDIA",
            "ORG"
        ],
        [
            "only 16",
            "CARDINAL"
        ],
        [
            "3,600",
            "CARDINAL"
        ],
        [
            "Samsung 980 Pro",
            "ORG"
        ],
        [
            "RAM",
            "ORG"
        ],
        [
            "Z790",
            "CARDINAL"
        ],
        [
            "750 watt",
            "QUANTITY"
        ],
        [
            "Crucial P3's",
            "ORG"
        ],
        [
            "13600",
            "CARDINAL"
        ],
        [
            "Focus 2 RGB mid tower",
            "ORG"
        ],
        [
            "the Zelman S3",
            "ORG"
        ],
        [
            "Black Friday",
            "EVENT"
        ],
        [
            "500",
            "MONEY"
        ],
        [
            "2",
            "CARDINAL"
        ],
        [
            "A520",
            "CARDINAL"
        ],
        [
            "Thermaltake",
            "ORG"
        ],
        [
            "160",
            "MONEY"
        ],
        [
            "50",
            "CARDINAL"
        ],
        [
            "Fractal",
            "ORG"
        ],
        [
            "Core",
            "ORG"
        ],
        [
            "Gen",
            "WORK_OF_ART"
        ],
        [
            "5800X3D",
            "CARDINAL"
        ]
    ]
}