{
    "video_id": "jgzI-N_U2hs",
    "title": "I Bought a Gaming PC at Best Buy… Am I Dumb?",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-12-25T17:34:12Z",
    "video_url": "https://www.youtube.com/watch?v=jgzI-N_U2hs",
    "category": "Science & Technology",
    "tags": [
        "best buy",
        "prebuilt",
        "should I buy a prebuilt?",
        "are custom pcs better",
        "is best buy good for gaming pcs?",
        "is best buy a good deal?",
        "how to buy a gaming pc",
        "secret shopper"
    ],
    "views": 2515759,
    "likes": 74904,
    "comments_count": 3345,
    "description": "Check out MSI's deals and special Holiday offers today at:\nhttps://msi.gm/3NzyMO3\n\nCheck out ORIGIN PC’s lineup this holiday season at http://bit.ly/3H3Sm3I\n\nWe were pleasantly surprised in 2016, and again in 2020, but can we still get a decent Gaming PC by wandering into a Best Buy and taking whatever the sales rep recommends? Our secret shopper finds out!\n\nDiscuss on the forum: https://linustechtips.com/topic/1476271-i-bought-a-gaming-pc-at-best-buy%E2%80%A6-am-i-dumb/\n\nBuy a Rog Strix G10CE Gaming PC: https://howl.me/ciLpg5ILSFr\nBuy an Intel Core i5 11400F: https://geni.us/1jD8aaH\nBuy an Nvidia GTX 1660 Ti: https://geni.us/pKG0BT\nBuy a 600W LiteOn PSU: https://geni.us/AqJO\nAsus ROG B560M Plus: https://geni.us/GVy7\nBuy a kit of SK Hynix DDR4: https://geni.us/Hi0Bg1\nBuy a Western Digital 512GB SSD: https://geni.us/ICZG\nAMD Ryzen 5 5600X: https://geni.us/rdeP5\nMSI B450 Gaming Plus MAX:https://geni.us/11buGAs\nBuy a kit of Corsair Vengeance LPX 16GB DDR4 RAM: https://geni.us/iLhyBJX\nBuy an Intel 670p 1TB SSD: https://geni.us/RplFr67\nBuy an MSI Mech 2X Radeon RX 6650 XT:https://geni.us/PaI52PB\nBuy an ASUS Tuf Gaming 750 W 80+ Bronze PSU: https://geni.us/wu25Zf\nBuy Fractal Design Focus G Mid-Tower Case: https://geni.us/zDEh\n\nPurchases made through some store links may provide some compensation to Linus Media Group.\n\n► GET MERCH: https://lttstore.com\n► SUPPORT US ON FLOATPLANE: https://www.floatplane.com/ltt\n► AFFILIATES, SPONSORS & REFERRALS: https://lmg.gg/sponsors\n► PODCAST GEAR: https://lmg.gg/podcastgear\n\nFOLLOW US \n---------------------------------------------------  \nTwitter: https://twitter.com/linustech\nFacebook: http://www.facebook.com/LinusTech\nInstagram: https://www.instagram.com/linustech\nTikTok: https://www.tiktok.com/@linustech\nTwitch: https://www.twitch.tv/linustech\n\nMUSIC CREDIT\n---------------------------------------------------\nIntro: Laszlo - Supernova\nVideo Link: https://www.youtube.com/watch?v=PKfxmFU3lWY\niTunes Download Link: https://itunes.apple.com/us/album/supernova/id936805712\nArtist Link: https://soundcloud.com/laszlomusic\n\nOutro: Approaching Nirvana - Sugar High\nVideo Link: https://www.youtube.com/watch?v=ngsGBSCDwcI\nListen on Spotify: http://spoti.fi/UxWkUw\nArtist Link: http://www.youtube.com/approachingnirvana\n\nIntro animation by MBarek Abdelwassaa https://www.instagram.com/mbarek_abdel/\nMonitor And Keyboard by vadimmihalkevich / CC BY 4.0  https://geni.us/PgGWp\nMechanical RGB Keyboard by BigBrotherECE / CC BY 4.0 https://geni.us/mj6pHk4\nMouse Gamer free Model By Oscar Creativo / CC BY 4.0 https://geni.us/Ps3XfE\n\nCHAPTERS\n---------------------------------------------------\n0:00 Intro\n0:55 The Rules\n1:31 Weirdest Advice Ever\n2:28 What we got\n3:53 The catch\n5:14 His biggest mistake\n6:06 What if we spec our own?\n6:51 What if we build our own?\n8:48 Who wins?\n10:18 Outro",
    "description_links": [
        "https://msi.gm/3NzyMO3",
        "http://bit.ly/3H3Sm3I",
        "https://linustechtips.com/topic/1476271-i-bought-a-gaming-pc-at-best-buy%E2%80%A6-am-i-dumb/",
        "https://howl.me/ciLpg5ILSFr",
        "https://geni.us/1jD8aaH",
        "https://geni.us/pKG0BT",
        "https://geni.us/AqJO",
        "https://geni.us/GVy7",
        "https://geni.us/Hi0Bg1",
        "https://geni.us/ICZG",
        "https://geni.us/rdeP5",
        "https://geni.us/11buGAs",
        "https://geni.us/iLhyBJX",
        "https://geni.us/RplFr67",
        "https://geni.us/PaI52PB",
        "https://geni.us/wu25Zf",
        "https://geni.us/zDEh",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Stop, wait. Everyone knows you shouldn't buy a pre-built gaming PC from a big box store. Don't be a sucker. Except that twice now we've sent secret shoppers to Best Buy, and after a bit of runaround, both times they came back with a pre-built gaming rig that ended up being a better value than we expected. But everyone strikes out eventually and it looks like it's Best Buy's day. Without spoiling too much, the four-minute extended warranty sales pitch was far from the worst thing that special agent Maria had to endure. Imagine being told to buy an overpriced machine today in hopes that the price will come down in time for you to come back to the store and apply for price protection. What? Now imagine that I'm gonna tell you all of those things after this message from our sponsor. - Origin PC, they have all the amazing things to offer this holiday season, including NVIDIA's 40-Series GPUs and Intel's 13th Gen CPUs. Learn more at the link down below. - Maria's mission was simple: buy whatever gaming PC the sales rep ends up recommending, within a few guidelines. One: it has to be under 1,000 US dollars. Two: it must include a graphics card. We have almost been burned by that one before. And three: it has to be available to just grab off the shelf and buy, like a regular person would expect. The greeter at the door directed Maria to the computer department, but it then took 10 minutes and multiple requests for assistance before the fourth employee finally offered to help. That's better than getting swarmed by commissioned salespeople like the bad old days, but maybe there's a happy medium to be found. He started by asking what sorts of games she plays. That's good, but then he went off the rails completely, suggesting that she could spend significantly more than her budget on a machine today because it had been recently on sale, and then she could come back to the store within the exchange window and hope that it would go on promo again to get a partial refund. Truthfully, he may know something that we don't. That might have been a good strategy, but rightfully, Maria was pretty sketched out by it. His next recommendation then was to back order a machine. Maria then reminded him that she needed the PC right away and things took a turn for the kind of even weirder. Rather than sell her one of the RTX 3060 Acer machines that was right there on the shelf, the rep suggested going to a couple of competing stores, one of which doesn't even seem to sell desktop computers anymore. And then, when she insisted on buying something from him, agreed to go look in the back for something she could take today. He returned with this: the ASUS G10CE-BB1560TI. Maria paid the man 825 US dollars and took her leave. Nothing about this thing screams gamer. There's no window, but there is an RGB zigzag slash down the front that ASUS warns can impact the performance of its Core i5 11400F CPU. So we're off to a good start here. The front panel connectors are on the top with two USB 3.0 five-gigabit ports and a single combo audio jack. And on the back of the motherboard, along with the usual mid-level io, we've got dual display ports and an HDMI port, even though the CPU in our configuration doesn't have integrated graphics. Finally, we've got the two display ports and two HDMI ports that we can actually use on the back of our GTX 1660 Ti GPU. Opening up the case, the cable management is, I'd say pretty okay. The only thing that isn't well secured is this bundle of extra SATA power cables in front of the 600-watt 80-plus Gold LiteOn power supply. They just kind of flop around there. There's not much in the way in cooling either. Basic CPU cooler, though that's probably fine for a Core i5, and then there's a 90-millimeter fan in the back. And if you wanted to upgrade the graphics down the line, you could mount a 120-millimeter intake in the front, but you'd have to contribute your own speed holes if you wanted it to get any fresh air. We've actually got a video that covers how to do that though if you like to laugh. The motherboard reports that it's, oh let's go ahead and fire it up now. Oh, the motherboard reports that it's a G10CE and the BIOS seems to be fairly republic of gamery and overclocking friendly until you start to dig further into the options. It appears that what ASUS means by G10CE is Pro B560M-CT/CSM with a coat of black paint and an ROG theme on what is otherwise a pretty bog standard BIOS. CSM stands for corporate stable model and basically means that it's unlikely to have much in the way of bells and whistles, but replacements should be readily available for some time, which I guess is neat. It's reasonably feature-full overall though. Four DDR4 DIMM slots, two M.2 slots, three PCI slots total, onboard Bluetooth and WiFi through an add-on card, and SATA ports for up to six additional storage devices. You'll have to get a little creative finding places to stick your drives with double-sided tape 'cause it doesn't actually contain that many drive mounts. Overall, it's a significant improvement over the non-standard motherboard that we got in the Dell machine back in 2020, but the configuration still has some odd choices, like the mere 12 gigs of SK Hynix DDR4 3200 memory. That's one eight-gig stick and one four-gig stick. Now, savvy viewers may remember that thanks to asynchronous dual channel, that size mismatch isn't the end of the world for performance, but almost anyone these days could benefit from another four gigs of RAM and our budget should have easily allowed for that. The same goes for our storage, and this is where the sales rep's biggest error becomes very apparent. In the last two years, SSD prices have fallen precipitously, but all we got was a 512-gig WD SN 530. I mean it's NVME at least, but there's no DRAM cache, and 512 gigs? The one-terabyte version of this drive is only $30 more. Ah, that's because this model is from 2021, according to the box. That would also explain the 11th Gen CPU and the ancient GPU. I mean, the G4 1660 Ti isn't a bad card, or rather it wasn't, but whether it's a training issue or the sales rep's personal biases affecting him, it is a much worse choice than the 3060-based Acer machines that were sitting right there and were within our budget. And I suspect it's gonna be a lot worse than what we can cook up ourselves. To evaluate the value of this system, we configured two comparables. First, one with parts available from Amazon and New Egg with the intention of building something that was as identical as possible. Like last time, we assumed the purchaser didn't have one of our beautiful LTT screwdrivers, available in lttstore.com, and we tacked on a 100 US dollar build fee, which was the typical fee quoted by the PC builders that we investigated. This gave us a total of 1,047 US dollars. Wow, that's more than $200 higher than what we paid for the ASUS at Best Buy. ASUS is clearly taking advantage then of the fact that they manufacture many of the core system components themselves. Looking like a pretty good value so far. So far. But what if we took our 1,000 US dollar budget and put together our own PC? In this case, we can make assumptions, like that we already have a decent keyboard and mouse kicking around, because of course we do, and we built the machine ourselves, saving us the build fee. We also didn't go out of our way to include WiFi because you really should be using a wire for gaming. We ended up with this for a grand total of $1,000.26. Don't worry, we'll take the extra quarter out of Dennis's paycheck. He won't notice. Starting our tests with Tiny Tina's Wonderlands on the high preset at 1080p, our ASUS pre-build actually handled the game nicely with a respectable 70 FPS average. It's only problem is that our custom-build doubled that at, if you remember, only about $200 more. In F1 22, we took some rainy laps of the Vancouver track on the high preset at 1080p, and again, our off-the-shelf PC managed to handle the game fine, just fine. Though it did get outperformed by our custom-build by about 28%. CS-GO is where the story changes somewhat. Our ASUS pre-built managed an average of 349 FPS while our custom-build managed only 267. Why, you might ask? Well, as it turns out, we forgot to follow AMD's advice and enable smart access memory in our BIOS, an easy enough mistake to make. Once we did that, we reran the benchmarks and got an average of 495 FPS, a 42% increase over this guy. This might seem like a minor note. \"Oh, well you guys made a configuration error \"and you fixed it.\" But that's exactly the sort of error that a first-time builder could make and they might not have any way of knowing that anything is wrong. So it really highlights why buying a pre-built can be an appealing option for people who don't wanna figure out all the ins and outs of PC building. As for non-gaming performance, we tried 7-Zip's benchmark, where our custom-build blew our pre-built out of the water. And in benchmark, it was pretty much the same story, though at least the margins were a little bit closer. So where does that leave us? Once again, Best Buy has shown that the shut up and take my money approach to buying a PC can actually work out okay for the customer. It took a little time for a sales rep to help Maria and it seems like he was hesitant to take advantage of her full budget for the machine. Maybe he hoped to leave some spare budget for the warranty upsell? Either way, armed with just a couple of basic rules, she ended up with a perfectly adequate gaming rig with decent name brand components, and for a lower price than she would've paid if she bought the same components and paid someone to put them together. Of course, by selecting smarter components, we were still able to build a significantly better machine at our stated budget. So I guess you'd have to say that the best buy wasn't at the Best Buy. Oh, stop groaning 'cause you can get the best buy with our sponsor, MSI. Have you somehow left Christmas shopping until the last second again? Well, worry not because MSI has you covered for gifts this year. MSI's holiday deals are on now. You can get new tech while saving money. I mean, who doesn't love that? Whether your kids need a new laptop for school or it's just treat yourself o'clock, they've got something for you. From gaming laptops to desktops to monitors, cases, components to GPUs and accessories, they've got great deals for all your needs. And a highlight of the sale is the limited edition MSI Fragment Z16 Creator Laptop, which was made in collaboration with Hiroshi Fujiwara, which you can grab right now for up to $1,200 off. So what are you waiting for? Check out MSI's deals and special holiday offers at the link down below to start saving. If you guys enjoyed this video, you might enjoy last round, where it was actually Riley who tried to get the best deal at Best Buy. (upbeat music)",
    "transcript_keywords": [
        "buy",
        "back",
        "ASUS",
        "Maria",
        "machine",
        "sales rep",
        "budget",
        "MSI",
        "gaming",
        "CPU",
        "sales",
        "Dell machine back",
        "ports",
        "Acer machines",
        "rep",
        "pretty",
        "prebuilt",
        "components",
        "Buy day",
        "machine today"
    ],
    "transcript_entities": [
        [
            "40",
            "CARDINAL"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "Acer",
            "ORG"
        ],
        [
            "CS-GO",
            "ORG"
        ],
        [
            "SSD",
            "ORG"
        ],
        [
            "One",
            "CARDINAL"
        ],
        [
            "RGB",
            "ORG"
        ],
        [
            "1,000 US dollar",
            "MONEY"
        ],
        [
            "GPU",
            "ORG"
        ],
        [
            "WD",
            "ORG"
        ],
        [
            "Dell",
            "ORG"
        ],
        [
            "this holiday season",
            "DATE"
        ],
        [
            "FPS",
            "ORG"
        ],
        [
            "AMD",
            "ORG"
        ],
        [
            "LTT",
            "ORG"
        ],
        [
            "three",
            "CARDINAL"
        ],
        [
            "Four",
            "CARDINAL"
        ],
        [
            "512",
            "CARDINAL"
        ],
        [
            "ASUS",
            "ORG"
        ],
        [
            "600-watt 80-plus",
            "QUANTITY"
        ],
        [
            "90-millimeter",
            "QUANTITY"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "Pro B560M-CT/CSM",
            "ORG"
        ],
        [
            "First",
            "ORDINAL"
        ],
        [
            "Christmas",
            "DATE"
        ],
        [
            "New Egg",
            "FAC"
        ],
        [
            "the extra quarter",
            "DATE"
        ],
        [
            "120-millimeter",
            "QUANTITY"
        ],
        [
            "Amazon",
            "ORG"
        ],
        [
            "MSI",
            "ORG"
        ],
        [
            "up to $1,200",
            "MONEY"
        ],
        [
            "70",
            "CARDINAL"
        ],
        [
            "100 US dollar",
            "MONEY"
        ],
        [
            "only about $200",
            "MONEY"
        ],
        [
            "the bad old days",
            "DATE"
        ],
        [
            "42%",
            "PERCENT"
        ],
        [
            "CPU",
            "ORG"
        ],
        [
            "four-minute",
            "TIME"
        ],
        [
            "13th",
            "ORDINAL"
        ],
        [
            "Vancouver",
            "GPE"
        ],
        [
            "ASUS",
            "WORK_OF_ART"
        ],
        [
            "ROG",
            "ORG"
        ],
        [
            "up to six",
            "CARDINAL"
        ],
        [
            "F1 22",
            "LAW"
        ],
        [
            "Intel",
            "ORG"
        ],
        [
            "10 minutes",
            "TIME"
        ],
        [
            "the last second",
            "TIME"
        ],
        [
            "four",
            "CARDINAL"
        ],
        [
            "2021",
            "DATE"
        ],
        [
            "1,047 US dollars",
            "MONEY"
        ],
        [
            "825 US dollars",
            "MONEY"
        ],
        [
            "one-terabyte",
            "QUANTITY"
        ],
        [
            "1,000 US dollars",
            "MONEY"
        ],
        [
            "Dennis",
            "PERSON"
        ],
        [
            "1080p",
            "DATE"
        ],
        [
            "five",
            "CARDINAL"
        ],
        [
            "the last two years",
            "DATE"
        ],
        [
            "only 267",
            "CARDINAL"
        ],
        [
            "M.2",
            "ORG"
        ],
        [
            "jack",
            "PERSON"
        ],
        [
            "11400F",
            "CARDINAL"
        ],
        [
            "12",
            "CARDINAL"
        ],
        [
            "fourth",
            "ORDINAL"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "these days",
            "DATE"
        ],
        [
            "only $30",
            "MONEY"
        ],
        [
            "2020",
            "DATE"
        ],
        [
            "3060",
            "CARDINAL"
        ],
        [
            "Hiroshi Fujiwara",
            "PERSON"
        ],
        [
            "more than $200",
            "MONEY"
        ],
        [
            "1,000.26",
            "MONEY"
        ],
        [
            "Two",
            "CARDINAL"
        ],
        [
            "3060 Acer",
            "ORG"
        ],
        [
            "Gold LiteOn",
            "ORG"
        ],
        [
            "349",
            "CARDINAL"
        ],
        [
            "Tiny Tina's",
            "PERSON"
        ],
        [
            "SK Hynix DDR4 3200",
            "ORG"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "NVIDIA",
            "ORG"
        ],
        [
            "Riley",
            "PERSON"
        ],
        [
            "SATA",
            "ORG"
        ],
        [
            "PCI",
            "ORG"
        ],
        [
            "RAM",
            "ORG"
        ],
        [
            "Maria",
            "PERSON"
        ],
        [
            "GTX",
            "ORG"
        ],
        [
            "DIMM",
            "ORG"
        ],
        [
            "USB",
            "ORG"
        ],
        [
            "11th",
            "ORDINAL"
        ],
        [
            "Best Buy",
            "ORG"
        ],
        [
            "NVME",
            "ORG"
        ],
        [
            "about 28%",
            "PERCENT"
        ],
        [
            "Core",
            "ORG"
        ],
        [
            "this year",
            "DATE"
        ],
        [
            "CSM",
            "ORG"
        ]
    ]
}