{
    "video_id": "-3xvh7uN7wY",
    "title": "Cream of Wheat Unboxing",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-04-06T17:53:43Z",
    "video_url": "https://www.youtube.com/watch?v=-3xvh7uN7wY",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 118781,
    "likes": 6669,
    "comments_count": 1321,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys it's Justine and today I'm unboxing something really exciting. I just ordered this and it arrived very quickly which I'm very excited about because I really wanted what was inside this box and it's crazy because this isn't a new product, but I thought it'd be really fun to just unbox it, show it to you, see the types of things that I'm getting during the lockdown. Who would've thought that there was a shortage of this product? I don't know. (upbeat music) - Huh, yes here it is. You're greeted with a nice little protective layer to protect your item. Here it is. (laughing) So here it is, we can take a look (laughing). This is the front of the box and you'll see here that this lets you know that you can make this in 2 1/2 minute cook time. Here we have all of our specs. There's a 100 milligrams of sodium, 25 grams of carbs, and there's zero sugars. That's a really great selling point. Here is a very big highlight on the spec sheet. It says that studies have shown that many Americans do not consume enough calcium. And here we have some of the instructions. Nothing new. Most products usually come with instruction booklets, but this one is just very nicely marked here on the back so you don't have to dig around on the inside to try to find any loose paper work. I just appreciate how thorough they are with everything that they have on the back of here because they let you know the best tips for results. So when you're preparing this with milk, just make sure that you watch carefully, stir to prevent the milk from boiling over. They also have a couple different models of this. This is the original. I am a huge fan of just simple, basic, but if you are interested in other models, maybe some upgrades, they have an instant brown sugar, they also have an instant variety pack, they have whole grain, and cinnamon. One of the things you should always check for are expiration dates, so up here they nicely have that labeled, right here, March 3rd, of 2022. Impressive shelf life. I mean you won't have to worry about your product going out of date for quite awhile. So this is the on button. You just have to press here, which I think is kind of misleading because I'm pressing and it's not very easy. It's perforated, but not very well. It's possible that they did that for security reasons. I mean it makes sense. That was really difficult. I mean I had to actually cut this open to get it to turn on. Do the smell test. Kind of smells like a new Mac. Well now that we pretty much have this all set up, all opened, all unboxed, I think that the next logical step is to go test it out and see how it works. Okay, the time has come to really give this a test. We're gonna follow the instructions. Oops. Oh gosh, I've already not followed these directions. Oh shoot, that was a little too much. (upbeat music) (water pouring) You don't really have to be that precise about measurements. I think it's gonna come out just fine. So I'm gonna be putting this in here to really make sure we can maximize all of the testing that we can possibly do. High for one minute and then we stir again. And then we continue to cook for an additional one to two minutes. I can't wait for breakfast tomorrow. (sanitizer spraying) Oh, so one of the things that you need to watch out for, is you gotta make sure it doesn't boil over. So this is kind of just a midway little stir with a wire whisk. It didn't say how how much to stir, so I'm using my own good judgment. (microwave beeping) My mom always told me not to stand too close to the microwave because it would affect me, my brain, but I gotta keep an eye on it because it's gonna overflow. Ah! This looks like a perfect consistency to me, do you think? (whisk tapping) You can always add some upgrades if you choose. For my upgrade today, we're gonna be going with a Mountain Forest raw honey and some cinnamon that is labeled twice as cinnamon. This is probably an off brand, generic which is totally cool as long as it's compatible with your current device, you should be fine. A little bit of this honey. Just a little. And I think our upgrade's complete. Let's try it. It's really hot, oh my gosh. This is great. I definitely recommend this version to everyone, for sure. Well thank you guys so much for watching. I know this probably isn't the first unboxing that has been done of this product. I'm sure every other tech reviewer has also unboxed this, but I just really wanted to kind of give my take on it and show you what I got today in the mail. And I just really hope that everyone is being safe and getting enough calcium. So some of you guys are confused as to what's happening, on Twitter I was having this conversation because I was looking for Cream of Wheat and I couldn't find it anywhere online. I didn't want to go to the store and the last time that I had gone to the store, they didn't have any, so I just didn't know what to do. So on Twitter somebody said, \"Hey, check Walmart.\" Guess what? Walmart had basically one box and they said that it would get here by Monday. It actually arrived overnight. I had Cream of Wheat freakin' FedExed to my house from Walmart. That is the time that we're living in right now. Everything is so weird. I can't wait for breakfast tomorrow.",
    "transcript_keywords": [
        "Justine",
        "Justine and today",
        "product",
        "make",
        "Cream of Wheat",
        "kind",
        "time",
        "stir",
        "box",
        "Walmart",
        "things",
        "exciting",
        "thought",
        "cinnamon",
        "test",
        "guys",
        "today",
        "Cream",
        "Wheat",
        "Twitter"
    ],
    "transcript_entities": [
        [
            "zero",
            "CARDINAL"
        ],
        [
            "Monday",
            "DATE"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "2022",
            "CARDINAL"
        ],
        [
            "Mountain Forest",
            "ORG"
        ],
        [
            "100 milligrams",
            "QUANTITY"
        ],
        [
            "one minute",
            "TIME"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "March 3rd",
            "DATE"
        ],
        [
            "25 grams",
            "QUANTITY"
        ],
        [
            "Twitter",
            "ORG"
        ],
        [
            "Walmart",
            "ORG"
        ],
        [
            "Americans",
            "NORP"
        ],
        [
            "2 1/2 minute",
            "TIME"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "overnight",
            "TIME"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "tomorrow",
            "DATE"
        ],
        [
            "Mac",
            "ORG"
        ],
        [
            "Cream of Wheat",
            "ORG"
        ],
        [
            "One",
            "CARDINAL"
        ]
    ]
}