{
    "video_id": "1vl9N4Sk8QY",
    "title": "NEW 2020 iPhone SE!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-04-15T22:45:44Z",
    "video_url": "https://www.youtube.com/watch?v=1vl9N4Sk8QY",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 793428,
    "likes": 28633,
    "comments_count": 2820,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- The iPhone SE is no longer a rumor, it is officially here. It comes in three colors. A white, a black and a product red and a starting price at 399. It has touch ID, so it doesn't have face ID. But it does feature an A13 bionic chip, which is the same chip that is in the iPhone 11 Pro. This phone is gonna be replacing the iPhone 8, and it is a huge upgrade from the original iPhone SE that people loved. I'm obviously a huge fan of having a larger screen size. But for a lot of people, they don't need a larger screen size. They just need a phone that works. That makes calls, that can take incredible photos and videos and this could be the phone for a lot of people, especially if they've been holding out on doing an upgrade. The storage capacity is 64, 128, and 256 and it's crazy because the jump form 64 to 128 is only a $50 upgrade. Obviously 64 is not that huge of storage, but most of the stuff people need nowadays, you can store everything in the cloud, your photos, your videos. So if you are looking to save, obviously the 64 option is there, but for a 128 upgrade for 50 bucks, you never know when you might need that extra storage, because I never thought that I would fill up a 512 gig phone, but guess who filled up their phone? Me, me. The Apple logo is now centered on the back, it has haptic touch. It does only have one camera on the back, but with this you can still do portrait mode. It doesn't support Pet portrait mode, but you can still do portrait mode with people. This one does not support night mode, unfortunately, as it does only have one lens. You're not gonna have the ultra wide or the telephoto. This is just the regular wide angle. The front camera is seven megapixels, which also supports portrait mode. A lot of this is thanks to the A13 biotic chip, because this is giving this phone way more processing power, that it's able to use algorithms to enhance these photos. So the back camera is a 12 megapixel camera and this will shoot 4K at 24, 30 and 60 frames a second. And something that I forget about quite a lot, is the quick take video when you press down the record button and you swipe, that'll let you quickly record a video. This also supports that and it's really great because this phone is so powerful. Most of the features that you're used to in iOS13, will be running just as smooth on this phone as it is on the iPhone 11's. The front camera only shoots 1080, but it does feature some cinematic video stabilization so even if you are filming with that front camera, your footage will be much more stabilized. It is water and dust resistant, so it has a rating of IP67, which means you can have it under water up to one meter for up to 30 minutes. Of course, obviously something that's not recommended. But just to know that if you do happen to drop your phone into one meter of water, it should be okay. As long as you get it out quickly. It's available for pre-orders on April 17th and then availability on April 24th. The new SE is also Qi wireless compatible which I, well I'm actually quite surprised at because the fact that this price is so low, that's usually something that people cut first to try to keep costs down. So I'm definitely glad that this does have wireless charging. It also supports Fast Charge, the charger that's in the box though, that it comes with, is not one of the fast charging bricks, so you will have to get a different one if you do wanna have Fast Charge. It also supports eSIM and Dual SIMs and is Wi-Fi 6 compatible. The thing I keep going back to though is the price. The fact that this is still 399, which is the same price as the iPhone SE was in 2016. Someone who wants to have the latest and greatest and the newest of tech, this is not for you. I think right now, more than ever, people are using their phones, basically, well I mean people use their phones to communicate anyway, but now in this weird time that we're in, the phone is really our only kind of contact to the outside world. To our friends, to our families, to our loved ones. And there's a lot of people that have older phones that they're not even able to do FaceTime, or able to connect with people in such an easy fashion. Definitely looking forward to checking this out. I would love to hear from you guys. What do you think of the new iPhone SE? Is this something that you've been looking forward to? Is this something that you've been holding out for? Do you think this is the perfect phone for your parents, for you grandparents? I would love to hear it all in the comments below and if there's anything else you would like to know about this phone, also leave those in the comments and I can follow up when I finally get one in my hands to unbox. I am I just realized my Switch is right here. That's weird. Guess it's a good time to check on my island now. Hey Tom Nook, are you gonna get an iPhone SE? He definitely is. (upbeat music)",
    "transcript_keywords": [
        "phone",
        "people",
        "iPhone",
        "longer a rumor",
        "portrait mode",
        "camera",
        "lot",
        "mode",
        "supports",
        "Fast Charge",
        "phones",
        "upgrade",
        "portrait",
        "front camera",
        "back",
        "supports Fast Charge",
        "price",
        "Fast",
        "huge",
        "video"
    ],
    "transcript_entities": [
        [
            "one meter",
            "QUANTITY"
        ],
        [
            "iPhone SE",
            "ORG"
        ],
        [
            "second",
            "ORDINAL"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "2016",
            "DATE"
        ],
        [
            "A13",
            "PRODUCT"
        ],
        [
            "399",
            "CARDINAL"
        ],
        [
            "50",
            "MONEY"
        ],
        [
            "24",
            "DATE"
        ],
        [
            "Fast Charge",
            "ORG"
        ],
        [
            "Switch",
            "ORG"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "seven megapixels",
            "QUANTITY"
        ],
        [
            "30",
            "DATE"
        ],
        [
            "256",
            "CARDINAL"
        ],
        [
            "4",
            "CARDINAL"
        ],
        [
            "up to 30 minutes",
            "TIME"
        ],
        [
            "three",
            "CARDINAL"
        ],
        [
            "Wi-Fi 6",
            "FAC"
        ],
        [
            "50 bucks",
            "MONEY"
        ],
        [
            "FaceTime",
            "ORG"
        ],
        [
            "12 megapixel",
            "QUANTITY"
        ],
        [
            "April 24th",
            "DATE"
        ],
        [
            "1080",
            "CARDINAL"
        ],
        [
            "128",
            "CARDINAL"
        ],
        [
            "60",
            "CARDINAL"
        ],
        [
            "Tom Nook",
            "PERSON"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "IP67",
            "ORG"
        ],
        [
            "SE",
            "ORG"
        ],
        [
            "April 17th",
            "DATE"
        ],
        [
            "512",
            "CARDINAL"
        ],
        [
            "64",
            "DATE"
        ],
        [
            "64",
            "CARDINAL"
        ]
    ]
}