{
    "video_id": "2fKUZS8R04M",
    "title": "HALO Infinite Xbox Unboxing! *emotional*",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-11-21T19:44:54Z",
    "video_url": "https://www.youtube.com/watch?v=2fKUZS8R04M",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 186326,
    "likes": 7816,
    "comments_count": 622,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Matty, I have to do this. Please let mommy do this. (machine whirs) (Matty barks) No, let me- You gotta let me do this. (Matty barking) I'm done, I'm off. So my grand entrance didn't work out, but in front of me, you guys may notice that I have the new Halo Xbox. This is the Infinite Edition and I'm so excited about this. And unfortunately I missed the pre-order window and then was not able to get one because they were all sold out. So I bought this from someone in a parking lot. So the Halo Infinite Edition Xboxes were all sold out and I found one online. So I'm going to meet this dude in this parking lot. It's still daylight, thankfully, but he wanted to meet in the back. Should we do this, Jen? - [Jenna] Yeah. - Okay, just keep filming, but don't let him know that we're filming just in case something happens. - [Jenna] Alright. - [Justine] Okay. Hi. Yes. Can I see it? - Yeah, yeah, you can do that. Yeah, yeah, yeah. - That looks so good. - Yeah, there it is. - Are you sure? - [Man] I'm sure, you good? You're good with this? - [Justine] Yeah, all right cool. Do you um- - Oh, nope, nope. Nothing else to see here. Nothing else to see. Yep, moving along. - Do you need help with that or? - [Man] No, no, I'm good. Nope, nothing else to see here, nothing else to see. - [Jenna] Is she okay? - [Man] Nothing else is in there. - Okay um- - There you go. There you are. Oh my God, thank you so much. All right, I gotta go, I gotta go. - Yeah see you. - Dude. And now we're going to unbox it. I'm currently home visiting my family and Jenna's here behind the camera and my sister's husband also has an Xbox here, so we're all going to have a Halo LAN party. And I am so excited. Let's unbox. I also wouldn't recommend that you buy things from strangers in parking lots, because that could be potentially dangerous, as I am a trained professional. So, don't do as I have done. (upbeat music) Like, I can't freaking get this off. Here we go. 20 years. That's so wild, that I remember playing Halo for the first time in college. And I was like, what are you guys playing? Let me play. Oh my gosh, I really need a knife. This is not working out. Okay, we're gonna need some scissors. - [Jenna] You gotta save the box. - [Justine] I know. (Justine laughs) Matty, honey, you didn't let me have my warthog entrance. Now you're blocking the shot. (laughing) Like what are you, what are you doing? - [Jenna] He wants to see what's in it. - You want to see what's in here, buddy? (gasps) Holy moly. Look at this. This is an outer cover. This isn't even the actual thing yet. - [Jenna] I just see dog legs. (Justine laughs) - It's a controller. Check this out, dude. Look at this, look at this. You're going to see this in Mommy's paws for a long time. You see, smell. Here learn about it, learn about it. 20 years of Halo, Matty. (upbeat music) Okay, we've got our cables Anything else in there? Like maybe a surprise candy bar? (laughing) I was really hoping for a surprise candy bar. Honestly, that should be the new norm. Okay, here we go. Here we go, here we go, here we go. Now, look at this. Even the outer little paper has like little stars on there. Uh-oh. - [Jenna] Uh-oh. - [Justine] Is the baby crying? Oh, look at this. Wow, look at the inside, it's all blue. Dude, this looks so nice. Wow. - [Breanne] Sorry, I told her she could play down here for two minutes before bath time. - [Justine] Well, - [Breanne] Two minutes. - [Justine] Oh you nakey baby. - [Jenna] Nakey baby. - [Justine] Brynney have you ever heard of Halo? The video game that Daddy plays? Does Daddy play video games? - [Jenna] Here Brynn, what is this? - A troll. Troll. Broken. - [Jenna] Broken. - No, there's no batteries in it. Okay. - [Brynn] Broken. - [Justine] Look at that. Yeah, okay, check that out. Like this thing looks incredible. Man we are going to have a time this holiday season. I like that this is all like etched in too. That's really nice. I love that this inside is blue. Like obviously if you've seen this before the inside is green. The child, is taking everything off the desk. (Brynn and Breanne talking in the background) Celebrating 20 years. Oh man, I'm very excited about this. So I guess basically, it's now unboxed. This video has gotten a little silly. (upbeat music) (Justine laughs) (Brynn screaming) - [Breanne] You're two minutes are up. - [Bryan] Wow, that's really cool, the blue. - [Justine] I know. I mean honestly, like my favorite thing is the inside here because you can see that normally where this is all green, it's all now like a blue coated color. And the fan. Can you see the fan inside? That's also like a black and blue speckled color. This is nice. This is actually really nice. Are you able to see that? - [Jenna] Yeah. - [Justine] Nice. - [Jenna] Does it make a special sound? - I bet it does. I bet it makes a special sound. (upbeat music) - [Justine] I'm hoping we get a special sound. (Xbox loading) - [Jenna] You didn't press the right button. (Xbox dinging) - [Justine] What a loser. (Justine and Jenna laughing) You didn't- - [Jenna] You didn't- - [Justine] No, I didn't. I pushed frigging disc eject. What an idiot. (Xbox loading) That was pretty special. (Xbox dinging) The fan air smells so good. (upbeat music) (Xbox dinging) (sniffing) Wow. (sniffing) It's really great. It's like, it smells like 20 years of Halo. (sniffing) You want to smell? - [Jenna] No. - Oh Okay. The offer's still there if you want. Let's plug in this controller. Plug it in? I mean, let's put batteries in it. (laughing) Look at that. Oh yeah, that's beautiful. Do you guys need me? I'm just going to be here smelling the fan air out of the X-Box. Is this what dogs do? - [Jenna] Jesse's sniffing. - I'm Jesse sniffing. Hello? Hi, I'm Cortana. A little touch of wifi here, a little touch of wifi there. We got the TV being set up in the back. Bryan's on duty. - [Bryan] I think it's plugged in. I can't confirm because I can't see back here. (Jenna and Justine laughs) - Can't confirm or deny. We may be playing, we may not be. Oh, should I plug it back in? Okay, wait, wait, wait. I want you to see the fan. - [Jenna] Well, I can't. I just see the blue on top. - [Justine] Oh yeah? - [Jenna] I don't see the fan. - [Justine] It looks incredible. - [Jenna] You'll see in the shot. You're gonna be like whoa. - [Justine] Wow, it's beautiful. - [Jenna] Like now you see it. Ohh. Now you don't. - [Justine] Like, I totally think that this was definitely worth meeting a stranger and taking this from the back of his car. - [Jenna] Yeah. - All right, I had to give him cash, but like- - [Jenna] You should have checked to make sure it was in there first. - [Justine] You're right. I just gave him money. He looked trustworthy. All right. Well, don't use my judgment. I'm going to go hook this up and play Halo. So let me know if you guys ended up getting one of these or if you're playing Halo this weekend. Let me know. Maybe you'll see me in the lobby. And if you do, please be nice to me. Be nice to me. But think about fashion. Look at this fashion. (upbeat music)",
    "transcript_keywords": [
        "Yeah",
        "Halo",
        "Halo Infinite Edition",
        "Infinite Edition",
        "Infinite Edition Xboxes",
        "nice",
        "fan",
        "Wow",
        "Halo Infinite",
        "good",
        "playing Halo",
        "inside",
        "blue",
        "play",
        "Halo Xbox",
        "special",
        "dude",
        "years",
        "Xbox",
        "guys"
    ],
    "transcript_entities": [
        [
            "Halo",
            "WORK_OF_ART"
        ],
        [
            "two minutes",
            "TIME"
        ],
        [
            "Justine] Brynney",
            "PERSON"
        ],
        [
            "Matty",
            "PERSON"
        ],
        [
            "Xboxes",
            "ORG"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "Halo",
            "PERSON"
        ],
        [
            "Halo Xbox",
            "ORG"
        ],
        [
            "Halo for the first time",
            "WORK_OF_ART"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "this holiday season",
            "DATE"
        ],
        [
            "this weekend",
            "DATE"
        ],
        [
            "Halo LAN",
            "ORG"
        ],
        [
            "20 years",
            "DATE"
        ],
        [
            "Jesse",
            "PERSON"
        ],
        [
            "Brynn",
            "PERSON"
        ],
        [
            "Xbox",
            "ORG"
        ],
        [
            "Justine]",
            "PERSON"
        ],
        [
            "Justine] Nice",
            "PERSON"
        ],
        [
            "Two minutes",
            "TIME"
        ],
        [
            "Xbox",
            "FAC"
        ],
        [
            "Bryan",
            "PERSON"
        ],
        [
            "Jen",
            "PERSON"
        ],
        [
            "Cortana",
            "PERSON"
        ],
        [
            "the X-Box",
            "FAC"
        ],
        [
            "the Infinite Edition",
            "FAC"
        ],
        [
            "the Halo Infinite Edition",
            "ORG"
        ],
        [
            "Breanne",
            "PERSON"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "Halo, Matty",
            "WORK_OF_ART"
        ],
        [
            "Jenna",
            "PERSON"
        ]
    ]
}