{
    "video_id": "5hyltdRHsm8",
    "title": "My everyday tech must haves!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-08-04T20:34:55Z",
    "video_url": "https://www.youtube.com/watch?v=5hyltdRHsm8",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 404020,
    "likes": 15731,
    "comments_count": 823,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hi, guys. How's it going? So, as many of you know, I've been traveling back and forth to visit my family in the East Coast. So I've been incredibly mobile, as of lately. I've kind of set up a little studio in my sister's finished basement. She's got a bar, as you can see behind me. It's actually been quite nice 'cause I kind of feel like I'm able to just set stuff back here, show it to you. And, it's actually a really nice set. For today's video, I was trying to peer down what are the things that I actually can not live without. If I'm leaving the house, these are the few things that I'm going to bring. So the first thing that I have to have with me, obviously, are my phone and my Apple Watch. And recently, I have been real into this. I like having my phone cases match my Apple Watch bands, obviously. A lot of the work that I need to do, like emails, posting things on social, I can do that all directly from my phone. But I do edit still a lot in Final Cut, which is where my MacBook comes in. I've been using the M1 13-inch MacBook. And before I get into the MacBook, I need to show you guys the case. This is by Nomad. And honestly, I'm not gonna lie to you when they first came out with this, I was like, mm, I love Nomad, but I don't really love cases on my MacBooks. I've never had a case ever. In my entire life of owning a computer, never have I got a case for it. Maybe if I would've tried cases sooner, I would have realized how awesome they are. This is such incredible quality. And I'm able to just open this up. It protects my laptop. Obviously, that's what a case is supposed to do. But also what I love is because I'm usually sitting on a couch or if I'm on an airplane or wherever I am, I even use this as a little lap sit, kind of like its own mini little desk. And to go along with that, it also have a matching mousepad. I recently did start traveling with a Magic Mouse. Even though I am incredibly efficient at editing with a trackpad, it something about just being able to use a Magic Mouse and scroll through my timeline when I'm editing. It's just so much more time efficient. Of course with that, sometimes I will end up at a desk that happens to be glass or reflective. And you know what you can't do with a mouse on that type of table? Use it, it doesn't work. So they have this matching mousepad, and there have been times where I've also forgot the mouse pad. But guess what this can act as? (mouse banging) A freaking mouse pad. I know. (mouse smashing) Oh, almost lost my mouse. The 13-inch M1 has pretty much been my main device since it came out. And I'm still so incredibly surprised how efficient this thing is, how fast, how I'm really able to do anything that I've needed to do, like huge projects I've edited on this. It has definitely been through some things, but that's okay. Haven't we all? Got our little Same Brain sticker on there. Looks great. Also, never been a sticker person. Who am I? I don't even know. But this case, can't believe it. It's like I'm a changed person. So usually, I just toss this right into my backpack, in the laptop section, and we are good to go. So this next product is actually one of the sponsors for today's videos and they are honestly, such huge supporters of me and my channel. And I'm so excited to show this to you. I may have showed this to you guys before. But this is the Envoy Pro Elektron. Now this is a very tiny, mini, little, solid-state drive and it's so... (floorboard scraping) Freaking loud upstairs. (floorboard scraping) What are you doing? Are we doing construction today? (Justine screaming) The only downfall of not being in my own space, is there's a baby upstairs. She stomps a lot. For being a very small child, she can move a lot of things and make a lot of sounds. Anyway, take a look at this drive. Look how small this is. I do edit almost all of my videos off of OWC drives. And why I love this one so much is obviously, it is small. It's compact and I can take it anywhere. It has some incredibly fast read/write speeds, and it's also really durable. So it's crushproof, dustproof, and waterproof with an IP67 rating. Now, what that means is this can stay under water for 30 minutes at one meter, and you should be fine. Now, I definitely wouldn't recommend testing that, especially if you have important data on here. But knowing that that is a possibility, makes me feel so much safer when traveling with this drive. This works with a Mac, a PC, and it also works with the iPad Pro. So you can actually put content on here and you can mount this in your iPad, and be able to get all of the files off of it. You could also save things to it. So it's really great for me because I'm able to transfer things from my Mac to my iPad Pro, and do all of my work off of this little device. OWC has a ton of storage solutions and they are basically, all I use to store all of my content. Not only from editing directly off of them, but also as a backup solution. So you can get these drives starting at 240 gigs all the way up to two terabytes. This is the two terabyte version. So if you are on the go and you need a quick, simple, small, and portable solution for storing your files, ah, hi. This little guy right here. I'll put a link in the description if you wanna check out the Envoy Pro Elektron by OWC. They also have a ton of other incredible drives. So check it out and let me know what you guys think. So obviously moving on, we have this. This is, you may have seen this before, but this is the MagSafe Duo Charger. And I honestly, don't leave the house without this. I actually have two of these. So this one stays with me and I put it in my bag at all times. I can charge my Apple Watch and obviously, I could charge my AirPods and my phone right there. I had to buy that separately, but also this stays with me everywhere I go. And I do usually carry a few different cables that are USB-C, so I can just use this little guy and charge everything from here. But this thing, key. And speaking of AirPods, these are my AirPods of choice. Yes, I do have the AirPods Max, but these old-school with the wireless charging case are my go-to. First of all, they're small. And if I am out somewhere and I'm going for a run, these are so perfect because a lot of headphones don't stay in my ears. And for whatever reason... (phone ringing) Um, yes, hello? (fun upbeat music) Where was I? Hard to say. I think I was talking about running with my AirPods and them staying in my ears. Oh, I don't remember. (Justine chuckling) Yup. I guess I move on. If you guys know me, I never leave home without a knife. This has been my go-to recently. This is a Benchmade knife. It's really light. Carbon fiber on it. Check this out and check out this blade, the smooth open. I also love this little blue... Can you please focus right here, please? Thank you. Yup, uh-huh. There's a little blue accent if you can see it right there, which I really like. I have a lot of different knives for a lot of different scenarios, But because this one is super light, I can take this on hikes. I can use it for unboxings. I also have some knives that I usually carry for more protection and those ones are easily deployed out of my pocket. But this is just a nice, simple, small, compact solution for my unboxing needs. Next up. This little guy. So this is a mobile tripod. But what's great about it is this is able to be not only a regular tripod, so I can use this for an actual camera. And then I just mount this right on top of it, so then I'm ready for those TikToks. I love having a mobile tripod because you never know when the mood will strike, when you need to make a TikTok or a Reel or YouTube Short. Honestly, I don't even know what I'm doing anymore. Moving on, of course we have our Nintendo Switch. I'm so excited about the OLED Nintendo Switch. I haven't even made a video talking about that yet, but dude, the hype is real. So I have this simple little case that I carry my Switch in. And I just got this Joy-Cons the other day. I wanted to switch it up, so I got the neon. I think they were calling this neon yellow but it's more of an orange, and the neon purple. So I've got that. I think I got this on, I don't know, probably Best Buy. Speaking of Best Buy, I also got this recently at Best Buy. I was looking for a big battery pack and I found this Anker one, and this is actually really nice. Check this out. So it has this nice little gradient on it, and it also has two USB-A and USB-C, and you can charge it with USB-C. This is the PowerCore III Elite, 25,600 milliamp hours. That's a lot of juice. I wanted something that wasn't too heavy or too big. This one is fairly heavy, but considering the amount of recharge power you're gonna have with this. This I can use to charge my Switch. I've used this to charge my MacBook. I actually use this to charge the camera that I'm using right now. So very happy with this purchase. Very, very excited about it. And then our last but not least, is a Rubik's Cube. And this one actually connects to it's called, the heck is it called. It's like a little robot Rubik's Cube solver. And I bought it because I wanted to be able to scramble the cubes better because I felt like whenever I was scrambling them, I wasn't doing a good enough job. So I was like, I need a robot scrambler. So I got the robot scrambler, but then that's actually still in California right now, so I can't show it to you. But this cube is so great because it... (cube smashing) But it connects Bluetooth, and you're able to connect it to the app, Cube Station. I talked about this before. I just keep forgetting what it's called, 'cause it's actually not even in English. So half the time there's prompts that show up, And I just hope that I'm picking the right answer. But it's really cool because it's actually been helping me get better solves. Because it's able to scramble better than I'd ever be able to scramble. The Rubik's Cube for me has been something that I'm able to sort of really focus on. And if I'm feeling really anxious, I just kind of break this thing out, do a couple turns, even if I'm not even solving it. It's just like a fidget spinner for me. This is kind of like my little secret weapon, other than my actual weapon. Oh, I need to show you guys my backpack that I've been using. I've showed you guys this before, but this has been one of my favorite backpacks. This is actually a little Stormtrooper number. Oh, look at this. I've also got another Rubik's Cube in here, too. Just you know, just in case. I'm not even that good at solving. I mean, I can solve under two minutes, but not that often. A lot of this stuff I just put in here, and then I do have a larger laptop bag that I do put a lot of my stuff in. Well, thank you guys so much for watching. I hope you guys enjoy this video. If there's anything else that you think I should add to my daily carry collection, please leave it in the comments below. And if you guys would like to share any of your collections of what you guys carry with you daily. also feel free to leave those in the comments below. I'll see you guys in the next video. Bye. (fun upbeat music)",
    "transcript_keywords": [
        "guys",
        "lot",
        "Apple Watch",
        "Rubik Cube",
        "case",
        "things",
        "Cube",
        "Envoy Pro Elektron",
        "Mouse",
        "charge",
        "Switch",
        "East Coast",
        "love",
        "show",
        "small",
        "thing",
        "Pro",
        "Magic Mouse",
        "Rubik",
        "Envoy Pro"
    ],
    "transcript_entities": [
        [
            "one meter",
            "QUANTITY"
        ],
        [
            "USB-C.",
            "ORG"
        ],
        [
            "the iPad Pro",
            "ORG"
        ],
        [
            "the PowerCore III Elite",
            "ORG"
        ],
        [
            "English",
            "LANGUAGE"
        ],
        [
            "Magic Mouse",
            "PERSON"
        ],
        [
            "AirPods",
            "PRODUCT"
        ],
        [
            "30 minutes",
            "TIME"
        ],
        [
            "two minutes",
            "TIME"
        ],
        [
            "MacBook",
            "FAC"
        ],
        [
            "iPad",
            "ORG"
        ],
        [
            "TikToks",
            "LOC"
        ],
        [
            "USB-C",
            "ORG"
        ],
        [
            "Switch",
            "ORG"
        ],
        [
            "Pro Elektron",
            "PERSON"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "25,600 milliamp hours",
            "QUANTITY"
        ],
        [
            "up to two terabytes",
            "DATE"
        ],
        [
            "OWC",
            "ORG"
        ],
        [
            "Mac",
            "PERSON"
        ],
        [
            "iPad Pro",
            "PRODUCT"
        ],
        [
            "Reel",
            "ORG"
        ],
        [
            "M1",
            "PRODUCT"
        ],
        [
            "240",
            "CARDINAL"
        ],
        [
            "a ton",
            "QUANTITY"
        ],
        [
            "mm",
            "PERSON"
        ],
        [
            "YouTube Short",
            "PERSON"
        ],
        [
            "the other day",
            "DATE"
        ],
        [
            "Nomad",
            "PERSON"
        ],
        [
            "USB-A",
            "ORG"
        ],
        [
            "half",
            "CARDINAL"
        ],
        [
            "Switch",
            "PRODUCT"
        ],
        [
            "the East Coast",
            "LOC"
        ],
        [
            "Nintendo Switch",
            "ORG"
        ],
        [
            "daily",
            "DATE"
        ],
        [
            "Final Cut",
            "WORK_OF_ART"
        ],
        [
            "this Joy-Cons",
            "ORG"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "MacBooks",
            "ORG"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "California",
            "GPE"
        ],
        [
            "13-inch M1",
            "QUANTITY"
        ],
        [
            "a Magic Mouse",
            "WORK_OF_ART"
        ],
        [
            "MacBook",
            "DATE"
        ],
        [
            "the AirPods Max",
            "PRODUCT"
        ],
        [
            "Anker",
            "ORG"
        ],
        [
            "Best Buy",
            "ORG"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "IP67",
            "ORG"
        ],
        [
            "Cube",
            "ORG"
        ],
        [
            "Cube Station",
            "ORG"
        ],
        [
            "Apple Watch",
            "ORG"
        ],
        [
            "Rubik",
            "ORG"
        ],
        [
            "Mac",
            "ORG"
        ],
        [
            "First",
            "ORDINAL"
        ],
        [
            "TikTok",
            "ORG"
        ]
    ]
}