{
    "video_id": "6d71oGtvnxM",
    "title": "New 2021 Apple TV 4K!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-05-20T13:09:22Z",
    "video_url": "https://www.youtube.com/watch?v=6d71oGtvnxM",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 668498,
    "likes": 21581,
    "comments_count": 1171,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine. And today we are unboxing the brand new Apple TV 4K with the brand new redesigned Apple TV remote. And when they announced this, Twitter just lit up with how excited people were about this new remote. So we're going to get a chance to check it out right now. Slice. Slice. Slice. Check it out! This does look very similar to the previous version, but this now will support high frame rate HDR content. Because the new iPhone 12 does shoot Dolby Vision HDR, we'll be able to play back that content on your new Apple TV 4K. But let's take a look at this new remote. Look at you. So they now have the Siri button right on the side. This outer edge is also touch-controlled so you can just kind of scroll back and forth through your content. And the buttons are very similar, but it just feels better, it's a little bit thicker. I feel like they should have integrated AirTags into this, so you'd be able to \"Find My Apple TV Remote\" because this is something that I could never, ever find. I do honestly just end up using the remote that's built into my iPhone. But I do love the look of this new redesigned remotes. So I look forward to testing this out after we get our Apple TV all synced up to our TV. One feature that I'm so excited to test out is the color calibration. You can use your iPhone to color calibrate your Apple TV to get the best possible look. So you're just going to hold your iPhone up to the TV and it's using the front facing camera to help calibrate to get you guys the best look using your iPhone and the new Apple TV 4K. Is there anything else in the box? We've got a little USB 2 lightning cable to charge the remote, a power cable, and the HTMI cable is sold separately. So that the unboxing. I'm actually home visiting my parents right now, so we're going to go to my sister's house and get this all set up and get her TV color calibrated. (upbeat music) So I have the Apple TV all set up and one of the things that I love so much about setting up new Apple products is they're so easy to configure. All I had to do was bring my phone close to the Apple TV and it basically set up all of my settings for me. I have been traveling this past week. I finally got a chance to go home to visit my family. I'm fully vaxxed and I've been hanging out with them all week so this is actually my sister's little television setup in her living room. And I have the Apple TV all set up here. So even watching content, I've been doing Apple Fitness classes on this because I do have, of course, my Apple Watch. And that's one of the really cool things about Apple TV is you are able to integrate with Apple Fitness. If you do have an Apple Watch, you can do your classes on the TV. It'll show all of your stats right up here. It'll connect directly to your Apple Watch. It's saying connect to Apple TV. Look at this, look at this. There it is. Connect to Apple TV. Let's do it. I love even if I'm traveling, I'm able to take my fitness routines with me using Apple Fitness and I do actually use Apple Fitness a lot. I mostly do a lot of yoga classes. Dustin is my favorite yoga instructor on Apple Fitness. So I've been doing a bunch of his classes and it looks like he has a new hip hop class right here. - Soften your knees, curl your tail under roll- - Here's a little preview. - Up to standing. Big breath in, your palms touch, upward salute. Hi, I'm Dustin. All the poses in this short, slow flow are done standing to help you release tightness in your shoulders- - I do use Apple Fitness a lot on my iPad when I'm at my gym at home, but it really is incredible that you can do this on a big television, as well. One thing to note though is this is an LGTV and it does have an Apple TV app built into it. If you do have one of those, you aren't able to use the Apple Fitness features to connect to your Apple watch. You can only do that with the standalone Apple TVs. One feature that is really cool about this new Apple TV 4K is the color calibration feature. You're able to use your front facing iPhone camera to calibrate your television to get the best color accuracy. We just go into Video and Audio, scroll down to Color Balance, and we're going to adjust the color balance. So it says Apple TV will measure and adjust your TV's color balance. For best results, avoid bright or highly saturated picture modes like vivid or sport. We're going to click Continue to connect. (upbeat music) Let's turn your phone around to the front facing camera is pointing at the television, hold it centered in the outline and it's supposed to be about an inch from the screen. So you can see that these colors are popping up, and this is using the front facing camera to determine the accuracy of the colors, which is pretty freaking cool. And our color balance is complete. Now we're going to be able to get to see these results. Now obviously I'm filming this on the camera so it's going to be kind of hard for you guys to really see the difference, unless you're actually seeing it in person. So this is what it looks like if it's balanced, and here's the original. Okay you can see, look. This has a much warmer color in the sand. The greens are a little bit more vibrant in the water. Here's the original. Here's balanced. Original. Balanced. We're going to stay with the balanced color. This is really great for a lot of TVs that don't have Dolby Atmos or something similar built into it. This TV actually already does. So the color calibration on this TV is already really good but it's kind of cool that you're able to even dial that in even further. So if you have Apple Arcade, you can now connect the next-gen consoles to your Apple TV and you can use your controllers to play games in Apple Arcade. And this is pretty exciting, especially for those who already have these consoles and you want to connect a controller to it. You can. Where's my story time game? Oh, Cozy Grave? Grove that says grove. Not Cozy Grave. I'm really close to the TV so it's kind of hard to read. So there's tons of games that you can play on Apple TV. And of course you can listen to music. I can say, \"play Slayer.\" (metal music) Now this is a hit. No one can tell me differently. I love how they have the lyrics up here. So you know, just in case you wanna have a family sing-along to some Slayer, you can. From a lacerated sky Find me a comedy movie. I actually just watched this last night, \"Together Together\". It was good, but if anybody has seen it let me know how you feel about the ending. So obviously it's Apple TV so if you do have a TV plus subscription, you'll be able to watch all of this wonderful Apple TV content. This is next on my list that I want to watch is Billie Eilish's documentary. God, I fricking love Billie Eilish. Fricking love her! New controller is really great. You can actually use touch gestures around this outer wheel to go forward or to go backwards when you're watching content. There's two new buttons. We have this button here, which is the new power button. So you can turn your Apple TV on or off, or it'll be able to control your TV. And there's also a new mute button, which is very exciting because that was something that they didn't have before. And of course the Siri button has been relocated right there to the side. And to charge it, just like before you've got your lightening port here. I love the new remote. So I just downloaded the Red Bull app because they have a special section here that we'll take full advantage of using the 4K HDR high frame rate that is now available on the new Apple TV 4K. So here we have 4K HDR content. (upbeat music) Look at these colors! They are so vibrant. It looks really good. Something else that's really great is the fact that now the new iPhone 12 does shoot high frame rate HDR, taking advantage of the Dolby Vision HDR. And now all of the Apple TV 4K supports that, you'll be able to play that content directly on your television to get the full effect. So basically you will have a full Dolby Vision 4K HDR camera in your pocket. Well, thank you guys so much for watching. I'm very excited to continue testing this out further. I have a bunch of fun Apple videos that I posted this week. So I'll put those in the descriptions so be sure to check those out and subscribe for more videos. Give this video a thumbs up if you enjoyed it and hit the bell so you'll be notified when I post new videos. And with that, my friends, I will see you in the next video. (upbeat music)",
    "transcript_keywords": [
        "Apple",
        "Apple Fitness",
        "Apple Watch",
        "Apple Fitness classes",
        "Apple Arcade",
        "Apple Fitness features",
        "color",
        "Fitness",
        "Dolby Vision HDR",
        "HDR",
        "remote",
        "content",
        "Watch",
        "iPhone",
        "Dolby Vision",
        "Color Balance",
        "Justine",
        "Apple videos",
        "connect",
        "love"
    ],
    "transcript_entities": [
        [
            "Video and Audio",
            "WORK_OF_ART"
        ],
        [
            "AirTags",
            "FAC"
        ],
        [
            "all week",
            "DATE"
        ],
        [
            "Billie Eilish's",
            "PERSON"
        ],
        [
            "Dolby Vision",
            "ORG"
        ],
        [
            "Billie Eilish",
            "PERSON"
        ],
        [
            "iPad",
            "ORG"
        ],
        [
            "LGTV",
            "ORG"
        ],
        [
            "USB 2",
            "PRODUCT"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "Together Together",
            "WORK_OF_ART"
        ],
        [
            "this last night",
            "TIME"
        ],
        [
            "Dustin",
            "PERSON"
        ],
        [
            "Apple Arcade",
            "ORG"
        ],
        [
            "Siri",
            "ORG"
        ],
        [
            "K",
            "ORG"
        ],
        [
            "tons",
            "CARDINAL"
        ],
        [
            "4",
            "CARDINAL"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "Dolby Vision 4K",
            "ORG"
        ],
        [
            "Apple Arcade",
            "FAC"
        ],
        [
            "Grove",
            "ORG"
        ],
        [
            "this past week",
            "DATE"
        ],
        [
            "Color Balance",
            "ORG"
        ],
        [
            "Siri",
            "PERSON"
        ],
        [
            "Dolby Atmos",
            "ORG"
        ],
        [
            "iPhone 12",
            "PRODUCT"
        ],
        [
            "the Red Bull",
            "ORG"
        ],
        [
            "this week",
            "DATE"
        ],
        [
            "Apple Fitness",
            "ORG"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "an Apple Watch",
            "ORG"
        ],
        [
            "Twitter",
            "PRODUCT"
        ],
        [
            "Apple Watch",
            "ORG"
        ],
        [
            "Slayer",
            "PERSON"
        ],
        [
            "Apple TV",
            "ORG"
        ],
        [
            "One",
            "CARDINAL"
        ]
    ]
}