{
    "video_id": "6UYlInm9g6I",
    "title": "iPhone 12 Pro Camera Test!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-10-31T17:44:53Z",
    "video_url": "https://www.youtube.com/watch?v=6UYlInm9g6I",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iPhone 12 pro",
        "camera test"
    ],
    "views": 1041308,
    "likes": 28986,
    "comments_count": 1578,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine. And today we're testing out the new iPhone 12 Pro. I'm gonna take some photos and videos but first, thank you to dbrand for sponsoring this video because I just put on their new tempered glass screen protector and this thing is... It just blew my mind. New iPhones mean new dbrand skins. We also have one of their cases but we also have something new, we have their new tempered glass screen protector. And why this is very exciting is because the new iPhone 12 is a completely flat display. It will allow for some very precise placement of the screen protectors. You might be saying Justine 'Yeah, but the new iPhone 12 has new Ceramic Shield which is four times stronger than the previous iPhone 11.' Yes, it is but it is about the same as far as scratch resistance, so I do not wanna make the same mistake I did last year by not putting a screen protector on mine. So we're starting off this iPhone 12 right. I mean they even give you a little screen bubble pusher. (upbeat music) (upbeat music continues) - Wow! This is perfect. (knife scratching) - Oh my God, it's not even scratching it at all. I just thought okay I'll stab it and if it does scratch it, cool, great, I have another one. I'll put that one on. I'm so impressed. Let's get a case on this thing. (upbeat music) - Oh, hear that! That looks good. Oh, did you need to dbrand your MagSafe? You could do that too. That's great. Okay, back or not, oh it's a little windy. Back on Life on Tyler's here. Hi Tyler. And like I've said before, the biggest difference between the 12 and the 12 Pro is the 12 does not have a telephoto lens and you could only shoot in 30 fps as opposed to the 60 frames Dolby Vision HDR. So, let's go take some photos and videos, yes? I still got a sprained ankle so we'll take this real slow. It is so beautiful. It just rained so it feels so fresh, it's so fresh. What is that? Is that a person or is that a... That is a person's feet, are they flipping? Yes, they're doing some sort of activity. (upbeat music) (upbeat music continues) - Should we take a picture of these people? One thing I wouldn't be able to do if I was shooting this on the 12 is there's no telephoto, but we'll be able to see them. (upbeat music) (upbeat music continues) (upbeat music continues) - I'm using the OSMO Mobile 4 to stabilize my shot as I'm walking. It already has really incredible stabilization but just having this added gimbal to get these shots makes it look so much cooler. One thing that I am excited to show you guys though is the difference between HDR footage on the 12 Pro and the 11, because right now you're not actually able to see the HDR because I'm exporting this video on STR. But when you are really taking this into final cut, you're able to see the color detail, you're able to see how much more color you... It's windy again! They just asked who I was talking to. I'm talking to my friends on YouTube. So because I'm posting this on YouTube it is an STR clip You're not gonna really be able to see the difference but when you do take this into final cut and comparing the footage between the 12 and the 11, there is such a huge difference because you have so much more color detail, you have the ability to bring up and down the highlights so much more than you could in the non-HDR footage. So a lot of you guys keep saying 'but it looks the same' I promise you, as someone who has edited this video and other ones, it is not the same. (upbeat music) - The front-facing camera's also amazing because they have added an update to this so you'll be able to do front-facing Night Mode which is kinda cool. I haven't really got to test it out as much as I'd like. I did a little bit but sometimes when it's really dark, I just use the flash to get a good selfie but the fact that they've added Night Mode on all of these lenses is pretty cool. Speechless. (waves rolling) - It just takes a good photo every single time That's a nice photo. That's a nice photo. That's wasn't a nice photo. (upbeat music) (upbeat music continues) (upbeat music continues) - [Justine] Hey bird! (upbeat music) - Everything in Ultra Wide just looks terrifying. This looks like I'm at the Grand Canyon right now. I'm not. Spoiler! (upbeat music) (upbeat music continues) - Let's get that wide angle. I found a rock, it's pretty. (soft music) - It's nighttime which means it's Night Mode time. Night Mode is available on every single camera on the iPhone 12, and it's only on the wide angle on the iPhone 11. The sun just went down. It's not really dark enough to really show you guys how incredible Night Mode... You are going to shut up. You're going to shut your mouth now. (laughing) Obviously Night Mode hand held is pretty good but the tripod Night Mode is where this really shines. Let's go find some darkness. Not that I don't love the industrial roof or anything. (upbeat music) - Oh God! (upbeat music continues) (upbeat music continues) - I'm so scared. I'm not gonna sleep tonight. (upbeat music) - It's creepy! I'm never gonna be able to sleep, ever again. That's a lie, but it is really spooky. (upbeat music) (upbeat music continues) - [Justine] I can't wait to see this. Wow! Look at the difference. You could actually see the clouds moving because it was able to take a 30 sec shot Wow! Well, I think you guys get the point. Ultra Wide Night Mode on the iPhone 12 is incredible. Alright, I'm hungry. We're done with this video now. (laughing) (plane engine roaring)",
    "transcript_keywords": [
        "Night Mode",
        "Mode",
        "Night",
        "iPhone",
        "Wide Night Mode",
        "screen protector",
        "glass screen protector",
        "added Night Mode",
        "Night Mode time",
        "incredible Night Mode",
        "screen",
        "frontfacing Night Mode",
        "tempered glass screen",
        "difference",
        "guys",
        "Night Mode hand",
        "tripod Night Mode",
        "Wide",
        "photo",
        "Ultra Wide Night"
    ],
    "transcript_entities": [
        [
            "iPhone 11",
            "PRODUCT"
        ],
        [
            "Dolby Vision",
            "ORG"
        ],
        [
            "12",
            "CARDINAL"
        ],
        [
            "Ceramic Shield",
            "ORG"
        ],
        [
            "sec",
            "ORG"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "tonight",
            "TIME"
        ],
        [
            "Ultra Wide",
            "WORK_OF_ART"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "30",
            "CARDINAL"
        ],
        [
            "the iPhone 11",
            "EVENT"
        ],
        [
            "YouTube",
            "ORG"
        ],
        [
            "last year",
            "DATE"
        ],
        [
            "four",
            "CARDINAL"
        ],
        [
            "Night Mode",
            "WORK_OF_ART"
        ],
        [
            "Ultra Wide Night Mode",
            "WORK_OF_ART"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "the Grand Canyon",
            "LOC"
        ],
        [
            "YouTube",
            "PERSON"
        ],
        [
            "60",
            "CARDINAL"
        ],
        [
            "Tyler",
            "PERSON"
        ],
        [
            "11",
            "CARDINAL"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "One",
            "CARDINAL"
        ]
    ]
}