{
    "video_id": "7s3XmTfVY3Q",
    "title": "BTS Samsung Galaxy S20 Phone?!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-06-28T18:28:50Z",
    "video_url": "https://www.youtube.com/watch?v=7s3XmTfVY3Q",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "bts"
    ],
    "views": 177855,
    "likes": 8305,
    "comments_count": 974,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, Justine. - And I'm Jenna. - And we have another podcast episode. Can you believe it that we're at four episodes now. - That's some serious commitment that we are for filling. - I mean we got four episodes in three weeks, that's like whoa. - I don't think I've even posted that many YouTube videos. - I don't think so either, 'casue these have actually taken way more time than I thought they were gonna take. - It's true. - I was like this will just be a simple, fun little, what was that? - [Camera Operator] My airpod - I thought gum fell out of your mouth - So I'm gonna give you guys a couple little highlights here from this pod that is out. I'm gonna put a link in the description where you guys can check it out. You guys can subscribe. I'm so new to podcasts, I don't listen to that many podcasts. I mostly listen to murder podcasts. (Jenna gasps) - Dun dun dun. - So, that, they can't hear that. This set up is still kind of temporary. We're borrowing some equipment right now just testing out different some things to see what will work. I'm having so much fun. - That's good that's what life is sometimes about. - This is a lot of work too, it's fun but it's also work. Like people don't realize how much time and effort goes into making like anything. We set up for three hours today. - And Tyler did most of the work. - I did a podcast before this for somebody else and then I came here and did another podcast. I am excited about the future of, anyway I don't know, I'm not even sure what I'm saying, I need to go take a nap, but, let's give some highlights from today's podcast episode. - Roll that clip. - Roll that clip. Hey I'm Justine. - And I'm Jenna. - And you're listening to, - Same Brain Podcast. - Roll that intro. (bouncy music) - Wasn't that amazing, didn't you love that little song? - Oh my gosh, could you believe it, that was incredible. - That was great - Very professional - Tyler picked that out. - This is our fourth podcast, - Fourth? - I believe so. - We did two this week so we basically doubled our podcast episodes this week. - That is extremely impressive, I just feel like there's so much happening all the time. We are here to cover all of it. - One a week. - Some of it. - You know whatever, we've got some fun little things here that you guys requested on twitter that we talk about. - There's buttons that we can push. - Yeah but don't push, no push. - What if I push one? - Just push one. But don't push the one that I don't want you to push 'casue it's so loud in my head. - Oh all right then I'll push another one. (magic noise) - Oh - Welcome to Same Brain. - Wow, what's this one do? (crickets chirp) Oh that's the crickets. - That's the crickets. Oh my gosh we have five stars. - How many reviews do we have? - 186 reviews. - Wait really? How? - \"Oh my gosh you guys are so good at podcasting. You keep me entertained and your positive attitude is amazing, keep up the good work. #SameBrain\" - Oh my goodness - Another one, \"Wow,\" I forgot to read the last title. \"This is awesome.\" This title is \"Wow. Oh my God this is amazing, I listened to one episode and I was immediately intrigued, this is awesome guys keep it up, I will be back every Saturday to listen to this\" Oh no I hit the wrong one, there's a clapping! - No these are, yay. (clapping) - You know what Justine, you know what's fun? - What? - Rumors about new tech. Some rumors, Xbox related. - Xbox, the code name is Lockhart, which is kind of interesting. So obviously you guys know about the Xbox series X that should be out this holiday. Should be, I mean it will be out. Who knows? - You never know. You really don't know. It's expected, it has been announced, holiday 2020 which is just around the corner. But it's-- - Is it just around the river bend? - No it's around the corner - Okay, Xbox series One is expected to be an absolute beast of a console. Capable of playing video games 4K 60 frames per second so I could have a one terabyte solid-state drive and a ton of different specs here which I feel like a lot of people have already covered this stuff. But me and Jenna are both huge Xbox fans. - Oh yeah, I've been playing so many video game in quarantine, it's kinda crazy. - Animal Crossing there is a summer update and holey moley I'm incredibly excited. But here's the thing, I'm on the Southern Hemisphere and this is like a summer update-- - You could start over? - I will not. I think I've hit 600 hours at this point. - Wow - We're not doing that. So in the new update you'll be able to swim and dive and find new, so this is coming actually in July. - July third. It's right after July second which I have a car appointment. - Oh my gosh. - It's my own plans of 2020. Yeah so you can, - Swimming, diving - You can swim. - And wetsuits. For the first time ever in Animal Crossing you'll be able to swim in the ocean surrounding your island using a wetsuit. The sea is yours to explore. - I hit the microphone again. - It's fine, oh my goodness (failure sound effect) So this article came up when I was looking for Pokemon Go 'casue I feel like they were supposed to relaunch Pokemon Go but do you remember how much fun we had? - Yes, we were walking like 20 miles a day. - This article, it's Pokemon Go grandpa plays with 64 phones on his bike. Look at this picture Jenna! - [Jenna] I'm looking at it first off, how do you have that many phone, how do you? - This is the most, I am jealous because this is how we need to do phone reviews. - [Jenna] It basically looks like a peacock of phones. - It does - Like a peacock's tail. That's insane, that's absolutely insane. - I can't believe this is the day that I first listened to BTS. - Well so I've listened to them before. - But I have not, why did nobody tell me that they're incredible? - I mean millions and millions and hundreds of millions of people have been telling people that they're incredible. - This is I think my problem, is like I get super into stuff. So I try to avoid things that I know I'm gonna be super into like World of Warcraft, 'casue I know that would probably ruin my life. But for some reason I just never, everyone's like BTS, BTS, so good! And the reason that I decided to finally go and listen to BTS is because Samsung did a collaboration with BTS for one of their new phones, the S20 plus. - It looks very, very good. - This is the phone that I wanted. - It's like a purplish, pinkish color. - [Justine] It's so great, it has little hearts on it. - [Jenna] They also did the buds as well I believe. - Yes the Galaxy buds - Oh my gosh. - But can we talk about how good BTS is? - Yeah, that's why millions of people like them. - I think it's even more than millions. - Hundreds of millions. - I am so upset that it's taken me this long. This is also something that Tyler was talking about, that he mentioned would be interesting for us to chat about, - Thanks Tyler. - About Apple bringing touch screen back to the next iPhone because of face masks. Please, can we do that please? - [Jenna] I miss it, personally. - [Justine] I actually do, when I started using the SE I was like wow this is nice. The fingerprint is faster because I feel like that slight swipe up is actually, it takes more time than if you just pick up your phone and you would just pick it up and touch where you need to be and it just turns on. - I kind of wish, what is the one that has the one on the back? - The Pixel's my favorite - The Pixel yeah. - It's a perfect location for you pointer finger. - What if you could do, I don't really know. - What don't you know? - It's just something else, I feel like there has to be something else that someone hasn't thought of. - Like Iris scanners? - No 'casue that's still kind of like face ID type of thing. These glasses are really hurting my ears. - I think the headphones are also hurting my ears. - Everything is hurting my head. - I'm gonna take my headphones off. - Okay yeah let's take a break - Me too I'm in a lot of pain. - I mean I actually have to actively take off my contacts, take them out so I can put these glasses on. (bouncy music)",
    "transcript_keywords": [
        "podcast",
        "guys",
        "push",
        "BTS",
        "Xbox",
        "fun",
        "podcast episode",
        "Tyler",
        "good",
        "millions",
        "Wow",
        "Yeah",
        "Jenna",
        "work",
        "time",
        "gosh",
        "casue",
        "kind",
        "feel",
        "podcasts"
    ],
    "transcript_entities": [
        [
            "millions",
            "CARDINAL"
        ],
        [
            "Pokemon Go '",
            "ORG"
        ],
        [
            "second",
            "ORDINAL"
        ],
        [
            "600 hours",
            "TIME"
        ],
        [
            "this holiday",
            "DATE"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "millions and millions and",
            "CARDINAL"
        ],
        [
            "Pokemon Go",
            "PERSON"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "Animal Crossing",
            "FAC"
        ],
        [
            "more than millions",
            "CARDINAL"
        ],
        [
            "three hours",
            "TIME"
        ],
        [
            "4",
            "CARDINAL"
        ],
        [
            "July",
            "DATE"
        ],
        [
            "BTS",
            "ORG"
        ],
        [
            "2020",
            "DATE"
        ],
        [
            "186",
            "CARDINAL"
        ],
        [
            "S20",
            "PRODUCT"
        ],
        [
            "a ton",
            "QUANTITY"
        ],
        [
            "the day",
            "DATE"
        ],
        [
            "Xbox",
            "ORG"
        ],
        [
            "Lockhart",
            "PERSON"
        ],
        [
            "four",
            "CARDINAL"
        ],
        [
            "Samsung",
            "ORG"
        ],
        [
            "twitter",
            "ORG"
        ],
        [
            "Xbox",
            "FAC"
        ],
        [
            "Warcraft",
            "ORG"
        ],
        [
            "five",
            "CARDINAL"
        ],
        [
            "64",
            "CARDINAL"
        ],
        [
            "Hundreds of millions",
            "CARDINAL"
        ],
        [
            "moley",
            "PERSON"
        ],
        [
            "two this week",
            "DATE"
        ],
        [
            "this week",
            "DATE"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "Iris",
            "NORP"
        ],
        [
            "YouTube",
            "PERSON"
        ],
        [
            "three weeks",
            "DATE"
        ],
        [
            "the Southern Hemisphere",
            "LOC"
        ],
        [
            "Tyler",
            "PERSON"
        ],
        [
            "hundreds of millions",
            "CARDINAL"
        ],
        [
            "Saturday",
            "DATE"
        ],
        [
            "July third",
            "DATE"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "fourth",
            "ORDINAL"
        ],
        [
            "20 miles",
            "QUANTITY"
        ],
        [
            "Jenna",
            "PERSON"
        ],
        [
            "July second",
            "DATE"
        ],
        [
            "Pixel",
            "ORG"
        ],
        [
            "One",
            "CARDINAL"
        ]
    ]
}