{
    "video_id": "8kKJ51GTcgo",
    "title": "Sony A1 Unboxing!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-02-01T15:15:22Z",
    "video_url": "https://www.youtube.com/watch?v=8kKJ51GTcgo",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 207301,
    "likes": 8611,
    "comments_count": 546,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hello friends. Today, I've got a little gift from Sony, this incredible Pelican case. There's some little goodies inside. But they've also sent over a review unit of the new Sony A1. This is Sony's brand new flagship camera in an all-new category. This is their first camera into the introduction of 8K, Sony mirror-less. Hyped about this, but I'm also really excited about the Sony Xperia Pro phone they also announced alongside of the A1. This is a very, very expensive phone. We're talking $2,500, but this is something that is geared towards Professionals, towards creators. And this is not only a phone but it can be used as a field monitor, also for incredibly fast transfer speeds using 5G. So I can basically use this as a 4K monitor, and I can even, you know, do a really high quality 8K live stream, somewhere that supports 8K live streaming. This is purely gonna be just an unboxing of the phone and the new A1, and also the surprise mystery Pelican case that Sony sent. I will be doing a follow-up review covering some of the more in-depth features on this. And then I'm gonna be going on a road trip and taking this with me and I might not come back again so, I guess stay tuned for that. I wanna do this, but I know you guys probably wanna see the A1, so let's do this first. My sister actually already unboxed this and she reboxed it for me to unbox. So if things look a little scattered, it's because they are. (upbeat music) Here it is, ooh, this feels a little heavy, heavy boy. It definitely feels a little heavier than the A7S III. So obviously the first thing that you're gonna notice about this camera and which is an unfortunate reality that we are living in right now, is that it does not have a flip out screen which is one of my favorite features A7S III. But this camera is not really geared towards vloggers. This is definitely a high end camera, obviously I will love to vlog in 8K and we have survived many, many years of the flip up screen. So if I do want to use this to vlog, I'm already a seasoned Pro. So as about the new faster refresh rate for the viewfinder. There are so many new things about this camera that I'm already kind of overwhelmed. (upbeat music) I love that they have a new focus dial that will allow you to quickly change between the various focus modes. We also have different shooting modes here. And then of course, we have all of our pretty much standard controls over here on this dial. So it does have a very similar look to most of the Sony Alpha cameras. The card slot is here, we have two CFexpress Type A, which are by far the best thing that I have ever experienced. They are so incredibly fast. They did send this with the kit but this does not come with the actual camera. Here's one of these CFexpress Type A cards. And when you're getting such incredible fast rate speeds, this one is 800 megabytes a second, read and write 700 megabytes (clattering) a second. And you do need this to shoot some of the higher quality contents. So you are still able to shoot on some regular SD cards but honestly, if you're getting this camera I do definitely recommend at least getting one of these. They are very expensive, but definitely worth saving for. This is their CFexpress card reader as well and it doubles as an SD card reader which is great because if you are traveling with this you'll not only have an SD card reader and you also have a Cfexpress Type A, and you shut the go. It's also heavy. It's like this nice, like metallic feeling. (clanging) It's nice. I love when things are unexpectedly heavy. Let's check out this Sony Xperia Pro. I honestly would love to make a review video about this but anything that I would make would not be worthy because Faruk, one of my friends here on YouTube, his channel is iPhonedo, has made such an incredible video that I, I'm not even going to bother. Just go watch his. He does an extensive coverage of this. It's incredible. I'm just going to open it and test it out. Do I have a knife? She does. She does. (upbeat music) Honestly, I feel like I'm kind of jaded because I have tested out so many smartphones over the course of the years. Obviously, I love my iPhone. I love all the new Samsung devices. There are so many incredible phones out there but this phone is really setting itself apart when it comes to who they're targeting, because it is an expensive phone. But this can be a 4K field monitor. So you're able to monitor all of your footage. You're able to control your camera. But it's great because a lot of the field monitors right now like you, it's really hard to find one that's that high quality. And the fact that this does have 5G, you're able to get really fast data transfer. So with this built-in HDMI port here at the bottom, this phone has so many more use cases than just a normal everyday average cellphone. This is a whole new category. Oh, we have headphones with, mind you my friend's, a headphone jack. And why this is kind of important and very significant for this phone, I know most phones are removing headphone jacks, but you do want to be able to monitor audio if you're out shooting in the field. So being able to have that, definitely an added bonus. So now that these are both unboxed, I'm going to set them up, get everything ready to start the actual review video. Can't wait to try this out. And again, this is something that is not geared towards everyone. So when people are complaining on Twitter about how expensive the price is, that's because it's not geared towards you. I mean, yes, everybody would love to have an 8K camera but this is something that is geared towards higher end productions. Because this is shooting in 8K, for me this is going to really add a whole other element and up the quality of my 4K videos, because I don't really plan on posting 8K content in here just yet. I still will be exporting in 4K but since we are able to shoot in 8K, bringing that down to 4K quality is going to increase significantly. Now I want to open up this sweet little gift from Sony. Sony is such an incredible partner. They have supported me and my sister in so many of our endeavors so I always love being able to get a chance to review their products and their sweet, sweet surprises. What do we think is going to be in here? Oh. Look at this, a gift. There's something, they wrapped a gift for me. Oh my goodness. This is so sweet. This is for Maddie. This is for our dog. He has treats. I love this. It's grain-free, all natural. He's actually with my sister right now. So he's not going to get to enjoy this just yet. Oh, with a little tag with my name on it. Look how cute that is. That's awesome. Oh, the little jackets so I can stay warm. Look at me, that's going to be me. That's going to be me. Look at that. Look at this. This is so cute. A little Sony Alpha jacket. Let me take out the gift. I'm so into Pelican cases now. They've got this really cool insert called a Trekpak, which you can cut and customize and then rearrange each one of the little sections so that you fit in your gear properly and you can change it up easily. So it's cool because you can buy those inserts separately. So I'm going to have to get one for this. This is the 1535. And this is the Pelican Air. The weight between the Pelican Air and just like the regular Pelican cases, so significant. I accidentally bought a non Air, I had to return it. It was too heavy. It was like, you play. Okay, look at this jacket. It's got a nice little Sony Alpha logo. (zipper screeching) This is my size too. Ready for adventure. What's this? To Justine from Sony team. That's me. Something in here smells good. Smells very good. (screeching) Oh, it's from Lash. I love Lash. I know this is a tech channel but everybody can get behind the bath bomb. Oh yeah. I was like something smells good. Look at this bath bomb and some shower jelly. Yes, please. What a random little gift box. This is cool. Ocean Salt? I haven't been to Lash in so long. I used to just go in there and smell all of their Products. But since COVID, I can't do that anymore. Look at that. Oh, look at this. That smells so good. So that does it here for this quick little unboxing. So excited to get a chance to test this out. If there's anything that you guys would like to see me test please leave it in the comments below as we will be shooting that video the next couple of days. And then I'm off on a COVID safe adventure. Basically, just going to drive around in a vehicle and take cool pictures and videos. So if you guys haven't subscribed to my channel be sure to hit subscribe. And if you enjoyed this video hit like and don't forget to hit the bell so you'll be notified when I post new videos. I also have a podcast that I do with my sister. We're going to be podcasting as we do our road trip. So go check that out. It's youtube.com/samebrain. And if you search Same Brain wherever you listen to podcasts, it will be there. And if it's not let us know so that we can be there. See you in the next video. Bye. (upbeat music)",
    "transcript_keywords": [
        "Sony",
        "Sony Xperia Pro",
        "Sony Alpha",
        "camera",
        "love",
        "Sony Alpha cameras",
        "phone",
        "Sony Xperia",
        "Pelican",
        "CFexpress Type",
        "Xperia Pro phone",
        "Pelican Air",
        "video",
        "incredible",
        "gift",
        "Xperia Pro",
        "Sony Alpha jacket",
        "monitor",
        "Pelican case",
        "geared"
    ],
    "transcript_entities": [
        [
            "Trekpak",
            "PERSON"
        ],
        [
            "the A7S III",
            "EVENT"
        ],
        [
            "2,500",
            "MONEY"
        ],
        [
            "Pelican",
            "NORP"
        ],
        [
            "second",
            "ORDINAL"
        ],
        [
            "the Pelican Air",
            "PRODUCT"
        ],
        [
            "Sony Alpha",
            "FAC"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "the next couple of days",
            "DATE"
        ],
        [
            "Faruk",
            "PERSON"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "CFexpress Type A",
            "ORG"
        ],
        [
            "K",
            "ORG"
        ],
        [
            "Sony",
            "ORG"
        ],
        [
            "4",
            "CARDINAL"
        ],
        [
            "Today",
            "DATE"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "jack",
            "PERSON"
        ],
        [
            "the years",
            "DATE"
        ],
        [
            "YouTube",
            "ORG"
        ],
        [
            "5",
            "CARDINAL"
        ],
        [
            "Twitter",
            "ORG"
        ],
        [
            "Lash",
            "PERSON"
        ],
        [
            "A1",
            "PRODUCT"
        ],
        [
            "Samsung",
            "ORG"
        ],
        [
            "Maddie",
            "PERSON"
        ],
        [
            "8",
            "CARDINAL"
        ],
        [
            "CFexpress Type A",
            "PRODUCT"
        ],
        [
            "700 megabytes",
            "QUANTITY"
        ],
        [
            "1535",
            "CARDINAL"
        ],
        [
            "the Pelican Air",
            "ORG"
        ],
        [
            "SD",
            "ORG"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "Cfexpress Type A",
            "PRODUCT"
        ],
        [
            "800 megabytes",
            "QUANTITY"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "CFexpress",
            "PRODUCT"
        ],
        [
            "Xperia Pro",
            "PRODUCT"
        ],
        [
            "Ocean Salt",
            "PERSON"
        ]
    ]
}