{
    "video_id": "8sOHG8_wREU",
    "title": "New iPhone? #AppleEvent Rumors! What can we expect?!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-03-04T00:53:30Z",
    "video_url": "https://www.youtube.com/watch?v=8sOHG8_wREU",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Grind Fuel True Wireless Earbuds",
        "Skullcandy",
        "Apple Rumors",
        "Apple News"
    ],
    "views": 184291,
    "likes": 8259,
    "comments_count": 440,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, guess what? Oh my goodness, you probably already know, judging by the title of this video and the thumbnail, that Apple is holding an event on March 8th at 10:00 a.m, Pacific. So obviously, I was super excited to see that this was announced, and I just kind of wanted to take a little peek, see what some of the rumors are, like what can we expect. I mean, I kind of have an idea because I'm basically looking at the website right now that has some rumors. Thank you MacRumors, always my go-to. (upbeat music) So before we get into the rumors, a huge thank you to Skullcandy for sponsoring today's video. These are the new Skullcandy Grind Fuel True Wireless Earbuds. They are starting at $99.99. Let's open them up. (box crackling) (upbeat music) So these will give you up to 40 hours of battery life and they also have this really cool wireless charging case. But, if you decide to plug these in with USB-C, you can get a rapid charge. So 10 minutes of charge time will give you two hours of battery. These are also IP55, sweat and water resistant. They have premium audio quality and they have Skull-iQ smart features for hands-free voice commands. You can change the tracks, adjust the volume and even launch Spotify. These work with both Android and iOS, they have over-the air-updates with the Skullcandy app. You can tune your audio experience by taking a real time audio test to create a personal sound profile for optimized audio levels. Okay, this is pretty cool. You can even set up a Take A Photo, in the Skull-iQ feature. (Justine gasps) Open my camera up to my... Oh my God, I can use it as a remote. Okay, we're gonna set the left earbud. So when I press it three times, it's gonna take a photo. Okay, that's pretty awesome. One of the things that I really love, is these have a built-in Tile tracker. So if you happen to misplace an earbud, you can actually ring it inside of the Tile app to help you find it. (phone pinging) Do you hear that? They're making little sounds. I'm pinging them with the Tile app. Let's see what these sound like. Hey Skullcandy, play. (upbeat music) It also has the Stay Aware Mode. Okay, my music is very loud right now. I'm gonna turn this on so that I can actually hear my surroundings. There we go. It kind of amplifies the sounds around me so that I can hear things that are happening. I will put a link in the description if you guys wanna find out more information about the Skullcandy Grind Fuel True Wireless Earbuds. They're available online and select retailers. Now, let's jump into the rumors. Oh, hi and welcome back. Thank you Skullcandy for sponsoring this video. Much appreciated. If you guys don't know, basically brand integrations are how I kind of funded this channel. So without them, I would be begging you guys to buy merch and for donations. And here's the great news, I don't have to do that because incredible brands have been so supportive of my channel and I am so grateful. And thank you guys so much for watching them, but now we're gonna get into the rumors. So here on MacRumors, I love you guys, you're incredible, they're talking about what we can expect from the Apple's upcoming 2022 iPhone SE. So they're saying that this should be coming out within a matter of weeks, which is actually quite accurate because this was February 4th. They're saying that the price would be around the $399 price point. Not expecting any new big design changes. So here's what the current iPhone SE looks like. And the thing that I love so much about the SE is the fact that it still has the fingerprint scanner. I love being able to unlock my iPhone with my Apple Watch, which I actually thought I didn't charge this morning so it's currently on the charger right now, which I feel so naked without it. I love my Apple Watch. The freaking Touch ID is just the best thing in the world and I hope- I'm still fingers crossed that they decide to put Touch ID in the new iPhone 14. Like put it in the power button, that would just be the perfect spot for it. Although, iPhone SE Touch ID for people who just need that for whatever reason. And if this is something that you do want or need, hopefully they don't take it away from the iPhone SE. I don't think that they will. So the current models of the iPhone SE come in the black, the white and the PRODUCT(RED). They're assuming that there may be some more colors, but I'm hoping for some new spicy colors, let's spice it up. So saying that, \"All other phones at this point have transitioned \"to Face ID and there's rumors \"that the future versions of the low-cost iPhone \"will do the same,\" which I feel like could possibly be an option. But if you do have Touch ID, that's one of the big reasons that you would be also getting the iPhone SE. Well, wireless charging, but no MagSafe, 5G speeds. Gotta have it. An updated processor, updated battery life, cameras. \"The iPhone SE is expected to feature an updated camera \"so we could adopt the latest wide-angle camera \"from the iPhone 13.\" They don't know specifics at this time but camera improvements are planned. That's definitely a given with any device. It's like, \"All right, we're gonna improve the battery life, \"we're gonna improve the camera.\" I mean, hopefully the screen will be a little bit better. I mean, those are just things that if those basic needs aren't met in an upgrade for a phone, then I think something's wrong, then there's no reason to upgrade. It would make absolutely no sense at all. Apple could call the new iPhone SE the iPhone SE 5G. Yeah, let's throw, let's do that. Let's toss in our 5G buzzwords. We love it. 5G, when it's actually readily available, one like ultra wideband and these speeds that we have seen in test cases are actually everywhere, is going to be life changing. So next up in the rumors, we have the next gen iPad Air, saying they're probably not gonna be making any huge design changes. It's gonna get a faster chip, 5G connectivity, and it could also be updated with the new FaceTime camera that supports center stage. And I have been using my iPad so much recently. Over the past couple of months, I've been working on this little illustration project. And if you're wondering, \"Justine, why haven't you been posting YouTube videos?\" It's because I have been drawing on my iPad and it has been so fun. It has also been extremely therapeutic. It's just the most relaxing thing and I've been having the best time. Procreate and my iPad, we are now best friends. I loved the previous versions of the iPad Air, although I have been using my iPad Pro and that's been incredible just because the amount of layers and kind of processing power that I need for the thing that I'm working on, the iPad Pro has been so perfect. But the iPad Air is also an incredible device and it can definitely handle all of the things that you would need to do with it. And the fact that it does have the Touch ID and the power button is just shows us that it's possible, the technology is there. Just think about putting that in everything. It's just great. It just works so seamless. Oh, absolutely love it. It would be great if they did integrate center stage into the iPad Air because that feature is really cool. I've been doing so many more FaceTime calls over the past couple of years. So I definitely love the fact that I can kind of set my iPad down and just sort of walk around and kind of be just carrying on about my day is pretty cool. Another rumor we have is, they are planning on releasing a higher end version of the Mac mini with an overhauled design. Ooh, new design. Hmm, let's hear it. \"The new Mac mini will replace the current \"Intel Mac mini options \"and could come at Apple's March event.\" Well guess what, the event is here. Also, I absolutely love these Athletic Greens, not sponsored. But if they want a sponsor, just DM me actually. So the final device rooming for March 8th is an updated version of the 13 inch MacBook Pro, which is said to be equipped with an M2 chip. Oh my God, are we already at M2 now? Is this happening? \"The successor to the M1 chip, \"the MacBook Pro will look identical \"to the current 13 inch model, \"and it'll be a lower end version \"of the 14 and 16 inch MacBook Pro.\" Oh my God. Okay, so when the M1 first came out, the 13 inch MacBook Pro was so incredibly revolutionary that I basically ditched my 16 inch Intel MacBook, basically edited all of my projects off of that 13 inch MacBook for an entire year, and I even was choosing it over my Mac Pro because this M1 was so powerful. And now at this point, we're like what, two, three years in to kind of that transition period away from Intel apps, drivers, macOS Monterey. All of these things are slowly starting to get updated because, I'm not gonna lie, those first few months were pretty tough, especially with a lot of my plugins for final cuts. My audio interface stopped working and there is an update for that now, so that's great. But I actually kind of ended up getting a different set of speakers that I really liked since I have been using the MacBook. We're slowly on that trajectory. Everything that Apple has been talking about with their new silicon chips and kind of that transition, it's happening. I know that people who have been using the newest MacBook Pros, we can attest to, I guess, depending upon what you're doing, but for the scenarios that I'm in and what I'm working on, God, it's so perfect. You are perfect. So the M2 chip will apparently feature the same 8-core CPU as the M1, but speed and efficiency improvements are expected. Like I said, we gotta have these upgrades. If you're not gonna have these types of upgrades, there's literally no reason to upgrade. Okay, so Apple plans to stream this event live on its website. Yes, yes and yes. Apple's March 8th peak performance event features an animated AR logo. Oh my God, I love this. That's another thing that I'm really excited about that Apple has kind of slowly been, I guess, kind of pushing for all of us to check out, is augmented reality. And there's so much talk of the metaverse. And what does that even mean? At some point, it's just a buzzword that people are throwing around, like, \"Oh yeah, since seeing the metaverse... \"Hmm, yeah, okay. \"Metaverse, metaverse, metaverse.\" There's gonna be many metaverses. I think that's the misconception of everyone just thinks Facebook kind of coined that phrase metaverse and then changed their name to Meta. They're not gonna be the only ones that are doing a metaverse. I mean, even right now looking at sort of the landscape of these various different types of metaverses, there's so many out there, don't worry. You're not missing out yet. (Justine slurping) Ah yeah, let's talk about it. I think you guys know what I'll be doing on March 8th. I look forward to seeing your guys' thoughts. If you want to chat in the comments below, feel free to do so. I will definitely be... Actually, maybe I should hang out on Discord, cause my sister and I do have a Discord. I'll put link description if you want an invite to check it out. It is a very safe space and we all have a lot of fun there. It's called Same Brain. If you also wanna follow me on Twitter, I will definitely be live tweeting the event, and of course on Instagram and here on YouTube. Subscribe, hit the bell and I will see you very, very soon. Can't wait. (melancholic music)",
    "transcript_keywords": [
        "iPhone",
        "Apple",
        "kind",
        "Skullcandy Grind Fuel",
        "inch MacBook Pro",
        "MacBook Pro",
        "Pro",
        "love",
        "iPad",
        "Skullcandy",
        "iPad Air",
        "True Wireless Earbuds",
        "Apple March",
        "Fuel True Wireless",
        "Grind Fuel True",
        "MacBook",
        "Skullcandy Grind",
        "metaverse",
        "rumors",
        "iPad Pro"
    ],
    "transcript_entities": [
        [
            "iPhone SE",
            "ORG"
        ],
        [
            "the iPad Pro",
            "ORG"
        ],
        [
            "399",
            "MONEY"
        ],
        [
            "February 4th",
            "DATE"
        ],
        [
            "Intel",
            "ORG"
        ],
        [
            "10 minutes",
            "TIME"
        ],
        [
            "MacBook",
            "FAC"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "iPad",
            "ORG"
        ],
        [
            "USB-C",
            "ORG"
        ],
        [
            "Spotify",
            "ORG"
        ],
        [
            "2022 iPhone SE",
            "ORG"
        ],
        [
            "iPad Air",
            "PRODUCT"
        ],
        [
            "Skullcandy",
            "ORG"
        ],
        [
            "the past couple of months",
            "DATE"
        ],
        [
            "about my day",
            "DATE"
        ],
        [
            "M2",
            "PRODUCT"
        ],
        [
            "Intel MacBook",
            "WORK_OF_ART"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "14",
            "CARDINAL"
        ],
        [
            "SE",
            "PERSON"
        ],
        [
            "Monterey",
            "GPE"
        ],
        [
            "CPU",
            "ORG"
        ],
        [
            "this morning",
            "TIME"
        ],
        [
            "an entire year",
            "DATE"
        ],
        [
            "iPad Pro",
            "PRODUCT"
        ],
        [
            "March 8th",
            "DATE"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "99.99",
            "MONEY"
        ],
        [
            "MagSafe",
            "PRODUCT"
        ],
        [
            "Instagram",
            "ORG"
        ],
        [
            "three",
            "CARDINAL"
        ],
        [
            "March",
            "DATE"
        ],
        [
            "M1",
            "PRODUCT"
        ],
        [
            "the Stay Aware Mode",
            "LAW"
        ],
        [
            "the past couple of years",
            "DATE"
        ],
        [
            "MacBook Pros",
            "ORG"
        ],
        [
            "Skullcandy Grind Fuel True Wireless Earbuds",
            "PRODUCT"
        ],
        [
            "MacRumors",
            "ORG"
        ],
        [
            "FaceTime",
            "ORG"
        ],
        [
            "5",
            "CARDINAL"
        ],
        [
            "13 inch",
            "QUANTITY"
        ],
        [
            "Intel Mac",
            "ORG"
        ],
        [
            "Pacific",
            "LOC"
        ],
        [
            "the MacBook Pro",
            "WORK_OF_ART"
        ],
        [
            "8",
            "CARDINAL"
        ],
        [
            "Discord",
            "ORG"
        ],
        [
            "10:00 a.m",
            "TIME"
        ],
        [
            "two hours",
            "TIME"
        ],
        [
            "Tile",
            "ORG"
        ],
        [
            "16 inch",
            "QUANTITY"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "the Touch ID",
            "ORG"
        ],
        [
            "two,",
            "DATE"
        ],
        [
            "YouTube",
            "PERSON"
        ],
        [
            "The iPhone SE",
            "WORK_OF_ART"
        ],
        [
            "weeks",
            "DATE"
        ],
        [
            "the iPad Air",
            "ORG"
        ],
        [
            "Android",
            "ORG"
        ],
        [
            "those first few months",
            "DATE"
        ],
        [
            "FaceTime",
            "PRODUCT"
        ],
        [
            "Facebook",
            "ORG"
        ],
        [
            "Same Brain",
            "WORK_OF_ART"
        ],
        [
            "Touch ID",
            "ORG"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "three years",
            "DATE"
        ],
        [
            "Twitter",
            "PERSON"
        ],
        [
            "Meta",
            "ORG"
        ],
        [
            "Apple Watch",
            "ORG"
        ],
        [
            "Mac",
            "ORG"
        ],
        [
            "MacBook Pro",
            "ORG"
        ],
        [
            "up to 40 hours",
            "TIME"
        ],
        [
            "One",
            "CARDINAL"
        ]
    ]
}