{
    "video_id": "_4D3vdc3iHk",
    "title": "Dr. Mario INTERVENTION!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-08-12T18:04:04Z",
    "video_url": "https://www.youtube.com/watch?v=_4D3vdc3iHk",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "dr mario",
        "nintendo",
        "gameplay",
        "how to"
    ],
    "views": 82874,
    "likes": 3855,
    "comments_count": 318,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine! And I have a problem and I'm here to talk about it. I was back home visiting with family not too long ago and that's about the time Dr. Mario came out. And since then, I had some free time, so I thought: 'OK, I'm going to allow myself to play this mobile game' thinking 'this isn't going to be dangerous. It'll be fine, I'll just kill some time this week and then I can go back to my life.' And I could not be more wrong, because I wake up I'm thinking about this game I go to sleep, I'm thinking about this game. Actually, I play it before bed and I play as soon as I wake up. I can't stop! It is so much fun! So, I just wanted to show you guys a little bit of gameplay and then... Jenna actually tried to have an um... a little intervention with me so you'll see that here in a minute. But I'm just gonna go through and play a stage and just show you what the game's about if you haven't played it yet and this is not sponsored because I've actually spent my actual real money on this game and probably spent way too much. I'm not proud of it. So I'm currently on level 128. Let's just go through, play this level, and I'll show you guys what this game is all about. I always like to put something underneath of it because I need just a little bit of leverage. (game noises) All of those little guys floating to the top. All right well... not much I can do about that one. I'm not enjoying this map very much. This is... This is not a fun one. Here I am talking this game up and then I'm playing this difficult level. Let's get you out of there. Let's get you. Get you. This game is so silly. I love it so much! Great. Whole squad is unlocked. They are ready. That was a mistake! Did not mean to do that! I'm not happy about it. This is a bit of a predicament here. This is not my best game guys I'm really... pretty upset about it. Yesss! That could not have been more perfect to be honest with you. This is working out great...except... Okay, I'm gonna have to use the hammer just for this last one. Because that's what I had to do. Okay. We just cleared a level! There's also versus and the ranked play and I am stuck at tier four right now. Like, I have to get to tier five but it's 1600+ points and I keep dying so much. But once you get around like 1300 everyone gets really, really good. So, I'm gonna play a match here and hope I can get to 1600 within a week. Cause everyone's so good. Okay. Are you ready? Focus! Focus up! This is where you have to go super quick. No mistakes...could be made. Oh my gosh, that was a mistake, that was mistake, that was a mistake! I didn't mean to do it! Oh my gosh! Oh my gosh! This is terrible! This is terrible! This is terrible! This is terrible! This is awful! Absolutely terrible! Oh my gosh! It's okay, it's okay, it's okay, I can recover. I can recover, I can recover, I can do anything. I can do anything, I'm a champion. (muttering) Oh my god, okay. They are doing so well. They are doing very well. I won! I won! I won! I won! Okay, oh my gosh! Yes! Yes! Yes! Yes! Yes! So, that's what I've been doing with my time. - We don't need any more reasons for you to play the game. The past week, all she's been doing is playing \"Dr. Mario World\" and I'm genuinely concerned about her health. Like, was is it, did you buy it? How much money have you spent on this game? Have you been working? Like, I'm worried! I'm genuinely worried about it. Has mommy been taking care of you? - (Justine) Don't touch me! Don't touch-- - (Jenna) Like, you have a pro-- - (Justine) You just took a screenshot! Stop it! I'm playing a versus game! - (Jenna) You have a problem! - (Justine) Give me that! Give me that! I will put you to sleep! Don't make me do it! Don't make me do it! You wanna go to sleep? You wanna go to sleep? - (Justine) Give me the phone! (play fighting) - Don't touch me! - Oh, we're done here now? Okay. - (Off camera Justine) Like, I honestly think that I have a future here. You do realize that there are Fortnite tournaments for like 3 million dollars. I-- - You're not playing Fortnite! You're playing Dr. Mario-something. - \"Dr. Mario World\", get it right. - (Justine) Can I show you how good I am? - (Jenna) Fine. - (Justine) Can I show you how good I am? - (Jenna) Well, I don't even know what the game is, I-- - (Justine) Here's the thing: I have to be sitting-- I have to have it at a special angle. - Oh! A special angle. Come on, Matty, let's go play. - (off-screen Jenna) I just don't understand-- - (Justine) Promise me you're not gonna touch it because this will hurt my rank. Promise me-- - (off-screen Jenna) Okay, I'm not gonna touch it! - So basically I'm racing...against... - (Jenna) Can you see what they're doing? (Jenna) Are you winning? - (Justine) I don't know yet I can't think. - (Jenna) Oh... - (Justine) They froze me. - (Jenna) I don't-- - (Justine) Shoot, shoot, shoot! I messed up! I messed up! Oh God! - (Jenna) Matty's excited. - (Justine) Shh, shh. I'm focusing, I'm focusing. - (Jenna) You can't talk and-- - (Justine) This takes a lot of focus. - (Jenna) Can you see what their ranking is? (Jenna) Oh, I'm not allowed to speak, right? (Jenna) This is fun for everyone. - (Justine) If I lose this, I'm going to be so embarrassed because everyone's watching me now. - (off-screen Jenna) Yeah, the whole internet. - (Jenna) Did you just match the colors? (muttering) - (Jenna) That's...that's fun. - (Jenna) Look, I'm on level 2000 in (inaudible). Like I get it. - (Justine) Oh shoot, I just messed up! Oh my god! One mistake... it can really ruin you. - (Jenna) Much like life, people. That's also good life advice. - (Justine) They are doing so well. (Justine) They are doing so well. (Justine) They're doing so well! - (Jenna) Well, why aren't you? - (Justine) I'm trying my hardest but they're doing very well. - (off-screen Jenna) Do you think they spent $40 on the game or... - (Justine) Did I win? Did I win? Hold on... (Justine) I won! I won! I won! I'm sweating so bad like you don't understand. - (Justine) Even Matty's been playing Dr. Mario because he been watching me play it so much. Here you go Matty, ready? (Justine) Dr. Mario time! - (Jenna) Not you too... (Jenna) Oh my gosh... - (Justine) Sit. - (Jenna) I've lost you both. - (Justine) Dr. Mario time. (Justine) Yes, that's my boy. (Justine) That's my boy, come on, get those viruses, Matty! - (Jenna) He's a higher level than you. (Jenna) I've lost them all to \"Dr. Mario World\". - (Justine) Just like mommy. - (Jenna) Guess I'll download it. (music gets louder)",
    "transcript_keywords": [
        "game",
        "play",
        "Mario",
        "Mario World",
        "won",
        "Justine",
        "gosh",
        "Matty",
        "level",
        "time",
        "Mario time",
        "playing",
        "show",
        "guys",
        "mistake",
        "terrible",
        "touch",
        "good",
        "Shoot",
        "World"
    ],
    "transcript_entities": [
        [
            "1600",
            "CARDINAL"
        ],
        [
            "Matty",
            "PERSON"
        ],
        [
            "Justine) Shoot",
            "PERSON"
        ],
        [
            "The past week",
            "DATE"
        ],
        [
            "a week",
            "DATE"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "Fortnite",
            "PERSON"
        ],
        [
            "2000",
            "DATE"
        ],
        [
            "3 million dollars",
            "MONEY"
        ],
        [
            "four",
            "CARDINAL"
        ],
        [
            "Mario World",
            "PERSON"
        ],
        [
            "five",
            "CARDINAL"
        ],
        [
            "Mario",
            "PERSON"
        ],
        [
            "this week",
            "DATE"
        ],
        [
            "Justine) Shh",
            "PERSON"
        ],
        [
            "this last one",
            "DATE"
        ],
        [
            "128",
            "CARDINAL"
        ],
        [
            "40",
            "MONEY"
        ],
        [
            "Fortnite",
            "ORG"
        ],
        [
            "Jenna",
            "PERSON"
        ],
        [
            "One",
            "CARDINAL"
        ]
    ]
}