{
    "video_id": "cqMTItm2xto",
    "title": "How to use the new Bing AI Chat Mode for Better Search Results!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-02-08T18:08:44Z",
    "video_url": "https://www.youtube.com/watch?v=cqMTItm2xto",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 141425,
    "likes": 4671,
    "comments_count": 321,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, so I am at Microsoft right now, and they just announced something so incredible that's basically gonna change the way that we search the internet. Now, search has been the same for, like, the past 20-plus years, for basically as long as I can remember, which is actually quite a long time. I know. I don't wanna talk about it. I have been obsessed with AI, not only AI technology, but AI photos, AI video. I'm sure everyone has heard about ChatGPT. Of course, people using it to write research papers and whatever else. I've actually been using ChatGPT to write little stories that go along with AI images that I created. So I made this little AI Instagram account. Unfortunately, AiJustine was taken, ironically. I don't know. I'm very sad about it. So it's iJustineAi. So I will go in, I'll use Midjourney to make the images, and then ChatGPT to actually write the text. But the thing that upsets me about ChatGPT, and I think there's a big misconception with Chat GPT, is everything that it says is true, it is the truth, and that's, I think, gonna be something that is a bigger conversation. So basically, what it's doing is it's giving you a conversational feel, but a lot of the data that is in there is from, like, 2021, so it's not updated. So what Bing and Microsoft has been doing is really, really game changing, because it's kind of taking that conversational model and putting it into search, like, right alongside of it. They also have it built directly into the Edge browser, so right up here, you'll see, when you click that, like, this just opens right up, like, you could chat, you can compose, and it also gives you some insights. But I wanna give you guys a little demo of how this works and how game changing this is for search, for finding information, and basically just saving us a ton of time. So I recently have been getting into snowboarding. Haven't snowboarded, know nothing, so I'm gonna use this to teach me everything I need to know about snowboarding and maybe even plan a trip. What do I need to know about snowboarding? You'll see here, over on this right-hand section, this is where it's populating all of the search results into kind of like bite-size, researched information. So it's giving you a more conversational look at, like, what this content is. And I love these little annotations right here, because this will let you go and actually find the resources where they're getting this information. So you can continue to, you know, do your own research, which is something that I feel like everyone should do. But with ChatGPT, you're not getting any resources. You're not getting any links. And a lot of times, I have had it write me scripts and then I went and fact checked. I'm like, \"Half the things that this is saying, like, where are you getting this information?\" So with this, it shows you exactly where you're able to get the information. And up here, you can like or dislike, and that will trigger to Microsoft and Bing, like, this was either factual or it wasn't. So definitely use that if it is helpful. So we're in here, we've got all the information, and on the left, like, that's what a traditional search looks like. But when we click this, we go into the chat. This pulls that entire little conversational chat that was on the right-hand side, and we can continue to break this search down into smaller, kind of bite size chunks of things. So this entire thing is all kind of paired together. So let's see. Where should I go to snowboard as a beginner? Also, I spelled beginner wrong. (laughs) So thankfully, it understands typos. Now this is pulling all of these search results from all over the web. The annotations are still there, so you can click in. This will pop open a link to where it's getting that information from, so you can continue to read the full articles. So now that I've learned everything that I need to know about snowboarding, I gotta go on a trip. Where's the best place to go for beginners? You can see I didn't say snowboarding, it's just gonna know because that's what we're talking about. So it's now populated all the places to go. Let's have this write me an email to my friends and tell them we are going here on a trip. \"Sure, I can write you an email to your friends to come on the trip. Here's a possible email you can...\" (gasps) This is it. It even gave me the subject, \"Snowboard weekend trip.\" So the trip apparently is gonna be February 17th to the 19th. We're gonna be going to Lake Tahoe. It has amazing snow, stunning views. This is too long. We're gonna make it shorter, 'cause, like, I can't even read this whole email. It's way too long. If I can't read it, my friends aren't gonna read it. Oh my god, it's even giving me cost. The trip is gonna cost 500 per person. They need to let me know by February 13th if they can go. Now let's hop over to the Bing integration with Edge. Check this out. I would like to compare the different types of jiu-jitsu practiced currently. We're gonna have it be casual. Generate. This is great. Yeah, well, look at this. It's just populating it right here. Why I like this is because you can choose the type of formats. You can have it be a paragraph, email, you can do a blog post, or an ideas. So let's make this into a blog post. So you can see this gives you a title. \"Jiu Jitsu 101: A Comparison of Different Styles.\" So this gives you a completely different rewrite of that text that you just saw. One of the things that I liked with ChatGPT when I was kind of writing my little stories is sometimes I didn't like the stories that it came up with, so I would do just a complete refresh. So you can regenerate an entire draft to get a different version of that. So one other example that I thought was so cool is they showed how to, like, plan a meal plan for the week. I'm gonna say, \"Plan me two days of meals of high protein.\" Day one, I'm gonna be having breakfast, spinach and egg pizza. Snacks, Greek... Okay, this is cool. Okay, let's go into the chat. Now, what's cool is I can have this write me things. Like, you can have it write you poems. So for example, for like one of my AI images, I would have it write me a story about a little pig that lives in a big world who is afraid of pants. Makes no sense at all, but it takes that prompt and is going to write me a story. It's called \"The Little Pig Who Was Afraid of Pants.\" \"There once was a little pig who lived in a big world. He had a loving family, a cozy home, and many friends, but he had one big problem. He was afraid of pants.\" This is definitely gonna be the story for today's Instagram AI. So one of the things that I really like is comparing products, because obviously, I do a ton of tech reviews. And then for you guys as a consumer, this is so helpful. So I'm gonna search to compare the best cameras of 2023 in a table. So as you can see, this is all populating here. We've got the camera, sensor, resolution, viewfinder, price. Like, this is gonna save people so much time. Like, I can't even believe that the future is here and we are future searching now. This was so much fun to get a chance to check out. Like, I love AI and the future of what this means for us. Like, if this can make us take everyday, mundane activities and make them way more easier, like, we can save so much time. This is gonna be available to everyone in a few upcoming weeks, but you can now sign up if you'd like to get on the wait list. If you guys haven't already, be sure to like, comment, and subscribe to my YouTube channel, and comment below. I would love to hear what you guys think of this, and what do you think of AI in general? Let me know the comments below, and I'll see you guys in the next video. Bye. (gentle electronic music)",
    "transcript_keywords": [
        "write",
        "search",
        "information",
        "trip",
        "ChatGPT",
        "guys",
        "things",
        "Chat",
        "snowboarding",
        "kind",
        "make",
        "email",
        "Microsoft",
        "time",
        "basically",
        "afraid of pants",
        "Bing",
        "Hey guys",
        "plan",
        "conversational"
    ],
    "transcript_entities": [
        [
            "Half",
            "CARDINAL"
        ],
        [
            "February 17th to the 19th",
            "DATE"
        ],
        [
            "500",
            "CARDINAL"
        ],
        [
            "One",
            "CARDINAL"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "The Little Pig",
            "WORK_OF_ART"
        ],
        [
            "2021",
            "DATE"
        ],
        [
            "Chat GPT",
            "FAC"
        ],
        [
            "AiJustine",
            "PERSON"
        ],
        [
            "Jiu Jitsu",
            "PERSON"
        ],
        [
            "a few upcoming weeks",
            "DATE"
        ],
        [
            "AI Instagram",
            "ORG"
        ],
        [
            "everyday",
            "DATE"
        ],
        [
            "a ton",
            "QUANTITY"
        ],
        [
            "the week",
            "DATE"
        ],
        [
            "Instagram AI",
            "ORG"
        ],
        [
            "Midjourney",
            "NORP"
        ],
        [
            "YouTube",
            "ORG"
        ],
        [
            "February 13th",
            "DATE"
        ],
        [
            "Greek",
            "NORP"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "2023",
            "CARDINAL"
        ],
        [
            "Microsoft",
            "ORG"
        ],
        [
            "AI",
            "ORG"
        ],
        [
            "Edge",
            "ORG"
        ],
        [
            "jiu-jitsu",
            "ORG"
        ],
        [
            "20-plus years",
            "DATE"
        ],
        [
            "Bing",
            "PERSON"
        ],
        [
            "two days",
            "DATE"
        ],
        [
            "Lake Tahoe",
            "LOC"
        ]
    ]
}