{
    "video_id": "EvCf1l7VC_A",
    "title": "ANNOUNCEMENT! Vlog University Event!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-11-06T20:38:34Z",
    "video_url": "https://www.youtube.com/watch?v=EvCf1l7VC_A",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "vlog university"
    ],
    "views": 69063,
    "likes": 3562,
    "comments_count": 283,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, I'm Justine! If you don't know me, Hi, how are you? I've been making videos on the internet for an extremely long time. I've been on YouTube since 2006, and I've been creating content ever since. My content obviously has evolved a lot since 2006. Are you in a studio? Nope, I'm just in a small little room that I kinda turned into my office. About 10 years ago, I started this little thing called Vlog University. Welcome to Vlog University. It's a school for vloggers. What's that? You don't like school? Vlog University is not a school at all. Each week there'll be various challenges or topics that I'm gonna give to you guys to inspire you to start creating more videos. Originally, I wanted it to be something where I would teach you guys something that I learned that week. You guys would then take that thing that I taught you, create a video and I would highlight them in next week's video. The best part about this was the community. You guys were creating fun videos, I was interacting with you, and I was getting to see some of the amazing, inspiring things that you guys were making each week. So now, 10 years later, we decided to reboot Vlog University, but reboot it in a really massive way. Not just here online, but an actual real-life conference. We've been working on this for over a year. So the event is happening January 31st and February 1st at a Los Angeles Convention Center. One of the best things about this event is I partnered with FMC and they're the company that puts on so many amazing, incredible conferences all around the world. Most notably at AB which is held in Las Vegas, so I could not have partnered with somebody better to help bring this entire vision to life. I'm sure the first thing in your mind is \"Justine, what type of event is this? Is this like a fan meetup? Like what are we gonna be doing here?\" I want people to come here who want to learn how to create. People who want to learn how to edit, who want to learn more about branding, who want to just learn. For me when I first started doing this stuff, there was nothing. There was zero resources, camera equipment was so expensive. I had no one to really look up to, so it was so difficult because I kind of was just doing things, maybe not doing them correctly, learning along the way, making so many mistakes, and it's amazing to see the resources now that are available. So I basically wanted to just jam pack all of this information into a two-day event. So for everything you see on the website right now, which is VlogUniversity.com, it still is tentative. We're still working on the schedule. So this will give you kind of an idea of the structure. And the instructors that we do have are incredible, like, the people that we have are not just people who just learn Final Cut last week. They've been doing this stuff their entire life. Much like I have been doing, what I have been doing almost my entire life. Like, we want to give you the best possible instruction. I'm still working on figuring out who we want to have as some other guest speakers. We'll have some fun panels. But really, this is something that we want to give to you guys so that you can leave this event feeling inspired. And that is the most difficult thing about this whole process. I have been doing this for an extremely long time, and one of the questions that people ask, \"How have you managed to keep going, do this for so long, and still manage to sort of reinvent yourself?\" And I will tell you that it is such a process. There have been so many ups and downs in this industry of creating YouTube videos. I remember when we were calling this new media. And at this point, it is the now. And something else I'm excited about is the future. There's so much new technology with live-streaming and 360 and 180 and 3-D. But that's something that I'm also looking forward to exploring, as well. So if you are interested in attending or you want more information, I will put a link in the description. It's VlogUniversity.com. I can't believe that I'm actually going to put this domain to use. I bought this over 10 years ago! Like this is so amazing to bring this all around and to have the 10 year anniversary of Vlog University be in 2020. It's gonna be awesome. I have a discount code if you want to use that at checkout, ijustine10. You'll get 10% off, and if you register before December 31st, you'll get a free T-shirt. There's a bunch of packages on the website, so check that out, and again, if you have any questions at all, feel free to ask me, and if I don't get back to you quick enough, there's a little chat box on the website. So you can feel free to ask them any questions there. So this is gonna be so much fun, and honestly, if you are a content creator, if you're an aspiring content creator, if you have a job somewhere that requires you to create content, go to your boss and say, \"I need to go to this event.\" I really wanted this to span kind of every aspect of creating from marketing to branding to lighting, editing, contracts. My manager is actually going to be doing some sessions, too. So he's amazing, Petar. You guys have probably seen him in my videos in the past. So it's going to be really cool because it's basically my entire team is coming here and we're offering up all of this information. Things that we have learned over the course of a very long time, I mean I remember posting my first YouTube video. I didn't know what I was doing. I was just posting things because I wanted to just create. I wanted to make funny videos and I honestly was just teaching myself to edit, which is the crazy thing because I started my YouTube channel because I wanted to learn to edit in Final Cut. But I just wanted to thank you guys for making all of this possible, and that's what I really wanted to do was have an event where we could give back, where we could create content together. I'll be leading a bunch of sessions about marketing, about strategy, about branding, about creating mobile videos. So just know that we have amazing people teaching all of these things. And I look forward to seeing you guys. So again, the event is here in Los Angeles at the Convention Center on January 31st and February 1st. Check out VlogUniversity.com to learn more. I can't believe Vlog University is a thing. I mean 10 years ago, I would have had no idea that this would be something that it is now. And that's one of the lessons that I will leave you guys with. You never know what little thing that you're working on right now just end up being something that you never would have expected. I look forward to seeing you guys at Vlog University mostly because the next generation of content creators, like, it's gonna be you guys. You might be watching this, you've never created a video yet. One of these days, maybe that is something that you want to do. And I want to leave you guys with the best tools to get started. And I want you to be able to make this internet a better place, make meaningful content, something that everyone can enjoy, and just take a little piece of that negativity and just get it out of there. I'll see you guys later. I'm gonna go edit this video now. So, bye! (energetic music)",
    "transcript_keywords": [
        "Vlog University",
        "guys",
        "University",
        "Vlog",
        "thing",
        "wanted",
        "event",
        "videos",
        "content",
        "things",
        "reboot Vlog University",
        "learn",
        "called Vlog University",
        "video",
        "creating",
        "amazing",
        "people",
        "week",
        "give",
        "create"
    ],
    "transcript_entities": [
        [
            "zero",
            "CARDINAL"
        ],
        [
            "two-day",
            "DATE"
        ],
        [
            "the Convention Center",
            "FAC"
        ],
        [
            "About 10 years ago",
            "DATE"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "Vlog University",
            "ORG"
        ],
        [
            "ijustine10",
            "NORP"
        ],
        [
            "last week",
            "DATE"
        ],
        [
            "2020",
            "DATE"
        ],
        [
            "2006",
            "DATE"
        ],
        [
            "YouTube",
            "ORG"
        ],
        [
            "this over 10 years ago",
            "DATE"
        ],
        [
            "Los Angeles",
            "GPE"
        ],
        [
            "February 1st",
            "DATE"
        ],
        [
            "a Los Angeles Convention Center",
            "ORG"
        ],
        [
            "December 31st",
            "DATE"
        ],
        [
            "reboot Vlog University",
            "ORG"
        ],
        [
            "each week",
            "DATE"
        ],
        [
            "10%",
            "PERCENT"
        ],
        [
            "10 years ago",
            "DATE"
        ],
        [
            "next week's",
            "DATE"
        ],
        [
            "360",
            "CARDINAL"
        ],
        [
            "Petar",
            "PERSON"
        ],
        [
            "Final Cut",
            "WORK_OF_ART"
        ],
        [
            "Las Vegas",
            "GPE"
        ],
        [
            "January 31st and February 1st",
            "DATE"
        ],
        [
            "3-D.",
            "NORP"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "January 31st and",
            "DATE"
        ],
        [
            "the 10 year anniversary",
            "DATE"
        ],
        [
            "FMC",
            "ORG"
        ],
        [
            "10 years later",
            "DATE"
        ],
        [
            "180",
            "CARDINAL"
        ],
        [
            "VlogUniversity.com",
            "ORG"
        ],
        [
            "One",
            "CARDINAL"
        ]
    ]
}