{
    "video_id": "F8ttxZijunY",
    "title": "Specialized VADO SL 5.0 - Light Weight Electric Bike!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-05-13T00:42:49Z",
    "video_url": "https://www.youtube.com/watch?v=F8ttxZijunY",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 323744,
    "likes": 7894,
    "comments_count": 687,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, guys, it's Justine. And today I am testing out this brand new bike from Specialized. It's an electric bike. It's 40% lighter than most electric bikes on the market. It can go up to 28 mile an hour and up to 80 miles, when you're using eco mode. I am really excited to test this out. I am not new to the electric bike market, but what I am new to is actual bike riding. It's been such a long time since I actually road a real bike as opposed to an electric bike with a throttle. I am a huge fan of the Super 73 bikes, but this is something completely different. There's off, eco, sport, turbo, and then there's smart control, which you can connect your bike to an app and it'll let you adjust all kinds of settings when it's connected through bluetooth. You can get a portable range extender, which will extend your ride another 40 miles. If you do need to go further or just have a back up battery, that is an option. I cannot wait to try this out. I've already actually tried it out, so I can't wait to try it out for you guys in this video. This is the Vado SL 5.0 version. Jenna is testing out the Vado 4.0 and I have the VADO 5.0 equipped. Mine's a 12-speed, hers is a 10-speed, and this one also has future shock suspension. The equipped version has a few extra goodies, like this rack mount, the fender, and a kickstand. To do a full comparison of all of the models, check out Specialized's website for all the details. Also, pretty excited about this. I've been looking for a really good helmet to get because we do ride bikes quite often. So this is really cool. This helmet is actually equipped with ANGI. It's Specialized Bike's emergency response. So if you have a crash, you connect it to an app, it'll alert your emergency contacts. And hopefully, send help. They also have these available just to clip to existing helmets. So I guess Jen and I are gonna go out for a ride now. Where's your mask at? We got to get masked up. So with the past few days, I basically have spent in the house. Los Angeles slowly starting to open back up, but I do not plan on going around people for quite a while. Jenna has a little bell! Like this is so light. I can probably pick this up with one hand. Oh my gosh, I can! So this is about 33 pounds. If I were to see this, I actually would probably not even think that this was an electric bike and I think that's kind of part of the appeal. You will be able to get two times the output that you put into it, depending upon on which mode you put it into. And this will take you all the way up to the turbo settings and you can adjust in between here. And this will determine what mode you're on, so right now everything is off, (beeps) and take it from there. Let's take it out for a ride! I've gotta get my mask. (upbeat music) We made it down to the closed beach, you can't actually ride anywhere near the beach. But there's a bike path that's still open so we're gonna take that. It's crazy because my legs hurt so I feel like I really got a workout just coming down to Santa Monica here. I'm gonna switch out my camera, do a nice 360, and head back down and keep riding. Oh my God, being outside is so incredible but it's also so weird. (upbeat music) Is it closed? I don't know? (dynamic music) Woooh, this is crazy! There's no way I would have been able to do that before. This is gonna be the real test. - [Jenna] Oh, I see. - Oh yeah, I'm going! Wow. I bet everybody thinks I'm so fit. I am, but not really (laughs)! (soft music) That was awesome! (electric music) Just got back from the ride, and my highlight was testing out that Santa Monica incline because on a normal bike, that would have been pretty impossible, I feel like for me, and my current state of not having biked in a really long time, but this actually made it super simple, everything was incredibly seamless and the fact that it is still a bike first, and you do have to actually shift gears, as it did feel like I could ride for much longer. I think that was honestly one of my biggest holdouts from getting a normal, traditional bike is I didn't know if I would actually be able to get back if I went and biked somewhere. So having that added confidence of knowing that, I do have that pedal assist if I needed, I can turn it on. If I don't want it, I can turn it off. Taking this out for a test drive today was really fun, I look forward to having more trails and things opening up so I'll be able to actually ride it out more, but being able to just ride it around the neighborhood and all through Santa Monica has been really great. Man though, when you put this thing in turbo and you wanna go, you go! (calm music)",
    "transcript_keywords": [
        "bike",
        "electric bike",
        "ride",
        "Santa Monica",
        "Justine",
        "electric",
        "electric bike market",
        "bikes",
        "Specialized Bike emergency",
        "Specialized Bike",
        "back",
        "Specialized",
        "Vado",
        "Santa",
        "Monica",
        "ride bikes",
        "bike market",
        "testing",
        "equipped",
        "mode"
    ],
    "transcript_entities": [
        [
            "12",
            "CARDINAL"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "Mine",
            "ORG"
        ],
        [
            "Los Angeles",
            "GPE"
        ],
        [
            "5.0",
            "CARDINAL"
        ],
        [
            "Jen",
            "PERSON"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "40%",
            "PERCENT"
        ],
        [
            "10",
            "CARDINAL"
        ],
        [
            "about 33 pounds",
            "QUANTITY"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "Specialized",
            "ORG"
        ],
        [
            "Santa Monica",
            "GPE"
        ],
        [
            "up to 28 mile an hour",
            "QUANTITY"
        ],
        [
            "the past few days",
            "DATE"
        ],
        [
            "Jenna",
            "PERSON"
        ],
        [
            "another 40 miles",
            "QUANTITY"
        ],
        [
            "up to 80 miles",
            "QUANTITY"
        ]
    ]
}