{
    "video_id": "h_ZbB_fbR7c",
    "title": "Apple M1 Chip - NEW MacBook Air, 13in MacBook and Mac Mini 2020",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-11-11T01:46:21Z",
    "video_url": "https://www.youtube.com/watch?v=h_ZbB_fbR7c",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 297607,
    "likes": 12899,
    "comments_count": 991,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- I did not expect to cry at today's Apple announcement of one more thing. Made it through the entire event, and then spoiler, at the end. If you haven't watched it yet and you don't wanna have a spoiler, fast forward a few seconds. - [PC] PC, still got it. - Oh my god! - [PC] Always been there. I always will be. Fast. - No. - [PC] Okay. (PC sighs) My battery's drained, I gotta go plug in. Good luck. Whoo! - Can you believe that they brought back PC? Does this mean that there may be a return of Justin Long as the Mac? I would pay him whatever he wanted, whatever you want, you have it, if I was working at Apple I would, you're hired. Anyway Apple has officially announced their game-changing Apple silicon, it's the M1 chip. So, what does this mean? So, with this new chip being built in-house that means that the Intel chips that were previously in Macs will now be transitioning to these new M1 chips, which is going to allow for even more seamless integration between software and hardware. And now, for the first time ever, we will be able to run iOS and iPad apps on the Mac. Now this is gonna be pretty amazing, because this is gonna allow us to have an even more wide range of games and apps to choose from. This is also gonna be really great for developers, because they will be able to bring their products into even more places. So, let's go over everything that was announced today, starting with that new thing, which is the one more thing, it's basically, it's the M1 chip. They did say that they are going to be developing a family of chips, so this leads me to believe that this is just the starting point. The M1 is optimizing for a smaller and more power efficient Mac. So normally on both Macs and PCs, they've used multiple chips for CPU, input, output, security, and more, but now, they're taking all of that and combining them all into the M1. So because all of these things are now inside of one chip, this will allow our laptops as we know them to become smaller, thinner, and faster, and with all of the new devices that they announced today, the battery life and performance enhancements are already quite apparent. So for those who are curious, more about the technical details of the M1. It features an 8-core CPU with four high performance, and four high efficiency. That's up to 3.5 times faster than before. An 8-core GPU, allowing for extremely demanding tasks, like multiple 4K video streams in Final Cut. I can hear all of my Final Cut editors cheering very loudly in the background. Do you hear them? (crowd cheering) That's them, that's all, they're all cheering. Any improvements to make my Final Cut workflow faster, sign me up. They've also added a 16-core neural engine for machine learning tasks, like video analysis, voice recognition, and image processing. So this will all have a really huge performance boost. So now, let's meet the first M1 Macs ever. First up, I would like to introduce you to the brand new MacBook Air, starting at $999, or $899 for education. Now this thing has no fans, it's completely silent. You can get up to 16 gigs of memory, up to a 2 terabyte solid-state drive that is two times faster than before, five X faster graphics, 3.5 times faster CPU, up to 18 hours of battery life, and a 13.3\" P3 wide color retina display. They also said that they were able to improve the FaceTime camera quality, and it has thunderbolts and USB4 compatibility. I sound that crazy because I actually remember the day that Steve Jobs announced the first MacBook Air, and there were audible gasps in the office that I watching it at, and everyone was just kind of so shocked to see him pull out this small, tiny, little laptop from that envelope. That is such a huge day in Apple history, because it really was the first time that they were kind of, I was gonna say pushing the envelope, but they were actually pulling a small laptop out of an envelope. It really did set the bar for these smaller, portable laptops, that was so revolutionary at the time. The amount of processing power, even though compared to what we have now is really not that significant, but at the time, it was. Kind of crazy to think about how huge these announcements are today, even though some people might not realize its importance, because the last time that something this revolutionary happened for the Mac was in 2005, when they switched from IBM's PowerPC chips to Intel. Now this is basically setting the entire future of Apple's hardware in motion. Next up, they showed the new Mac Mini, which was really no surprise, because they had already been using these Mac Minis to seed to developers with the new M1 chips since back during WWDC this year. So all these developers were able to start getting their apps ready for this transition. It did change the color of them though, they now look like they're more of a silver color, instead of the matte black from before. The starting price is $699 with 3X faster CPU, 8-core GPU for 6X faster graphics, ethernet, USB4 and thunderbolt, HDMI 2.0, and USB-A. These will also have Pro Display XDR support, so you'll be able to get up to 6K full resolution. And this is really great news, because those Pro Displays are expensive, but they're also incredible, and you could also buy probably eight and a half Mac Minis for the price of a Pro Display with a nano-texture glass. So it's up to you, do you wanna have a render form, or do you wanna have one Mac Mini with a Pro Display XDR with nano-texture glass, it's really up to you. The next announcement, as we'd seen a bunch of rumors kind of circulating about the possibility of a new MacBook Pro 13\". Guess what we have? We've got a new MacBook Pro 13\", with the new M1 chip installed. It looks pretty similar to all of the previous generation MacBook Pros, but with this new M1 chip, it's much, much more powerful, 2.8 times faster CPU, 5X faster GPU, and Apple is saying that this is the longest battery life on a Mac yet. So you'll be able to get 17 hours of web browsing, and 20 hours of video playback. So I'm trying to kinda combine those two together to do the Final Cut Pro math, like how much battery will I have while I'm editing a 4K video off of an external drive, while I also have on the backlit keyboard, with wifi. I'm not sure, I'm gonna say four, five hours maybe? Four or five? We'll find out, we're gonna find out, we're gonna freaking test it out. That's what we're gonna do. That's my test. Done. So those are the three new Macs that have been introduced into the M1 Mac space, but what's most exciting about this is the future. That can only mean that the rest of their Pro lineup is going to be even more ridiculous. I am so excited about the future of what these new chips mean for Apple hardware. And honestly, I just, I really can't wait to test these out. So if there's anything specific that you guys would like to see me test out with either one of these devices, I would love to hear about it, so leave me a comment below, and hopefully I will be able to test it out for you. If you guys enjoyed this video, give it a thumbs up, be sure to subscribe if you aren't already, and be sure to hit the bell to be notified when I post new videos. How many times have I had to say that on YouTube? I don't know, it's a lot. See ya in the next one. (upbeat music)",
    "transcript_keywords": [
        "Mac",
        "Pro Display XDR",
        "Final Cut",
        "Pro",
        "Pro Display",
        "Apple",
        "times faster CPU",
        "Final Cut Pro",
        "faster",
        "Mac Mini",
        "Mac Minis",
        "times faster",
        "faster CPU",
        "chips",
        "Macs",
        "chip",
        "expect to cry",
        "CPU",
        "MacBook Pro",
        "time"
    ],
    "transcript_entities": [
        [
            "Mac Minis",
            "WORK_OF_ART"
        ],
        [
            "WWDC",
            "EVENT"
        ],
        [
            "Intel",
            "ORG"
        ],
        [
            "GPU",
            "ORG"
        ],
        [
            "up to 3.5",
            "CARDINAL"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "iPad",
            "ORG"
        ],
        [
            "2 terabyte",
            "QUANTITY"
        ],
        [
            "MacBook Air",
            "PRODUCT"
        ],
        [
            "Mac Mini",
            "PERSON"
        ],
        [
            "Pro Display XDR",
            "ORG"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "CPU",
            "ORG"
        ],
        [
            "13.3",
            "CARDINAL"
        ],
        [
            "MacBook Pro 13",
            "PRODUCT"
        ],
        [
            "Mac",
            "PERSON"
        ],
        [
            "4",
            "CARDINAL"
        ],
        [
            "USB-A.",
            "ORG"
        ],
        [
            "M1",
            "PRODUCT"
        ],
        [
            "16",
            "CARDINAL"
        ],
        [
            "MacBook Pros",
            "ORG"
        ],
        [
            "three",
            "CARDINAL"
        ],
        [
            "the day",
            "DATE"
        ],
        [
            "FaceTime",
            "ORG"
        ],
        [
            "YouTube",
            "ORG"
        ],
        [
            "P3",
            "PRODUCT"
        ],
        [
            "IBM",
            "ORG"
        ],
        [
            "699",
            "MONEY"
        ],
        [
            "four",
            "CARDINAL"
        ],
        [
            "Justin Long",
            "ORG"
        ],
        [
            "Final Cut",
            "FAC"
        ],
        [
            "a few seconds",
            "TIME"
        ],
        [
            "8",
            "CARDINAL"
        ],
        [
            "999",
            "MONEY"
        ],
        [
            "iOS",
            "ORG"
        ],
        [
            "M1 Mac",
            "PRODUCT"
        ],
        [
            "five",
            "CARDINAL"
        ],
        [
            "3X",
            "CARDINAL"
        ],
        [
            "Pro Displays",
            "ORG"
        ],
        [
            "6",
            "CARDINAL"
        ],
        [
            "five hours",
            "TIME"
        ],
        [
            "up to 18 hours",
            "TIME"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "3.5",
            "CARDINAL"
        ],
        [
            "Steve Jobs",
            "PERSON"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "this year",
            "DATE"
        ],
        [
            "Four",
            "CARDINAL"
        ],
        [
            "Final Cut Pro",
            "PRODUCT"
        ],
        [
            "M1 Macs",
            "PRODUCT"
        ],
        [
            "MacBook Air",
            "ORG"
        ],
        [
            "17 hours",
            "TIME"
        ],
        [
            "20 hours",
            "TIME"
        ],
        [
            "Mac Minis",
            "ORG"
        ],
        [
            "Final Cut",
            "PRODUCT"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "899",
            "MONEY"
        ],
        [
            "Mac Mini",
            "ORG"
        ],
        [
            "6X",
            "CARDINAL"
        ],
        [
            "Macs",
            "ORG"
        ],
        [
            "Mac",
            "ORG"
        ],
        [
            "First",
            "ORDINAL"
        ],
        [
            "2005",
            "DATE"
        ],
        [
            "eight and a half",
            "DATE"
        ],
        [
            "2.8",
            "CARDINAL"
        ]
    ]
}