{
    "video_id": "HUjjOVNCoyI",
    "title": "Apple's One More Thing Event - What to expect?",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-11-09T00:02:16Z",
    "video_url": "https://www.youtube.com/watch?v=HUjjOVNCoyI",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 351817,
    "likes": 16354,
    "comments_count": 1022,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and I'm on my podcast set up today because I just recorded one with my sister. If you guys aren't subscribed to our podcast channel, you should go check it out on youtube.com/samebrain, and also subscribe on Apple podcasts. But this video is to talk about the November 10th event. And I know it seems like they have had events pretty much every week at this point, but I mean, I'm not complaining at all. I think this is the one though that we've been waiting for. Now it's titled One More Thing, but I am kind of hoping that they do show us a few things. I am very hopeful that they will maybe launch those rumored AirPods studio and then maybe those Air Tags. I feel like we keep reading about them, but not actually seeing them. Like those rumors are suggesting that they're there, but where are they? Maybe we could use an Air Tag to find the Air Tags. Anyway, most of the rumors are suggesting that this One More Thing event is gonna be focusing on the new Silicon Macs, which would make sense because they did say that they were gonna to be launching them by the end of the year and according to my calculations on my Apple watch, the end of the year is nearing. It's likely the thing is gonna be a few things and then maybe one big or one little surprise at the end using Steve's old catch phrase. So I looked up the last time they used the One More Thing and it was for the iPhone 10. Tim said we have great respect for these words and we don't use them lightly. I actually remember that and remember getting very emotional, just thinking about all the times that Steve had said that and then announced something incredible. Now before that, I decided to look up all of the times that One More Thing was used to announce a product. So before the iPhone 10, it was actually in 2015 to launch Apple music, and then it was 2014 for the Apple watch, 2011 for iTunes Match, 2010 for MacBook Air, FaceTime, and second gen Apple TV. In 2009, it was iPod Nano and 2008 it was for the next gen MacBook, in 2007 Safari for Windows, in 2006 MacBook Pro and Apple TV. You guys, should I keep going? Because like, I definitely, I think I'm gonna keep going, but I just don't know if these are all accurate. I read it on the internet. You can't believe everything that you read on the internet, but they sound pretty accurate. Feel free to correct me in the comments below. In 2005, the iPod Shuffle and TV shows on iTunes. In 2004, the 30-inch cinema display and iPod mini colors. In 2003, a Power Mac G five and a 12 inch PowerBook G4. 2002, the iMac Q4 and iPod with Windows compatibility. In 2001, it was the PowerBook G4; in 2000, the new graphical interface called Aqua and the Power Mac G4 cube, which I absolutely love this thing. This thing is beautiful. Like look at it, it's a piece of work. It's a piece of art and last but not least in 1999 was Apple Airport and the 22-inch cinema display, iMac DV, and iMovie. I can't believe iMovie was launched in 1999. That's kind of wild. So already this year, Apple has announced the fourth gen iPad air, the eighth gen iPad, the Apple watch series six, the new iPhone 12, the home pod mini, and really the last piece of the puzzle is this ARM-based Mac that they've talking about since WWDC. So Apple had announced that they were gonna start building their own custom chips and building them in-house allows them to bring improved performance and more efficiency to all of their devices. I mean this really makes sense because pretty much all of their other chips and everything is pretty much made by them. So they're able to custom tailor it to all of the proprietary software and hardware. I mean, I remember the transition from IBM's power PC to Intel back in 2005, when Steve announced this huge change over at WWDC. Now this was really big news at the time. And it did take quite a while for all of the devices to switch over. I think in the keynote, they said that they were trying to get the turnover of all of their computers to Apple Silicon in the next two years, which would kind of make sense, but it's actually not that much time, really, if you think about it. So the rumors that I've read about this event are saying that the first two Apple Silicon MacBooks will be a new 13- inch MacBook Air, and a 13-inch MacBook Pro. And then there's also rumors saying that there's gonna be an iMac that's set to release in 2021, along with the return of a 12-inch MacBook. We've seen so many rumors about a 14-inch MacBook that I'm hoping that that'll be the One More Thing. I mean, is that what I want the One More Thing to be? I'm not sure if I do, but it has been talked about and widely rumored for quite a while, so maybe it is. I just feel like it's gonna be something else. I just don't think that's gonna be the One More Thing. I've also become so used to working on my 16-inch MacBook, that the 13s almost feel like I'm using an iPhone. I just love having the power and the extra screen real estate, and honestly the amount of stuff that I edit on that MacBook, I'm just thinking about it and I must say Justine, pat on the back, I'm impressed. So another rumor that I saw that was kind of cool is that they might actually be working on a smaller version of MacPro, like half of the size. But I honestly don't think that I could have been able to put out nearly as much content that I have this year if it wasn't for working on that MacPro. It is so fast, so efficient that I'm able to do so many different things without even making a dent in the processing power that this thing has. It is super impressive. I think I really probably should do a follow-up video on how I'm loving this thing, but I feel like it kind of goes without saying. Anyways, I'm super hyped for the event and I can not wait as always. It's also kind of crazy because Apple has zero chill on their launch date because November 10th is also the launch of the X-Box consoles. So it is going to be a very exciting day in tech. So I will see you guys back here probably tomorrow for another video. (upbeat music)",
    "transcript_keywords": [
        "Apple",
        "Thing",
        "Air Tags",
        "Apple Silicon",
        "Apple watch",
        "Air",
        "Apple Silicon MacBooks",
        "MacBook",
        "Apple podcasts",
        "MacBook Air",
        "things",
        "Power Mac",
        "kind",
        "Power",
        "Air Tag",
        "rumors",
        "feel",
        "MacBook Pro",
        "Mac",
        "Steve"
    ],
    "transcript_entities": [
        [
            "MacBook",
            "ORG"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "MacPro",
            "PRODUCT"
        ],
        [
            "30-inch",
            "QUANTITY"
        ],
        [
            "Windows",
            "PRODUCT"
        ],
        [
            "the next two years",
            "DATE"
        ],
        [
            "2006",
            "DATE"
        ],
        [
            "FaceTime",
            "ORG"
        ],
        [
            "2011",
            "DATE"
        ],
        [
            "five",
            "CARDINAL"
        ],
        [
            "2003",
            "DATE"
        ],
        [
            "six",
            "CARDINAL"
        ],
        [
            "iMac",
            "ORG"
        ],
        [
            "November 10th",
            "DATE"
        ],
        [
            "Apple Airport",
            "FAC"
        ],
        [
            "iMac DV",
            "ORG"
        ],
        [
            "iTunes",
            "ORG"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "tomorrow",
            "DATE"
        ],
        [
            "Mac",
            "ORG"
        ],
        [
            "G4",
            "PRODUCT"
        ],
        [
            "MacBook Pro",
            "ORG"
        ],
        [
            "Power Mac",
            "ORG"
        ],
        [
            "zero",
            "CARDINAL"
        ],
        [
            "14-inch",
            "QUANTITY"
        ],
        [
            "iPad",
            "ORG"
        ],
        [
            "Tim",
            "PERSON"
        ],
        [
            "2000",
            "DATE"
        ],
        [
            "2015",
            "DATE"
        ],
        [
            "the iPod Shuffle",
            "ORG"
        ],
        [
            "eighth",
            "ORDINAL"
        ],
        [
            "2009",
            "DATE"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "Silicon Macs",
            "ORG"
        ],
        [
            "MacBook Air",
            "ORG"
        ],
        [
            "MacBook",
            "DATE"
        ],
        [
            "fourth",
            "ORDINAL"
        ],
        [
            "iPod Nano",
            "ORG"
        ],
        [
            "2008",
            "DATE"
        ],
        [
            "Apple TV",
            "ORG"
        ],
        [
            "12-inch",
            "QUANTITY"
        ],
        [
            "Apple Silicon MacBooks",
            "ORG"
        ],
        [
            "second",
            "ORDINAL"
        ],
        [
            "MacBook",
            "FAC"
        ],
        [
            "WWDC",
            "DATE"
        ],
        [
            "Apple Silicon",
            "ORG"
        ],
        [
            "1999",
            "DATE"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "2007",
            "DATE"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "2004",
            "DATE"
        ],
        [
            "13-inch",
            "QUANTITY"
        ],
        [
            "pat",
            "PERSON"
        ],
        [
            "PowerBook",
            "ORG"
        ],
        [
            "Aqua",
            "ORG"
        ],
        [
            "iPhone 12",
            "PRODUCT"
        ],
        [
            "this year",
            "DATE"
        ],
        [
            "MacBook Pro",
            "EVENT"
        ],
        [
            "22-inch",
            "QUANTITY"
        ],
        [
            "iTunes Match",
            "ORG"
        ],
        [
            "16-inch",
            "QUANTITY"
        ],
        [
            "iPod",
            "ORG"
        ],
        [
            "2014",
            "DATE"
        ],
        [
            "AirPods",
            "PRODUCT"
        ],
        [
            "Intel",
            "ORG"
        ],
        [
            "the Air Tags",
            "LAW"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "2021",
            "DATE"
        ],
        [
            "2001",
            "DATE"
        ],
        [
            "the Power Mac G4",
            "ORG"
        ],
        [
            "like half",
            "CARDINAL"
        ],
        [
            "12 inch",
            "QUANTITY"
        ],
        [
            "IBM",
            "ORG"
        ],
        [
            "Safari for Windows",
            "WORK_OF_ART"
        ],
        [
            "Steve",
            "PERSON"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "the end of the year",
            "DATE"
        ],
        [
            "2010",
            "DATE"
        ],
        [
            "2005",
            "DATE"
        ],
        [
            "2002",
            "DATE"
        ],
        [
            "One",
            "CARDINAL"
        ]
    ]
}