{
    "video_id": "I7VipUwoZcs",
    "title": "iPhone 12 Update!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-11-21T00:19:41Z",
    "video_url": "https://www.youtube.com/watch?v=I7VipUwoZcs",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "“eco friendly phone case",
        "” “recycled phone case",
        "” “sustainable phone case",
        "” “iphone",
        "” “iphone case",
        "” “android",
        "” “samsung phone case",
        "” “phone case",
        "” “lifeproof” “lifeproof phone case” “lifeproof case” “lifeproof wake",
        "” “eco friendly",
        "” “eco friendly products",
        "” “environmentally friendly",
        "” “recycled materials",
        "” “sustainable products",
        "” “FEATURED [DEVICE] case”"
    ],
    "views": 554666,
    "likes": 17788,
    "comments_count": 1068,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and phone season is officially here and a huge thank you to LifeProof for sponsoring a portion of this video. And I'm really excited to show you guys these WKE cases that they've made because they are made from 85% ocean-based recycled plastic like old fishing nets, ropes and tackle. And if you guys are familiar with LifeProof, you know that their cases are always very drop resistant so you can drop these up to two meters and your phone will be safe. So not only are you saving your phone but you're also saving the planet. It's crazy to think that over 12 million metric tons of plastic it ends up in our oceans every single year. So it's really great to know that some of that is now being turned into iPhone cases. So when you buy any LifeProof case, they partnered with water conscious non-profits who are working to help heal the ocean. You get to pick the cause and they will donate a dollar. They have tons of different cases for all sorts of phones so feel free to head over to their website. I'll put a link in the description if you wanna check it out. And here I have some of their new ones. Really like purple too. Check that out. This little teal color black so nice. Thanks again to LifeProof for sponsoring a portion of this video and for all that you guys are doing to help push this environmental cause forward. It's really amazing and I'm so happy to be a small part of it. So for the rest of this video, I just kinda wanted to talk to you guys about how I've been liking these phones so far. Now I have had the iPhone 12 Pro and the 12 for about three weeks so maybe like over a month actually. And I did just recently get the Pro Max and the Mini. And there's so many similarities across all four of these devices this year that I really do feel like any phone that you guys end up getting, you're going to be so, so happy about. The one main question that a lot of people have been asking me is if they should upgrade if they have an 11 Pro or 11 Pro Max. And I honestly don't think that you should if you do have the extra money, then yes, go for it but the 11 Pro and 11 Pro Max are such incredible phones. We went out to Joshua Tree and we were shooting some photos and Tyler was shooting a lot on his 11 Pro Max and I was shooting obviously a lot on my 12 and he posted some photos and a lot of people were asking him if those were shot on the 12. So the cameras are very similar in the 11 and the 12s but where you're getting the differences is in the 12 Pro Max with the upgraded Telephoto to 2.5x and with the larger sensor in the wide angle lens. And because these phones are much faster than the previous gen that is allowing them to do things like the Dolby Vision HDR which honestly is not a hundred percent necessary. I've said this so many times before but when Apple does something and integrates something like HDR, it kind of gives us all that little gentle nudge that says, all right now's the time we need to figure out a good workflow how to use HDR because this is it's here, it's here and we need to figure it out. So I haven't worked much with exporting HDR content but I have worked with HDR footage turning it into SDR for things like YouTube. So I have come up with a few workflows that have been working for me and even what I'm doing technically is not correct. Like, I know what I'm doing, this is not how I should be delivering this footage. If I was in school, I would probably be in trouble because I would not be doing it the proper way but it's working and it's looking really good when I end up exporting that content to YouTube. So that's one of the reasons why I haven't actually made a video, talking about my HDR workflow because it technically isn't correct. So I don't wanna be putting this knowledge out there of the way that I'm doing something it's not really the way that you should be doing it but it's working. So I'm kind of having this internal battle with myself. Final Cut doesn't actually support the Dolby Vision HDR right now. So I think in the next iteration and with Big Sur, it will so right now you are able to edit and work with HDR content but you're not able to export the Dolby vision metadata to actually have it be Dolby Vision HDR. I know, it's just, it's a lot it's a lot that most normal people don't even need to worry about. Like you just want to shoot and take good content on your phone and that's what these do. That's what they're doing. You guys are doing a very good job of it I must say. I do wanna show you what I have done with my home screens in comparison the old way that I was setting up my phone. I've just got apps on apps, on apps. And I used to put them all in like these separate little folders which was fine because I don't ever actually go into these folders to click to do anything. I always swipe down and I search for whatever it is that I want. So now what I'm doing on my new devices is I'm not putting any thing on any page except my home screen. So you'll see I do have a little space here for another app. Okay so I might've lied to you because I haven't got a chance to update this but my plan is to only have apps on the first page. Anything that I would be using on a daily basis and the rest of these things like okay, Peloton I do use quite often. So I'm basically gonna take Peloton so not delete app, but remove from home screen. then now yeah, we're going to remove you. (phone chimes) Oh my God! Now I'm getting notifications on every single phone. What is happening? So now I'm just be able to swipe over and I have my entire app library. Everything is here. It's also neat. It's so organized. Oh my gosh! So when you have three phones that are getting notifications I'm gonna go, I'm getting silly. After tax season, I'm gonna take some time off and I'm going to go be alone with myself and I'm going to hide my phone from myself. So I've also decided to just put one single, simple little widget here. I like this widget because it shows me my news, it shows me what's coming up on my calendar and it also will show me a random photo but for whatever reason, my phone kept showing me this photo. I have hundreds and thousands of photos that you can choose from and this is the one that you decided that I should see. I just, I don't get it. Oh, this one's cute. This is a little one of Maddie and me. The photos though on the Pro Max are very impressive. I think my favorite thing is the Telephoto. The 2.5x Zoom is really, really cool. I didn't think that it was gonna make a big difference until I saw something like this. Let me show you. So I show these photos in my photo test. So here's our ultra wide and here's the wide, pretty much the same. But then here's the 2x versus the 2.5x. So you could definitely tell that there's so much more zoom in that. And I really just can't believe how great it is. Like, look at this ready, zoom, zoom, Maddie zoom. I think he had a good time in Joshua Tree, I'm not sure. (upbeat music) I'm also incredibly impressed with the low-light performance and what's cool is the low light on all of these cameras also impressive. They have night mode on the front on all three cameras on the 12 Pro and then also on the 12, the two rear facing cameras and even the front facing also has night mode. It just made me really happy to see that they didn't skimp on some of the lower end models. I do wish that they had the same cameras on the two Pro models but I feel like you do need to have another reason to upgrade to the Pro Max and something that you're gonna really notice if you do get this phone and you've compared it to the 11 is the size of the lenses. So I don't know if you can really tell but the 12 Pro Max, like the lenses are way thicker. I mean, we're talking very, very small increments but when you are putting them up next to each other like the 11 it's very flat and the 12 pro it's like, Whoa!There's a difference. So obviously you are getting that new censorship technology which will help with the stabilization of the video and even the photos. And now this has the LiDAR. It really does assist with focus and being able to get better low-light performance when you're trying to focus on different subjects because the LIDAR is basically not relying on the light so much. So it's using that LiDAR sensor to determine the depth. So I'm very pleased with the upgrades that they made this year and that's not even to mention 5G but when I tested out the 5G UW, in some other videos that you guys may have seen, the speeds that I was getting I'm getting like two and a half gigs down, like that is just unheard of and when that becomes the future and when that becomes the norm, the possibilities are endless, editing in the cloud. What this is gonna do for autonomous driving because every car will be able to have this incredibly fast connection we'll be constantly getting this information faster, quicker and more efficiently. It's really going to change everything. I don't think people really understand the importance of 5G and the future of it because right now it just sort of is a buzzword. It's like, Oh, this has 5G. (indistinct) No, it's gonna be cool and when it is everywhere and in our homes, I am going to be so excited because my internet is trash. Well, thank you guys for watching. I just wanted to address some of the questions that I've been getting and also talk a little bit about what I've been doing on my phones. And obviously you guys have been following me here on YouTube or Twitter or Instagram you know exactly what I've been doing probably better than anybody else. I will see you guys in my next video. And if you have any other questions, feel free to leave them in the comments below and I will either try to answer them here on YouTube or any future video. So until then, I'll see you guys later. Bye. (upbeat music)",
    "transcript_keywords": [
        "Pro Max",
        "Dolby Vision HDR",
        "Pro",
        "HDR",
        "Max",
        "guys",
        "Vision HDR",
        "phone",
        "Dolby Vision",
        "phones",
        "video",
        "Justine",
        "HDR content",
        "photos",
        "lot",
        "Dolby",
        "WKE cases",
        "Vision",
        "Hey guys",
        "show"
    ],
    "transcript_entities": [
        [
            "Joshua Tree",
            "PERSON"
        ],
        [
            "Dolby Vision",
            "ORG"
        ],
        [
            "12",
            "CARDINAL"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "2.5x",
            "CARDINAL"
        ],
        [
            "2x",
            "CARDINAL"
        ],
        [
            "Telephoto",
            "ORG"
        ],
        [
            "85%",
            "PERCENT"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "over 12 million metric tons",
            "QUANTITY"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "LifeProof",
            "ORG"
        ],
        [
            "Big Sur",
            "ORG"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "Instagram",
            "ORG"
        ],
        [
            "Peloton",
            "ORG"
        ],
        [
            "three",
            "CARDINAL"
        ],
        [
            "Pro Max",
            "PERSON"
        ],
        [
            "SDR",
            "ORG"
        ],
        [
            "YouTube",
            "ORG"
        ],
        [
            "hundreds and thousands",
            "CARDINAL"
        ],
        [
            "5",
            "CARDINAL"
        ],
        [
            "Twitter",
            "ORG"
        ],
        [
            "WKE",
            "ORG"
        ],
        [
            "four",
            "CARDINAL"
        ],
        [
            "Maddie",
            "PERSON"
        ],
        [
            "half",
            "CARDINAL"
        ],
        [
            "G UW",
            "ORG"
        ],
        [
            "daily",
            "DATE"
        ],
        [
            "12s",
            "CARDINAL"
        ],
        [
            "this year",
            "DATE"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "two meters",
            "QUANTITY"
        ],
        [
            "YouTube",
            "PERSON"
        ],
        [
            "two and a",
            "DATE"
        ],
        [
            "Mini",
            "ORG"
        ],
        [
            "Tyler",
            "PERSON"
        ],
        [
            "11",
            "CARDINAL"
        ],
        [
            "The 2.5x Zoom",
            "GPE"
        ],
        [
            "Final Cut",
            "PRODUCT"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "a hundred percent",
            "PERCENT"
        ],
        [
            "Dolby",
            "ORG"
        ],
        [
            "every single year",
            "DATE"
        ]
    ]
}