{
    "video_id": "Ijl2p72X8dE",
    "title": "DJI Pocket 2 Unboxing and video test!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-10-20T18:56:43Z",
    "video_url": "https://www.youtube.com/watch?v=Ijl2p72X8dE",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 681527,
    "likes": 16456,
    "comments_count": 851,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Today we are checking out the DJI Pocket 2. I loved the first version of this and I'm so excited to see that they have a brand new, updated one, the DJI Pocket 2. We have two different combinations here. We have the regular Pocket 2 with just the camera and we have the Creator Combo Kit. (knife clicks) Should I get my new knife? Then I have to go get the knife. - Go get it! - It's probably worth it. Check this out. (knife clicks) (presenter laughs) This one is actually for Jenna, my sister, and I'm gonna unbox this one, so when Jenna comes over, we're gonna surprise her with her gift. (knife slashing box open) You think I can open it now? (plastic crinkling) Oka, I'm going to hurt myself. (gentle music) (box thuds down) Oh, looky, a little clip. Oh, we're gonna have fun with this. Look at this. If this isn't the smallest, tiniest, cutest tripod I've ever seen! Okay, so here's the camera. So it does look pretty similar to the previous version, kind of has that same form factor. (tape screeches off) So the bottom comes off. Oh, look at that. So you can switch out the bottom pieces and now I can mount my little, tiny tripod. I still can't get over how cute that is. I love the little carrying case that they have for it. What does this all come with? There are so many things jam packed in this little box. Look at this. This give you an even wider field of view. Wow, this is a really great combo. They've included a lot of really awesome things. These are two adapters that you can use to connect to your smartphone, they have a USB-C and a lightening connector. This is cool because you can actually connect this right to your smartphone. So you basically just plug it right in here. This is kind of a little smart port here. This will allow you to use your phone as a monitor, and you can also adjust settings, but you don't need to use your phone. This also is a standalone camera, just like this. This is a really neat attachment, this is a little tiny joystick. This'll allow you to have way more precise movements with your camera. Did we talk about the tripod yet? I don't know if we did, 'cause it's really freaking cute. I love it. The bottom of the device is also modular. So we already installed this little tripod base, and this is what they're calling the Do-It-All Handle. So this gives you a USB-C port and a 3.5 millimeter jack as well. So this kind of, I guess, will let you do it all. Give a couple options, I don't know if it's all, but. This is a little wireless microphone transmitter. This little wind sock can go right on top of here. So you can use this to clip onto yourself. But I plan on using this to annoy my sister, not my sister, Jenna, but my sister, Brianne. I'm about to travel for the first time in seven months, I just got my negative COVID test. So I am going to visit my family. And I'm really excited because I'm gonna be using this to annoy my other sister, Brianne. And I'm gonna be doing some interviews with her and get real up close. Now I wanna show you just a really quick comparison to the previous version. A lot of the accessories for the previous one will work with this. So here is the previous version. Oh, this had like a little seatbelt for it. No more seatbelt. This also feels like it's a heavier duty plastic. And this one had a nice little felt inside to it. This one also has a nice, soft little inside. It's like a little blanket. So much like this one, it also has the little LCD on it, it has the smart connector. The bottom of the old one isn't modular, so all of these new accessories will not work with it. So that's definitely something that I liked that they took into consideration is the fact that we do need to have these accessories. We do want to have a tripod and I think they've addressed a lot of those concerns. What I do wanna see is if this will fit in that case with my tripod on it or that bottom on it. Yes, I like this. (gasps) So they made this case with this open bottom so that if you do have any of these extended accessories on, it'll still fit inside of the case. That's cool. So while they do look pretty similar, there are some new updated features about the new Pocket 2, and so far without even turning this on yet, I'm such a huge fan of these modular bottoms. This is gonna really change the game as far as creating content. The main new feature is the camera's hardware, it's been updated with a wider field of view and better image quality when shooting landscape and portraits. It has four microphones, the new DJI Matrix stereo feature supports stereo recording, soundtrack, wind noise reduction, and more. There's also some new intelligent features like an AI editor to make an easily edited video for you. There's a bunch of accessories like the Do-It-All Handle, wireless microphone, micro tripod, and mini control stick. It shoots 4K Ultra HD, 2K and full HD at 24, 25, 30, 48 and 60 frames a second. (gentle music) So about a year ago, I was doing a video with the Osmo Pocket, the previous version, and now I'm doing another one and I was filming my sister Bree, and she had a baby in the belly. And now guess what? Baby's out of the belly, and she's a year old. How are you on that side? Look at Bre's Belly. - Hi. She didn't want to show it. - Oh. Hi Ben, say hi. - Say hi. - Say hi, this is a pocket sized camera, just like you, pocket size. This is 2, this is the new version. Whoa, look at this shot. I'm holding it. (leaves crunching underfoot) Ooh, I'm dizzy now. (gentle music) Okay, I'm gonna run and see how steady it is. I'm running. I'm running. I'm running. I'm running. Oh my goodness, I'm testing out this little tiny microphone. It's wireless, so it connects right to this Pocket 2. Here we go, let's see. How's that? Oh my God, this is so cool. Let's go see if we can get an exclusive interview with Maddie. Exclusive interview. Speak. Speak. - [Jenna] What's that little thing? - Let's see if we can get an exclusive interview with Jenna. - What's this little thing. - This is in the creator kit. - Who's creator kit? - In the Osmo Pocket 2 they have another version, it's like a little creator kit. - Oh, I'm shook. - It's a wireless mic. It's cool, super cool. Wow, fall is so pretty. I can't believe it. This can also connect to a lav, so I can connect that inside the 3.5 millimeter jack right there, and it will wirelessly transmit to the Pocket. Man, altitude, no joke! (gentle music) So, this is just my first test with the Pocket 2. So far I'm super impressed, I love the extended handle. I also love this little microphone accessory. I think the fact that they've now put this integrated tripod mount on the bottom of this, is really exciting because it basically makes it so much easier to mount it places. And I can't wait to test this out a little bit more. (gentle music) (gentle music continues)",
    "transcript_keywords": [
        "DJI Pocket",
        "Pocket",
        "DJI",
        "tripod",
        "bottom",
        "version",
        "Osmo Pocket",
        "previous version",
        "DJI Matrix",
        "camera",
        "sister",
        "Jenna",
        "DJI Matrix stereo",
        "previous",
        "accessories",
        "cool",
        "creator kit",
        "Kit",
        "Creator",
        "connect"
    ],
    "transcript_entities": [
        [
            "the DJI Pocket 2",
            "PRODUCT"
        ],
        [
            "Bree",
            "PERSON"
        ],
        [
            "48",
            "DATE"
        ],
        [
            "second",
            "ORDINAL"
        ],
        [
            "Pocket 2",
            "LAW"
        ],
        [
            "Ben",
            "PERSON"
        ],
        [
            "2",
            "DATE"
        ],
        [
            "2",
            "CARDINAL"
        ],
        [
            "the Creator Combo Kit",
            "ORG"
        ],
        [
            "24",
            "CARDINAL"
        ],
        [
            "DJI Matrix",
            "ORG"
        ],
        [
            "about a year ago",
            "DATE"
        ],
        [
            "Bre",
            "PERSON"
        ],
        [
            "30",
            "DATE"
        ],
        [
            "25",
            "DATE"
        ],
        [
            "4",
            "CARDINAL"
        ],
        [
            "jack",
            "PERSON"
        ],
        [
            "K Ultra HD",
            "ORG"
        ],
        [
            "four",
            "CARDINAL"
        ],
        [
            "Brianne",
            "PERSON"
        ],
        [
            "Maddie",
            "PERSON"
        ],
        [
            "a year old",
            "DATE"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "60",
            "CARDINAL"
        ],
        [
            "Oka",
            "PERSON"
        ],
        [
            "AI",
            "ORG"
        ],
        [
            "3.5 millimeter",
            "QUANTITY"
        ],
        [
            "Pocket 2",
            "FAC"
        ],
        [
            "seven months",
            "DATE"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "USB",
            "ORG"
        ],
        [
            "Jenna",
            "PERSON"
        ]
    ]
}