{
    "video_id": "iw9bRmiWQ6M",
    "title": "😱 Custom Nintendo Switch Skins!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-04-25T13:26:20Z",
    "video_url": "https://www.youtube.com/watch?v=iw9bRmiWQ6M",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "nintendo switch",
        "custom skins",
        "decals"
    ],
    "views": 891213,
    "likes": 18106,
    "comments_count": 1895,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys it's Justine and I'm super excited, because I'm not really sure what is inside of here. This is an extremely unexpected surprise. I got an email from dbrand the other day, and they said 'hey we'd love to send you 'some of our new Nintendo Switch skins to check out.' And I said yeah, I love Switch accessories, I love my Nintendo Switch, I love everything about it. So yeah, of course I would love to check out the skin. Now when I opened up the package I was like wait a minute, this is an entire console. What's happening? So thank you guys so much. I am so excited to open this up. So this is gonna be a complete shock. I don't know what's in here at all. I did check out some of the things online. I will also put a link in the description if you guys want to check this out. They have so many different custom combinations. So I don't even know what's in here. Let's open it up together and see what's in here cause I have no idea. I mean there's a Nintendo Switch I'm assuming unless there's not a Nintendo Switch in here. (gasps) So one of my favorite colors is purple. And if you see right here, we have got the purple Joy-Cons, oh man. So what's great about dbrand is they are just skins. So essentially this is a sticker that you guys can put on yourself. I'm sure you've heard of them. So I know what some of you are saying, you probably had heard before there was a huge problem with the previous version of the dbrand Nintendo Switch skins. The adhesive was damaging the Nintendo Switches. So there was a bunch of articles, there was Reddit threads, there was everything. So I did ask about that, cause I was super curious, and definitely was worried that if I did show this to you guys and it did damage your Switch you'd be mad at me. But they worked with 3M to resolve that issue and made an entirely new formula. So this has been tested and they said that it will not damage your Switch and... Hold on a second. This is, oh man guys! This is a white Nintendo Switch. You may remember back in the day I had all white consoles and I was really excited about it until the Xbox One X came out. And then that one was matte black and then the Playstation 4 Pro came out. And then that one was black. No freaking way! This I did not expect. It matches, oh my gosh, look at this guys. The whole front is white, the inside of it is purple to match the Joy-Cons. This is a piece of work, this is art. I need to see what this looks like all together. Let's put these guys, oh my goodness. I'm gonna be causing a scene when I'm cruising through the airport, or well not really cruising I would just basically be sitting in a corner playing my video game. Well this one has a little white sticker and a pink sticker so I'm assuming that these are white and pink Joy-Cons, but I don't wanna assume anything because this is completely unexpected. So, my two favorite, actually my three favorite colors are here. White's not even a color. Purple and pink are my two favorite, oh my goodness, they're my favorite colors. Oh it actually almost matches my nails. Except the nail salon, they kinda messed them up this time, but whatever. Well let's take a look what's in this one. This is just something out of a dream. My gosh, these look so good. Well, thank you dbrand so much because this is such an unexpected surprise, and wow. I've been such a huge fan of you guys forever. So thank you this is amazing. (uptempo techno music) Let's see what the white looks like on here. This is a site. Oh my gosh, this is so beautiful. I can't believe it. Let's try the pink on. Might as well have all of my favorite colors. All on my switch at the same time. Can you believe it, because I can't. Definitely think this is probably one of my favorite looks. It looks so fresh. Can you just imagine me sitting on the plane? This is gonna be me probably in three days when I get on the plane. Wow, I just keep saying wow and I'm so excited. But I don't know what else to say. I don't have any other words to describe my feelings. And since I'm here. A lot you guys had a bunch of comments and said this is going to brick your Switch, but this isn't a dock so it won't brick your Switch. It is essentially just a charger. I saw a bunch of comments of you guys saying that my next video was gonna be the Switch charger bricked my Switch. But it didn't, it hasn't. I've been using it for quite a while actually. And it's not a dock, it is a battery charger. So, you should not have any bricking issues. Let me know if you guys have a favorite color combination. If you guys check out the website let me know what your favorite is. And if you could make a dream colored Switch what would it be? I would love to know in the comments below. So feel free to leave those. And bonus points if you Photoshop your favorite dream color Switch and Tweet them to me. If you guys are new here be sure to hit subscribe. And even if you are new and if you're not new make sure you guys hit the bell because that's basically the only way that you'll be able to get my videos and know when I post new ones. So either way, welcome to the family, and welcome back to you guys who have been here since the start. I'll see you later. Oh my gosh I love this thing so much. I'm freaking out. I'm freaking out.",
    "transcript_keywords": [
        "Nintendo Switch",
        "Switch",
        "Nintendo Switch skins",
        "guys",
        "Nintendo",
        "white Nintendo Switch",
        "dbrand Nintendo Switch",
        "favorite",
        "love",
        "Switch skins",
        "Justine",
        "white",
        "favorite colors",
        "love Switch",
        "love Switch accessories",
        "check",
        "color Switch",
        "colors",
        "Nintendo Switches",
        "excited"
    ],
    "transcript_entities": [
        [
            "Justine",
            "PERSON"
        ],
        [
            "White",
            "PERSON"
        ],
        [
            "a minute",
            "TIME"
        ],
        [
            "the Joy-Cons",
            "ORG"
        ],
        [
            "second",
            "ORDINAL"
        ],
        [
            "Playstation 4 Pro",
            "PRODUCT"
        ],
        [
            "3M",
            "ORG"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "three",
            "CARDINAL"
        ],
        [
            "Nintendo Switch",
            "ORG"
        ],
        [
            "Joy-Cons",
            "ORG"
        ],
        [
            "Reddit",
            "LOC"
        ],
        [
            "the day",
            "DATE"
        ],
        [
            "Switch",
            "ORG"
        ],
        [
            "the other day",
            "DATE"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "three days",
            "DATE"
        ],
        [
            "Xbox One",
            "PRODUCT"
        ]
    ]
}