{
    "video_id": "JQnsAIbt6rw",
    "title": "The FIRST 5G Laptop! Lenovo Flex 5G",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-09-30T01:42:37Z",
    "video_url": "https://www.youtube.com/watch?v=JQnsAIbt6rw",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 183201,
    "likes": 7509,
    "comments_count": 573,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Today we are unboxing the first 5G PC. (upbeat music) This is the Lenovo Flex 5G. A huge thank you to Qualcomm for sponsoring this video, and sending this over, for me to check out and show it you guys. One of the things that I'm most excited about with this, is obviously 5G, because it's incredibly fast. But the battery life on this thing is incredible. They said that I can get up to 24 hours of video playback, and multiple days of use on this thing, on one charge. (cardboard tearing) Oh, I just cut all the way through the cardboard. (chuckles) (soft pop music) (box whooshes) We've got another box. (box whooshes) Charger cable. Which we're hardly gonna need, because the battery life is so good. Which is great. 'Cause, do I ever wanna get off my couch? No. (cutter scrapes) (upbeat pop music) (paper crumpling) So this weighs 1.3 kilograms. And I'm gonna have to convert that into pounds, right here for myself. (upbeat pop music) Oh this is so thin. We have two USB-C ports over here. We also have an airplane mode, headphone jack, and the power button. This is also powered by USB-C as well, which is great. Honestly, all I've ever wanted, is just a laptop that is constantly connected. I used to go to a lot of coffee shops to work, and I would never feel secure connecting onto their wifi networks. But now with 5G, I could be running the world. Let's see what else is in the box, and then we're gonna set it up. Oh, give a sim card ejector, because you know why? This is always connected. I just wanted to make sure there was nothing that, just wasn't missing anything. 'Cause we know I've done that before. And then I'm digging through the trash, to look for something. (chuckles) And the guys in the garb are into like, \"Just seeing you just threw away, \"insert important thing here\". Step one, unbox. Step two, plug in. Step three, plug into wall. Step four, turn on. Here is where, our SIM card is already there! Verizon 5G. Okay, now I gotta put it back in. (upbeat pop music) Look out, here we go! The start up. Time to set it up. I'll be with you guys in just a moment. (types) The Lenovo Flex 5G is powered by a 2.84GHz Qualcomm Snapdragon 8cx 5G Compute Platform. It's thermally efficient, and really quiet, since it doesn't have any need for fans to cool it. It uses 60% less power. It has twice the performance of the previous generation. So that'll give you multi-day battery life. The 14-inch Full HD wide-angle touch screen display gives you enough space for work, conference calls, or just watching content. It seamlessly switches between 4G LTE, 5G, and trusted wifi networks, so you'll stay securely connected to the best available networks. The Flex 5G enables super fast download speeds of up to four gigabits per second, which is 10 times faster than a 4G data connection. This was designed to go head-to-head with competing processors, but at a fraction of the power consumption. All of this making for a very versatile two-in-one. (upbeat pop music) So I wanted to test out doing a video call. And I was gonna go visit Jenna, but she actually doesn't know that I'm gonna go visit her yet. She just got some birthday candy from my parents, and I don't have any candy at my house. I'm gonna do a quick little call, to kind of see what it would be like if I had to do a business call. I mean, I think this is business. (gadget rings) Candy is business. This is very serious business. (gadget rings) (soft instrumental music) - Hi! - Hi! How's it going? - Good. I was sweeping my porch. - Oh, that sounds like fun. - No. - I just remembered that you like candy, and I wanted some candy, and I don't have any candy at my house. - I have a lot of candy. - You also have really fast 5G Badeo, which is exciting. - I do. I actually do. - Well, I wanted to show you my new Lenovo Flex 5G. It's pretty cool. It's like one of the first 5G PCs. It's pretty awesome. - (gasps) Why aren't you here already. - Well, because I was filming a video with it and then I thought, candy. - Yeah, come on over. I wanna see it, before I set out. - Okay. - Bring in the dog. - I'll bring Maddie, and we can watch some content on it. I'll show you how cool it is. - Okay, bye. - Bye. (upbeat pop music) Do you wanna go see her? We're gonna go see her, okay? How about that? That'll be fun. Ooh big stretch. Is it a big stretch, if you don't say big stretch? The one thing I do really love about it, is how light it is. I mean, this is so extremely light. (zipper swooshes) Let's go. (upbeat pop music) Do you like that we can be in the car, and be on our laptop, and have service wherever we are, 5G, Maddie 5G. (chuckles) (upbeat pop music) - It's skinny. - Super thin. - There's an airplane button. - Well yeah, because it's 5G enabled. So it basically, always connected. I'm really excited. It's what I Skyped you on. - It looked really good. - Alright, we'll drop Maddie, and we can go have some snacks. Candy. I'm here for the candy. (upbeat pop music) So I'm back, after spending a few days with this two-in-one. And what I've liked the most, like I said before, is the fact that it is always connected. So wherever you have cell reception, you'll be able to be connected to the internet. Now, 5G is interesting, because 5G is not everywhere yet. So I went and took a look at the coverage map, and I found a location that was near my sister. So I went to visit her, because she has a tower next to her. Another thing that I like is, we went to a coffee shop, and the coffee shop had a sign that said, no laptops. Well here's the thing, I can technically say, well, it's not really a laptop, it's a two-in-one. Oh, I won't use my laptop here, I'll just use my tablet. I think what makes me so excited about this device in general, is obviously, this is one of the first 5G enabled PCs. All of our devices will eventually be connected, when 5G is so readily available that you just walk outside and it is everywhere. It's gonna be so shocking the amount of things that we're gonna be able to do with those speeds. We'll be able to edit in the cloud. We'll be gaming in the cloud. Everything will basically be taking place, not on your device, but somewhere else on the internet. Qualcomm really is pushing the limits of what you can do with these types of devices. And I'm extremely excited to see what they do in the future. So with that, my friends, I'm going to take my, not a laptop, back to the coffee shop. Thanks again to Qualcomm for sponsoring this video. I'll see you guys in the next one. (upbeat pop music)",
    "transcript_keywords": [
        "candy",
        "Lenovo Flex",
        "connected",
        "thing",
        "Flex",
        "Qualcomm",
        "wanted",
        "video",
        "laptop",
        "battery life",
        "Lenovo",
        "Step",
        "guys",
        "Maddie",
        "business",
        "coffee",
        "excited",
        "coffee shop",
        "battery",
        "life"
    ],
    "transcript_entities": [
        [
            "up to 24 hours",
            "TIME"
        ],
        [
            "14-inch",
            "QUANTITY"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "USB-C",
            "ORG"
        ],
        [
            "the next one",
            "DATE"
        ],
        [
            "G Compute Platform",
            "ORG"
        ],
        [
            "the Lenovo Flex",
            "ORG"
        ],
        [
            "LTE",
            "ORG"
        ],
        [
            "4",
            "CARDINAL"
        ],
        [
            "three",
            "CARDINAL"
        ],
        [
            "up to four gigabits",
            "QUANTITY"
        ],
        [
            "1.3 kilograms",
            "QUANTITY"
        ],
        [
            "jack",
            "PERSON"
        ],
        [
            "5",
            "CARDINAL"
        ],
        [
            "2.84GHz",
            "CARDINAL"
        ],
        [
            "between 4",
            "CARDINAL"
        ],
        [
            "four",
            "CARDINAL"
        ],
        [
            "60%",
            "PERCENT"
        ],
        [
            "Maddie",
            "PERSON"
        ],
        [
            "Verizon 5G.",
            "ORG"
        ],
        [
            "Lenovo Flex",
            "ORG"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "10",
            "CARDINAL"
        ],
        [
            "a few days",
            "DATE"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "Qualcomm",
            "ORG"
        ],
        [
            "Jenna",
            "PERSON"
        ],
        [
            "One",
            "CARDINAL"
        ]
    ]
}