{
    "video_id": "k1In9h4R2QU",
    "title": "WWDC Rumors!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-06-20T20:05:50Z",
    "video_url": "https://www.youtube.com/watch?v=k1In9h4R2QU",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 229303,
    "likes": 9041,
    "comments_count": 644,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, guys, it's Justine and today we have a new episode of our podcast that's coming out. It's with me and my sister. It's called Same Brain. I will put all of the links in the description where you guys can check that out. But, this video is gonna be kind of a recap of some of the highlights, walking about WWDC, new PS4, the new Xbox, Animal Crossing, food, video games, and pretty much everything in between. But first, I wanted to say a huge thank you to dbrand for sponsoring this video. I've had this skin on my 16 inch MacBook for a very long time and they also just came out with some for the new 13 inch MacBook, so I just put this one on, as well, and I am so happy with how they turned out. They just come in these little sheets, just like this. They even have track pad covers, as well, so if you really wanna completely deck out your computers. - [Tyler] They even have them for gaming consoles, correct? - They do. They do have them for, so, I even have some on my AirPods. I have some on my controller and they even made this one. (laughs) This was a parody of the Animal Crossing Nintendo Switch. There's one thing that I do love, is dbrand definitely knows how to troll. I'll put a link in the description if you guys wanna check out more really awesome skins from dbrand. Let me know what your favorite one is. I think you probably know what my favorite is. It's obvious. So, now we need to set up for the podcast. I thought that since we shot that first episode of the podcast that we would have a whole new setup. Well, we don't and this time, I'm gonna be recording Jenna's audio off of the 16 inch MacBook and I'm gonna be recording my audio off of the 13 and why I like this is because I can put this one aside and I can just be on my little computer and since we are doing a video component to this, this isn't completely covering me up like the 16 inch. I still can't get over how big the 16 inch MacBook is. It's wild. (upbeat music) I have to take my contacts out. - where's your mug? - I had to take my contacts out because I can't wear glasses with contacts. - Same Brain. - Same Brain. - One, two, three. - [Unison] The Same Brain podcast. - We should probably practice that a little. - At least we wore like the same shirt. That was an accident. - Not planned. Absolutely not planned. (upbeat music) - I've never owned a shirt like this. - Why are you wearing it today? I bet it's the same brand. - Target. - Today, we're gonna be talking about a bunch of things. There's been a lot happening in the tech world. PlayStation 4 had their announcement. WWDC is coming up. - PlayStation 5. - Did I say four? Did I say four? - It's okay, it's okay. - Oh, my God. Do you know many times I've said PlayStation 4? Every single time. - WWDC? - I'm very excited. It's a whole new WWDC. It's a virtual experience and what's interesting about it is normally tickets are like $1,500 for developers to attend but it's free. - I'm getting Discord notifications. - Oh, we have a Discord now. So much has happened since our last podcast, since the first one was many, many months ago. This is great. If you wanna join the Discord, it'll be somewhere. You just search for it and you'll find it. - There'll be a link somewhere. - My favorite rumor is the new iMac. It's supposed to be, what do they say, it's like the iPad Pro design. - [Jenna] Thinner bezels. - [Justine] Similar to the Pro display XTR. - Well, that makes sense, 'cause it's like they gave you a little tease with the iPad and now they're like, bam, iMac. - Oh, shook. - I scared you. I scared myself. The new Arm-Based Mac Plans, Justine. What do we think about that? - Jenna's really just teeing me up here. - What do we think about it? - So, this is interesting because their plan to shift, they're gonna be providing some insights and efforts to transition away from Intel chips made in the house, which makes sense. First of all, when you're using Intel chips or any other types of chips, you know, they're not building them themselves, so they'll be able to really dial in and make something that works exactly how it should integrate with a MacBook, so I'm really excited to see how that all works out. So, giving this information up front to developers allows them to start working on this for the future. - Well, saying the first Arm-Based Mac probably won't be coming until 2021, which is actually almost here. Isn't that crazy. Half of 2020 is gone. - It is. - Okay, so, let's see-- - iOS 14, this is also exciting because we get to find out more information about what is in the works for iOS 14. So, there's already an early test version that was leaked. Apps on the home screen may get a list view. Apple is working on a fitness app that will let users download guided workout videos on iPhone, iPad, Apple TV and Apple Watch. - It's crazy, too. I wonder if people, now that they've figured out how to work out at home or maybe they bought equipment, will they go back to a gym? - Yeah, or now, are companies gonna be starting to shift more into marketing towards at home, which I've seen a lot of different fitness things pop up over the past couple of months. Some that I've been following for a while. - Third-Party Wallpaper Packs? We're going back to WWDC. Apple may allow developers to create wallpaper options for the iPhone - That's cool. - That would be able to be installed through the Wallpaper section. (Jenna gasps) (Justine gasps) - Jenna skipped to the end because she wants me to hurry up and stop talking about iOS 14. - It's a little warm in here. - I'm not done yet. Messages may get at @mentions in group chats. I like that. - Yeah, our friend Ed, he's really tough sometimes to get ahold of. We're like, Ed, we're outside and then like 20 minutes later, we're like, Ed, we're outside. If we can @Ed-- - Because we're in so many group chats, I feel like I don't really talk to just one single person anymore. It's usually like-- - I talk to you in like 17 different chats. - Oh, a feature for retracting iMessages. (both gasp) Oh, okay, okay. - Oh, we're moving on. - Here, this I'm excited about. Watch OS 7. So, I'm just gonna scroll down here to go to the blood oxygen tracking. - (gasps) That's what I was excited about. - Me too. So, according to a code found in a leaked version of iOS 14, Apple is working on Watch OS 7 and Apple Watch Series 6 feature that will allow the Apple Watch to detect blood oxygen levels. - Okay, so we talked about that. - We did talk about -- - What about-- - I'm still not done talking about WWDC because I'm very interested to see how they're gonna do this whole virtual thing. I mean-- - They stream it live all the time, so how's it really gonna be that different? - But they have like, good point. That's a really good point. The point that Jenna has made is very good. - It's just like there's people in the audience and now, there's not people in the audience. - This is a great point that Jenna has made. - It's not like-- - But, that's not all because there's lots of courses and things like that, so not just the actual keynote. So, there's a few days of events and learning. It's gonna be streamed live - I understand. - and it's just not gonna have people there and you watch it on the internet. So, okay, not that weird. Anyway, moving along. You're right, you're right, you're right. (upbeat music)",
    "transcript_keywords": [
        "Apple Watch",
        "Apple",
        "WWDC",
        "Watch",
        "inch MacBook",
        "Animal Crossing",
        "Animal Crossing Nintendo",
        "Jenna",
        "Brain",
        "inch",
        "podcast",
        "MacBook",
        "Apple Watch Series",
        "Crossing Nintendo Switch",
        "video",
        "put",
        "time",
        "guys",
        "Discord",
        "iOS"
    ],
    "transcript_entities": [
        [
            "Half",
            "CARDINAL"
        ],
        [
            "MacBook",
            "ORG"
        ],
        [
            "AirPods",
            "PRODUCT"
        ],
        [
            "WWDC",
            "EVENT"
        ],
        [
            "Intel",
            "ORG"
        ],
        [
            "MacBook",
            "FAC"
        ],
        [
            "WWDC",
            "DATE"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "iPad",
            "ORG"
        ],
        [
            "Animal Crossing",
            "ORG"
        ],
        [
            "the past couple of months",
            "DATE"
        ],
        [
            "17",
            "CARDINAL"
        ],
        [
            "2021",
            "DATE"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "14",
            "CARDINAL"
        ],
        [
            "iOS 14",
            "LAW"
        ],
        [
            "many months ago",
            "DATE"
        ],
        [
            "iPad Pro",
            "PRODUCT"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "Today",
            "DATE"
        ],
        [
            "three",
            "CARDINAL"
        ],
        [
            "2020",
            "DATE"
        ],
        [
            "the Animal Crossing Nintendo Switch",
            "ORG"
        ],
        [
            "1,500",
            "MONEY"
        ],
        [
            "13",
            "CARDINAL"
        ],
        [
            "13 inch",
            "QUANTITY"
        ],
        [
            "Xbox",
            "ORG"
        ],
        [
            "PS4",
            "ORG"
        ],
        [
            "four",
            "CARDINAL"
        ],
        [
            "Discord",
            "ORG"
        ],
        [
            "Watch OS 7",
            "ORG"
        ],
        [
            "XTR",
            "PRODUCT"
        ],
        [
            "6",
            "CARDINAL"
        ],
        [
            "20 minutes later",
            "TIME"
        ],
        [
            "16 inch",
            "QUANTITY"
        ],
        [
            "Ed",
            "PERSON"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "iMac",
            "ORG"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "iMessages",
            "ORG"
        ],
        [
            "a few days",
            "DATE"
        ],
        [
            "Same Brain",
            "WORK_OF_ART"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "Arm-Based Mac Plans",
            "ORG"
        ],
        [
            "PlayStation 4",
            "PRODUCT"
        ],
        [
            "Apple Watch",
            "ORG"
        ],
        [
            "PlayStation 5",
            "PRODUCT"
        ],
        [
            "Arm-Based Mac",
            "ORG"
        ],
        [
            "First",
            "ORDINAL"
        ],
        [
            "Apple TV",
            "ORG"
        ],
        [
            "Jenna",
            "PERSON"
        ],
        [
            "the Apple Watch",
            "ORG"
        ]
    ]
}