{
    "video_id": "N49p8pjl9Ek",
    "title": "Microsoft Surface Duo 2 Unboxing!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-10-21T13:00:09Z",
    "video_url": "https://www.youtube.com/watch?v=N49p8pjl9Ek",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 99290,
    "likes": 4319,
    "comments_count": 376,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- What do we have here? (box shaking) I am actually really excited about this. I already know what's inside of here. It is the new Microsoft Surface Duo 2. I did get a little bit of hands-on time at the Microsoft Lounge, but now, oh my goodness, I get to have all of the hands-on time that I want because it is here in the studio. I'm so excited. I even brought out the big knife today. This is so sharp. I should not have something like this in my possession. (plastic crunching) Oh boy, oh boy! Here it is! Oh, can't wait to open this up. We also have a couple other little things here. (upbeat music) Oh, look at you! Oh, this has a nice, it's a heavy feel. Let's put this cover on. Look at that. Mm hmm We got a SIM card ejector. Nice. Oh, USB cable. Look at that. Love to see it. I am going to turn this on and get it all set up. And then we're going to go out and do some testing. I cannot wait to test out these new cameras. Obviously the first Service Duo was not a device that you would want to be making any type of content on. It definitely did not have this advanced of a camera system. And of course, I don't think that this is going to be one of the highest quality camera systems on any smartphones right now. But the fact that they do have this three camera system, plus the inside front facing, I guess this would be kind of front facing. It really depends how you have it. Cause like right now is this the front? Is this the back? Hard to say. But having this dual screen device, it's so much more different than like the Samsung devices where they're the foldables and the flippables. Flippables? This is more like having dual monitors as opposed to like a laptop that folds, if that, that make any sense? I'm not even sure what I'm saying. Let's take off this last sticker. Pop in the SIM card, set it up and start testing. (upbeat music) This is the magnetic charging case that allows you to charge your stylist. Just like so. It's also kind of crazy because this is a phone, but it doesn't feel like a phone. It feels like so much more, cause it is so much more than a phone. I mean, we have dual screens. This feels like a very small little tiny laptop. I really like the notification panel here on the hinge. It's kind of cool because you're be able to see the time. You'll be able to see if you have a bunch of notifications, like text messages. And that little light right there, that lets you know you have a phone call. The previous version was really difficult because you didn't actually know what was happening inside of here. So even just this tiny, small little notification has made such a huge difference in using this. Let's take some photos. I want to test out this camera. (upbeat music) Okay, the Portrait Mode actually did a pretty good job. That was the front facing portrait. That's nice. Duuurp. Duuuurp. Whoa, wide angle's super wide. Like this is kinda cool. Over here on this side are all the photos that I've taken. And I still have the camera app open on the other side. Oh, we have Panorama too? Mmm There you go. (upbeat music) Oh man, I'm loving this new Surface 2 duo, surface 2? Surface Duo 2? 2 is 2 so it's Duo 2. - [Man] It's the Surface Tew Tew. - Tew tew? It's the tew tew! While other foldables and flippables are still technically one display, this actually brings you two separate screens for running various apps side by side. You can drag and drop between screens in apps that support this. You can create customized combos with app group. And you can even take notes with the new Surface Slim Pen. So the app rooms are actually kind of cool. So you can put various things inside of little folders. So this is my app group. We have Edge and One Note. And when I click that, it'll open up both of those things at the same time. So you can set up different ones for like social media. So if I want to have TikTok and let's see Instagram open. I can just make this little app group right here. So I can open up both TikTok and Instagram at the same time. Like this is a freaking dream come true. Just what, just with my attention span needs. It also now has 5G which is very exciting. You can record 4K video up to 60 frames a second, and there's also Slow Mo at 120 or 240 at 1080P. Now it is extremely thin at 5.5 millimeters with a 5.8 inch touch screen that spans 8.3 when they're both open. They made the Surface Duo more durable. And it's available in two colors, the signature Glacier White like the previous version. And this new Obsidian Finish. It gets very, very smudgy, but I have been keeping on this magnetic Slim Pen charger cover. And it's actually quite nice. Because of the camera bump, it doesn't lay as flat as the old version used to. But it doesn't wiggle around a lot, kind of like the iPhone does. So when you put the iPhone down, it's kind of like off center a little bit. But this, it's just, like it doesn't move. It just doesn't lay flat. So this was just a first look at the new Surface Duo 2. I really love it. This is one of my favorite devices of last year. I'm really glad that they did decide to make a second version of this because it really is awesome. A lot of the flaws that were in the first version, they have thankfully fixed. If you guys are new here, be sure to subscribe so you'll be alerted when I post new videos. Leave me some comments below and I'll see you guys in the next video. (upbeat music)",
    "transcript_keywords": [
        "Surface Duo",
        "Microsoft Surface Duo",
        "Surface",
        "Duo",
        "Tew Tew",
        "Surface Tew Tew",
        "Tew",
        "kind",
        "camera",
        "Microsoft Surface",
        "open",
        "app",
        "Microsoft Lounge",
        "Surface Slim Pen",
        "time",
        "version",
        "Surface Tew",
        "kind of cool",
        "nice",
        "front"
    ],
    "transcript_entities": [
        [
            "Microsoft Surface Duo 2",
            "ORG"
        ],
        [
            "second",
            "ORDINAL"
        ],
        [
            "5.5 millimeters",
            "QUANTITY"
        ],
        [
            "SIM",
            "ORG"
        ],
        [
            "2",
            "CARDINAL"
        ],
        [
            "the Microsoft Lounge",
            "ORG"
        ],
        [
            "Slim Pen",
            "PRODUCT"
        ],
        [
            "Obsidian",
            "PRODUCT"
        ],
        [
            "Instagram",
            "ORG"
        ],
        [
            "4",
            "CARDINAL"
        ],
        [
            "8.3",
            "CARDINAL"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "three",
            "CARDINAL"
        ],
        [
            "240",
            "CARDINAL"
        ],
        [
            "Surface 2",
            "PRODUCT"
        ],
        [
            "Glacier White",
            "LOC"
        ],
        [
            "5",
            "CARDINAL"
        ],
        [
            "last year",
            "DATE"
        ],
        [
            "Flippables",
            "GPE"
        ],
        [
            "Samsung",
            "ORG"
        ],
        [
            "Mm",
            "PERSON"
        ],
        [
            "Slow Mo",
            "PERSON"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "60",
            "CARDINAL"
        ],
        [
            "Edge",
            "ORG"
        ],
        [
            "the Surface Duo",
            "ORG"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "5.8 inch",
            "QUANTITY"
        ],
        [
            "the tew tew!",
            "ORG"
        ],
        [
            "Surface Duo 2",
            "ORG"
        ],
        [
            "USB",
            "ORG"
        ],
        [
            "Panorama",
            "ORG"
        ],
        [
            "Duuuurp",
            "PERSON"
        ],
        [
            "120",
            "CARDINAL"
        ],
        [
            "TikTok",
            "ORG"
        ],
        [
            "One",
            "CARDINAL"
        ]
    ]
}