{
    "video_id": "OGmR0_yOYBA",
    "title": "Samsung Galaxy Z Fold 2 - Unboxing, Gaming and first impressions!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-09-02T19:59:47Z",
    "video_url": "https://www.youtube.com/watch?v=OGmR0_yOYBA",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 415456,
    "likes": 15482,
    "comments_count": 1286,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Guess what's here guys? The Samsung Galaxy Z Fold. I gotta be careful with this knife. I don't even think I'ma need a knife, to be honest with you. I'll put it away. (upbeat music) I'm really excited about this phone because I never got a chance to check out the first Samsung Fold. I've been watching all the press announcements and I've been following along the rumors for quite some time, but now it is sitting on my desk. Change the shape of the future. Introducing Galaxy's Z Fold 2, 5G. Reimagine the possibilities. I'm so excited about this. I'm very, very, very, very, very excited to get my little mitts on this thing. And it's the mystic bronze. Thank you to Samsung for sending me a review unit to check out. Can't wait to check this out. I'm checking it out. Look at me. I'm checking it out. So here's all the care instructions. Do not press on the screen or the front camera lens with a hard sharp object, (indistinct). When folding the device, make sure there's no objects inside of it. Not dust or waterproof. Do not remove the screen protector film. Your device contains magnets. This does have a protective screen on it. And they said, if you do want to remove the screen that you should have it professionally removed at a Samsung store or some other third party retailer. This is the moment. Look at it, look at it. They do have several different hinge colors. So if you do want to customize this, that is also something that you guys can do. I'm very glad that this has just the all mystic bronze hinge. It looks awesome. It's a very nice fold. That's nice. So here it is unfolded. And then here it is folded. It is pretty thick. I'm curious to see what this looks like in comparison to the Note 20. So it basically is two Note 20s, kind of stuck together. So what's cool is this does have a front screen and then the inside is also all of the screen. But look at this color, sorry, I have already smudged it up with my smudgy little fingers. But it really does look awesome. Like this is such a great color. One of my favorite phones this past year has been the Galaxy Z Flip. It's just so freaking cool. And I think what they did with this is they took some of the design elements of this hinge and implemented it into the new Z Fold 2. This has been such a great phone. I absolutely love it. This is just such a cool device. I wonder if I've got my 200,000 flips yet. \"Hi, yeah, Justine can't come to the phone. \"You're gonna have to try her other phone. \"Hello?\" Also inside the box, we have our fast charger, USB-C cable, SIM card ejector, quick start guide. This isn't the 5G Flip, this is the previous one from earlier this year, but this has still been one of my favorite phones. So I'm very excited to test this out. I feel like this is the best of both worlds between Z Flip meets the Note 20. So before we turn this on, let's take a look at some of the features. (mellow music) The main display is 7.6 AMOLED, while the cover is 6.2. This front cover is Victus Gorilla Glass, while the back is Gorilla Glass 6. You can see the factory installed screen protector right here. And it is recommended to not try to remove this yourself. Like all new phones that Samsung has been coming out with, this is 5G. It also has a Qualcomm Snapdragon 865 plus processor. You can choose from 128 or 256 gigs of storage. It has 12 gigs of ram and a 4500 milliamp battery. It comes in two colors, mystic bronze and black, with four variations of hinge colors, metallic silver, metallic red, metallic blue, and metallic gold. This doesn't shoot AK or the ultra high risk photos like the Note 20, but it does still have single take, pro mode, adaptive auto framing and flex mode. I loved flex mode on the Z Flip, so I'm really glad to see that also carrying over to the Fold. The finger print sensor is located right here on the side power button. It has a triple camera set up here on the back with the main camera, which is a 12 megapixel F 1.8, a 12 megapixel F 2.2 ultra wide camera, and a 12 megapixel 2.4 telephoto with 2X optical zoom. There's two identical selfie cameras here on the front cover and on the back cover. These are both 10 megapixel F 2.2. I love that you can run multiple apps at once on the same screen using the multi active window. You just drag and drop up to three apps into place. You can also use this divider to change your screen size. (upbeat music) This is cool because it does have wireless charging. So you can charge it right here on the back. So when I watched a bunch of people's videos of the first version of this, a lot of people kept commenting that, \"I can see the crease. \"I can see the fold.\" Which yes, in video, you really can see it. So it's interesting because when you are actually holding it like this, you don't notice it as much. And that was something that I got very used to when I was using the Z Flip. So I feel like now that I've kind of been accustomed to that style of screen. All of the improvements that they've made since the first generation, they've used that to their advantage to make this one even better. I accept all of your terms and conditions. Do what you want with my Z Flip, Z fold I mean. Oh my gosh. (chuckles) How many times did I call this the Z Flip? Did I call this the Z Flip yet? - I don't know. - I'm not sure either. If this was any bigger, I don't think I would be able to hold it like this. So it's actually quite perfect. If I fold it just a little. Oh, that's nice, oh then you can see the crease, okay. I can see it more from this angle. If I'm looking at it like this, you can kind of see it. I mean, if you fold it, of course, you're gonna see it. Also, I should probably download some games from Game Pass because gaming on this thing, I bet, is gonna be really, really cool. I'm gonna try playing Xbox Game Pass on this device for the first time ever. So this is gonna be coming out very shortly here, but I'm testing out the beta version of this. We set up a top down. So that's why things may look a little bit different, but let's cut to the top down shot. I have an Xbox elite controller connected to the Z Fold. We're gonna play a game. Let me turn up the volume guys. This is... (upbeat music) These speakers are ridiculous. (gameplay sounds) I am hitting absolutely everything. Driving in the ice is a challenge. (gameplay sounds) All right, that's absolutely amazing. What else can we, \"Sea of Thieves\"? So again, this is beta, this will be out very soon for mobile. (gameplay music) This is so exciting. I'm getting a little emotional right now. Freaking \"Halo\", oh my God, I'm playing \"Halo\". Let's do it. I can't believe this. You guys. I know I've already told you what I'm doing, but I just need to reiterate the fact that I'm playing \"Halo\" on my phone. (gameplay sounds) This is a 2020 redeeming factor. - [Halo Character] \"There's a lot of blood on the ground.\" - Some apps don't support resizing while they're running. This apps gonna restart, okay, let's do it. Oh my gosh, this is crazy. Okay, you can also play on the cover screen. So I just restarted it. And now I'm playing on the cover screen. - [Halo Character] Circle west and check it out. - This is so awesome. - [Halo Character] But be selective. We don't need to telegraph our presence. (gun fire) - Oh, it told me not to telegraph my presence and I'm shooting them, sorry. I was telegraphing. (gameplay sounds) Oh, look at that front screen. Okay, this looks really good. Look at that. It's so cool. It's great because you do have a front facing or back facing camera, depending upon how you're holding this. And this is probably one of my favorite features. I haven't tried it yet, but I saw it in the demo. You will be able to see yourself in the front screen. Cover screen preview. Tyler there you are. I'm gonna take your picture, are you ready? It told me to clean my lens. \"I'm filthy.\" It just used the gesture and it automatically took that picture. It's still taking pictures, you're doing that. Here's our setup. We've got light. We got another camera, that's our podcast set up. (bang) Ow! (light chuckle) That hurt so bad. Anyway, we're gonna pick this back up and act like nothing happened. David Blaine's back there. Don't even ask questions anymore. Look how neat this looks. It's just a small little, tiny screen. Take selfies easily. Hold up your palm where the camera can see it to automatically take a selfie. All right. (camera clicks) Well it did it. So since I did just get this, and this is basically just an unboxing and kind of a first look, I'm gonna be doing a full review on this. So if there's anything else that you guys want to know or want me to test out, please leave that in the comments below. I'm very excited about the future of foldable devices. And I think Samsung has been doing a really great job of kind of pushing that initiative forward. Make sure you guys are subscribed and you hit the bell so you'll be alerted when I do my full review video of this. I'll be doing some photo and video tests. And if there's anything else you guys would like me to try out with this, be sure to leave them in the comments below. With that, I'll see you guys in the next video. Bye. (mellow high pitched music)",
    "transcript_keywords": [
        "screen",
        "Fold",
        "Flip",
        "Samsung",
        "guys",
        "front screen",
        "cover screen",
        "front",
        "cover",
        "camera",
        "back",
        "Samsung Fold",
        "Samsung Galaxy",
        "Note",
        "cool",
        "excited",
        "phone",
        "Galaxy",
        "Galaxy Z Fold",
        "Galaxy Z Flip"
    ],
    "transcript_entities": [
        [
            "4500 milliamp",
            "QUANTITY"
        ],
        [
            "Samsung Fold",
            "ORG"
        ],
        [
            "Reimagine",
            "PERSON"
        ],
        [
            "earlier this year",
            "DATE"
        ],
        [
            "2.4",
            "CARDINAL"
        ],
        [
            "Halo",
            "WORK_OF_ART"
        ],
        [
            "12",
            "CARDINAL"
        ],
        [
            "Z Fold 2",
            "PRODUCT"
        ],
        [
            "USB-C",
            "ORG"
        ],
        [
            "the Z Fold",
            "PRODUCT"
        ],
        [
            "2",
            "CARDINAL"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "Victus Gorilla Glass",
            "ORG"
        ],
        [
            "200,000",
            "CARDINAL"
        ],
        [
            "256",
            "CARDINAL"
        ],
        [
            "this past year",
            "DATE"
        ],
        [
            "David Blaine's",
            "PERSON"
        ],
        [
            "The Samsung Galaxy Z Fold",
            "ORG"
        ],
        [
            "AK",
            "PRODUCT"
        ],
        [
            "2020",
            "DATE"
        ],
        [
            "7.6 AMOLED",
            "QUANTITY"
        ],
        [
            "10 megapixel F 2.2",
            "QUANTITY"
        ],
        [
            "2X",
            "CARDINAL"
        ],
        [
            "5",
            "CARDINAL"
        ],
        [
            "Xbox",
            "ORG"
        ],
        [
            "6.2",
            "CARDINAL"
        ],
        [
            "Samsung",
            "ORG"
        ],
        [
            "four",
            "CARDINAL"
        ],
        [
            "12 megapixel",
            "QUANTITY"
        ],
        [
            "F 1.8",
            "PRODUCT"
        ],
        [
            "128",
            "CARDINAL"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "Tyler",
            "PERSON"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "two Note 20s",
            "DATE"
        ],
        [
            "Qualcomm",
            "ORG"
        ],
        [
            "Xbox Game Pass",
            "PRODUCT"
        ],
        [
            "the Z Flip",
            "WORK_OF_ART"
        ],
        [
            "up to three",
            "CARDINAL"
        ],
        [
            "some other third",
            "CARDINAL"
        ],
        [
            "F 2.2",
            "PRODUCT"
        ],
        [
            "Fold",
            "PRODUCT"
        ],
        [
            "One",
            "CARDINAL"
        ]
    ]
}