{
    "video_id": "oiXqDzpfhuE",
    "title": "Vision Pro, iOS 17, new 15in MacBook Air and more at #WWDC23",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-06-06T06:20:58Z",
    "video_url": "https://www.youtube.com/watch?v=oiXqDzpfhuE",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Unboxing",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 98001,
    "likes": 4606,
    "comments_count": 227,
    "description": "Here at WWDC 2323 they announced the new Vision Pro, iOS 17, WatchOS 10, iPad OS, MacBook 15in, and updated Mac Pro's and Mac Studios!\n🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Oh boy, friends, WWDC 2023 is here. It has happened. The keynote is over and we got a bunch of new things. Obviously Vision Pro was the stage stealer, it was the highlight of the show, but there's so much more that happened that I feel like sometimes people aren't gonna talk about because they're just gonna wanna talk about Vision Pro, which is obviously kind of like all I wanna talk about as well. So I made a full video going more in depth on some of the features and my hands-on experience with it. So what else happened at WWDC? So they started off, they announced a new 15 inch MacBook Air, which is really exciting. I'm such a huge fan of the MacBook Air. And of course this has the new M2 chip. It's 11.5 millimeters thin. It's the thinnest 15 inch laptop and it's three pounds. It's got MagSafe and two thunderbolt ports. There's four colors. We've got the liquid retina display with five millimeter borders. It's got 500 bits of brightness, 1 billion colors, 1080 P camera and a three mic array. It's also got six speakers and spatial audio. And this has the M2 chip with eight core CPU in a 10 core GPU. It's 12 times faster than the fastest Intel based Mac with 18 hours of battery life. Much like all of the other MacBook Airs, it is silent and it has no fans. It really is taking advantage of that M2 chip. These are priced at 1299 and they are available to order now. The Mac Studio is such a beautiful little computer and I'm so glad that they're still keeping this in the lineup. This also got an update today. The Mac Studio now has an M2 Mac chip and it's 25% faster than an M1, rendering up to 50% faster than M1 and it's introducing a new M2 Ultra chip. This combines two M2 max chips. That's, that's a lot of chips. 24 core CPU, 76 core GPU and it supports up to 192 gigs of memory. I almost hit the floor on that one, like that's just, like you can do 22 streams of 8K. Yeah, 22 and you better believe we'll be trying that out. It's also got higher bandwidth, HDMI up to 8K resolution and it supports up to six pro display XDR. Like that's how much money is that? What's six times? What's that math? 36... $36,000 for displays, holy moly. I need another line of credit. Also a fan favorite. The new Mac Pro is now getting the M2 treatment and I could not be more excited. I am just, I still love this design and I remember being at WWDC when they first announced the Mac Pro, might have been one of the best days of my life and now today might be the best day of my life. So there's that. Every Mac Pro now comes with an M2 Ultra chip, 24 core CPU, 76 core GPU and of course will support up to 192 gigs of memory. Now it has an afterburner card, but it's actually the equivalent of seven after burner cards all in one. Thanks to the new M2 chip. This is something that I was most excited about. Eight freaking thunderbolt ports, that is so beautiful, like that is just music to my ears. Now the Mac Pro is definitely made for customization, especially doing higher end music production, video production. You need that power and those ports to be able to support all of those external devices. This now has six Gen 4 PCI slots. The new Mac Pro is starting at $6,999, which when you actually spec all of this out and you see what is all there, that's not bad at all. Now, iOS 17 is also something that they talked about. They haven't really updated the phone app in a very long time, so this was kind of cool. They have these new personalized posters. You can customize how you look when you call someone with photos, emoji and text and it's also connected to your contact card. So when you share your contact that'll be shared with the person that you're sharing with. Live voicemail is actually really awesome and I'm hyped about this because I don't like listening to voicemail, but you can actually see the live transcriptions showing up as someone is leaving a message. So like if they're saying something important you can pick it up right then and there. FaceTime, this is cool. You can leave a FaceTime video message to someone if they don't answer, which is usually the case a lot of times, I miss a lot of calls, but it would be awesome to be able to just go back and see the message of either someone getting upset that I didn't answer. I don't know. It's gonna be really neat and I'm so excited that they added this feature. In messages, they've got new search filters so you can start a search and then narrow the terms. There's a catch up arrow that lets you jump up to what you missed and replies are so much better now. You can swipe to reply. Voice messages are transcribed, which I'm so excited about. All of my friends love doing voice messages and I just feel like they're tiny voicemails and I don't I don't like voicemail, but now it's basically turning that tiny voicemail into text. I'm here for it now. This new check-in feature is really cool. This will let your family or friends know that you have arrived somewhere safely and automatically and if you haven't got there yet, they can check in and see where you're at and they'd be able to see things like battery level, cell service. And of course this is all end to end encrypted. There is a new layout and design for the iMessages app menu, which I like. I feel like they've kind of put all of those little icons and kind of hidden them away so you don't have to see them when you're typing or accidentally hit them. There's also a new stickers experience, so you can create stickers using live photos and save them. You can add effects and you can also now react to messages with stickers. You'll be able to use these and access them in third party apps or anywhere where emojis are available. Airdrop is something that I cannot live without and they just announced a new feature called NameDrop. So basically if I wanted to give you my contact I just go, boop boop, I just name-dropped you. I actually really like that name. All you do is you just bring your phones close together, then the new contact posters will pop up and you can share contact info seamlessly. This can also be used with Apple Watch and for larger files you can now leave airdrop range and the content will still send in full quality over the internet. That's something that I'm so excited about because I transfer a ton of files from my iPad to my computer, to friends to Tyler, who's over there. We're always sharing things back and forth, so if we are not in Airdrop range anymore, it'll still continue to upload as long as you have an internet connection. Oh man, this was also super exciting. The new Mac OS now has a new name and it is Mac OS Sonoma. I'm always looking forward to seeing what they're gonna name it and of course I can't wait to try it out. There's gonna some new slow-mo screensavers from all around the world that will be viewable on Mac OS Sonoma. This WWDC really focused a lot on widgets and now widgets are on the Mac and better than ever. These widgets can live right on the desktop and they can change the look depending upon how your desktop looks. Now in the Widget Gallery, using continuity it can access iPhone widgets on the Mac now. There was also a lot of focus about gaming on the Mac. There's a new game mode, which will prioritize the CPU and GPU. This allows for optimized gaming experiences for smoother frame rates. It was also so cool to see Kojima on the stage bringing us Death Stranding, the Director's Cut to the Mac. =I'm also a huge fan of the Apple Watch, as you know so it's always so exciting to see all of the new things that watchOS will have in store for us. One of the biggest watchOS 10 features is bringing cycling to the Apple Watch. It can connect to Bluetooth-enabled bike sensors. There's new cycling power workout view and this was super cool. Your cycling workouts can mirror on the iPhone full screen display so if you are using your phone for navigation and it's mounted on your bike your Apple Watch will be mirrored to the display as well. They also added some new hiking features, so the compass will auto-generate way points with GPS. There's a new elevation view and you can see a 3D view of your saved way points. IPad OS 17 also has some really cool new features. There's new interactive widgets that will give you quick interactions without having to actually open the app. You can control everything right from the widgets. There's also now personalized lock screens, just like on the iPhone with custom wallpaper, text fonts, colors and more. Live activities is also pretty cool. You can keep track of food orders, travel plans, sports scores and you can even keep track of multiple timers. It's about time. There's also updates to how you can work with PDFs in iPad OS. There's autofill, custom signatures that you can use the Apple Pencil to write with, PDFs in the notes app is pretty awesome. You can also use multiple PDFs in one app and of course with the Apple Pencil this will allow you to annotate and you can even see the shared PDF changes that'll appear right away in between devices. Well, thank you guys so much. I had so much fun at WWDC. I hope you guys enjoyed the keynote and I can't wait to get my hands on all of these new features and devices. I'll see you guys in the next one, bye.",
    "transcript_keywords": [
        "Mac Pro",
        "Mac",
        "Apple Watch",
        "Pro",
        "Vision Pro",
        "Mac Studio",
        "Apple",
        "chip",
        "core GPU",
        "core CPU",
        "WWDC",
        "Mac chip",
        "cool",
        "widgets",
        "core",
        "MacBook Air",
        "GPU",
        "CPU",
        "Apple Pencil",
        "Live"
    ],
    "transcript_entities": [
        [
            "500",
            "CARDINAL"
        ],
        [
            "NameDrop",
            "PRODUCT"
        ],
        [
            "the Apple Watch",
            "ORG"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "Gen 4 PCI",
            "ORG"
        ],
        [
            "CPU",
            "ORG"
        ],
        [
            "a ton",
            "QUANTITY"
        ],
        [
            "22",
            "DATE"
        ],
        [
            "FaceTime",
            "ORG"
        ],
        [
            "the Widget Gallery",
            "FAC"
        ],
        [
            "up to 50%",
            "PERCENT"
        ],
        [
            "1 billion",
            "CARDINAL"
        ],
        [
            "six",
            "CARDINAL"
        ],
        [
            "seven",
            "CARDINAL"
        ],
        [
            "25%",
            "PERCENT"
        ],
        [
            "192",
            "CARDINAL"
        ],
        [
            "Tyler",
            "PERSON"
        ],
        [
            "Airdrop",
            "PRODUCT"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "Mac",
            "ORG"
        ],
        [
            "Kojima",
            "PERSON"
        ],
        [
            "WWDC",
            "EVENT"
        ],
        [
            "iPad",
            "ORG"
        ],
        [
            "15 inch",
            "QUANTITY"
        ],
        [
            "24",
            "CARDINAL"
        ],
        [
            "M2 max",
            "QUANTITY"
        ],
        [
            "Mac",
            "PERSON"
        ],
        [
            "MagSafe",
            "PRODUCT"
        ],
        [
            "M1",
            "PRODUCT"
        ],
        [
            "the MacBook Air",
            "ORG"
        ],
        [
            "five millimeter",
            "QUANTITY"
        ],
        [
            "M2 Mac",
            "ORG"
        ],
        [
            "eight",
            "CARDINAL"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "the Mac Pro",
            "WORK_OF_ART"
        ],
        [
            "third",
            "ORDINAL"
        ],
        [
            "2023",
            "DATE"
        ],
        [
            "MacBook Airs",
            "ORG"
        ],
        [
            "MacBook Air",
            "ORG"
        ],
        [
            "FaceTime",
            "PRODUCT"
        ],
        [
            "PDF",
            "ORG"
        ],
        [
            "the best days",
            "DATE"
        ],
        [
            "The Mac Studio",
            "ORG"
        ],
        [
            "M2",
            "PRODUCT"
        ],
        [
            "18 hours",
            "TIME"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "Mac Pro",
            "ORG"
        ],
        [
            "three",
            "CARDINAL"
        ],
        [
            "11.5 millimeters",
            "QUANTITY"
        ],
        [
            "Mac OS Sonoma",
            "ORG"
        ],
        [
            "Every Mac Pro",
            "PRODUCT"
        ],
        [
            "the Apple Pencil",
            "ORG"
        ],
        [
            "three pounds",
            "QUANTITY"
        ],
        [
            "6,999",
            "MONEY"
        ],
        [
            "8",
            "CARDINAL"
        ],
        [
            "M2",
            "CARDINAL"
        ],
        [
            "1080",
            "CARDINAL"
        ],
        [
            "up to six",
            "CARDINAL"
        ],
        [
            "10",
            "CARDINAL"
        ],
        [
            "76",
            "CARDINAL"
        ],
        [
            "Apple Watch",
            "ORG"
        ],
        [
            "the Mac Pro",
            "PRODUCT"
        ],
        [
            "GPU",
            "ORG"
        ],
        [
            "Intel",
            "ORG"
        ],
        [
            "12",
            "CARDINAL"
        ],
        [
            "the next one",
            "DATE"
        ],
        [
            "17",
            "CARDINAL"
        ],
        [
            "Eight",
            "CARDINAL"
        ],
        [
            "XDR",
            "ORG"
        ],
        [
            "22",
            "CARDINAL"
        ],
        [
            "36",
            "CARDINAL"
        ],
        [
            "Vision Pro",
            "ORG"
        ],
        [
            "36,000",
            "MONEY"
        ],
        [
            "four",
            "CARDINAL"
        ],
        [
            "IPad",
            "ORG"
        ],
        [
            "1299",
            "DATE"
        ],
        [
            "Death Stranding",
            "PERSON"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "iMessages",
            "ORG"
        ],
        [
            "One",
            "CARDINAL"
        ]
    ]
}