{
    "video_id": "OPRT88pf6P8",
    "title": "Meet me in LA! Los Angeles event - Vlog University!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-01-07T00:06:31Z",
    "video_url": "https://www.youtube.com/watch?v=OPRT88pf6P8",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "vlog university",
        "los angeles meetup",
        "event",
        "production"
    ],
    "views": 50794,
    "likes": 2365,
    "comments_count": 268,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys it's Justine and \"Vlog University\" is gonna be here before you know it. If you guys haven't heard about this, I'm doing a conference here in Los Angeles at the Convention Center. It's on January 31st to February 1st, and it's gonna be so amazing, because not only are you guys gonna get to come here meet other like minded creators, but I will be there putting on a bunch of sessions. It's two days and covers everything in content creation. Not just the filming, the shooting, the editing, the color grading, the audio, the lighting, but also we have some lawyers that are gonna be talking about contracts. My manager is actually gonna be there and he's gonna be talking about how to work with brands, what it's been like to work with me, and how he has kind of helped me grow my business to where it is today. I like to think of it as a crash course of everything that goes in to producing content for the internet. We're gonna have TikTok panels, we're gonna have some green screening sessions talking about how to green screen on a budget. My friend Francesca, who I've been working with for years, who does my makeup for a lot of bigger shoots that I do, she's gonna be giving you guys some tips and tricks in her session on how to do makeup for on camera. And not just for the girls, this is also for the guys as well. We're gonna be talking about mobile production, how to shoot with an iPhone, how to quickly edit. I have a bunch of sessions on day two, so that's gonna be the main day where we talk about mostly marketing. One of the ones that I'm really excited about is a collaboration panel. So I'm gonna have a special guest on that one, which has not been announced yet. Even if you're a fan of YouTube and you've never made videos before in your entire life. This will give you an incredible insight on what goes on on a daily basis in the lives of YouTubers, but not just YouTubers, Instagramers, TikTokers. The process is kind of all the same, but the platform is different, so creating content for multiple platforms is also something that we're gonna be talking about. It's gonna be incredibly overwhelming and I don't think I've ever gone to a conference that is like this. If you've never been to a conference before, this is way different than something like VidCon or normal YouTuber meet ups. We have two days of classes scheduled, like I said before, ranging from video production, to marketing, to lawyers to talk about contracts, how to light your videos, how to get good audio, what gear to use. It's gonna be incredibly extensive, and the amount of information that I think you guys are gonna leave this weekend with is probably gonna be overwhelming. This event is not just for beginners, but if you are new to this whole industry, this is gonna be so much information that I wish this was something that I had when I first started doing this, because I started and had no idea what I was doing. So this is gonna be an accumulation of everything that I've learned over the past 13 years. A lot of people from my team are gonna be speaking and it's just really cool to be able to bring all the people that I've worked with for so long, and be able to share some of this knowledge with you guys. You can take a look at the website for the tentative schedule that we have up right now, but this is gonna be here before you know it. So if you guys are interested in getting tickets, you can use this promo code at checkout for a discount. Just head to vloguniversity.com. We have a bunch of different ticket options. There's also a payment plan on the website, so you don't have to pay full price for the tickets all up front. A lot of you guys have been asking about the ticket prices and why they're different from things like Vidcon. Because these are actual instructors that we have. So these are people whose profession is teaching these types of classes. So this isn't just some random people that we decided, \"Hey you look like you might know how to edit in Final Cut, \"come teach our classes for us.\" I wanted to make sure we had some of the best people in the industry here to teach you guys. So I'm so honored that we have so many amazing people who agreed to sign on for the first year of Vlog University. This is the first time that we're doing this, so really anything can happen, and I have no idea what to expect other than I know that the lineup of people that we have right now are absolutely incredible. Another really exciting thing is we do have support from Apple for this event which is basically a dream come true. Obviously I do edit a lot in Final Cut, so we'll have some really great Final Cut classes. If you've never edited in Final Cut before, we have beginner classes. We also have a little more of advanced things talking about color grading and all sorts of things that go into post production. If you guys have any other questions, don't hesitate to ask. There's a little button on the website that says \"Contact Us\", so just click that and feel free to ask any questions that you guys might have and the team here at Vlog University will be here to help you guys out. I'm gonna give you guys a little sense of what the program looks like. So here on the website, you can see that day one is kind of focusing on producing content. So we have several different tracks right here, but you can see we have everything from choosing the right gear, \"Camera 101\", Final Cut Pro editing, contracts, podcasting, how to make the most out of all your content, \"Building your Home Studio on a Budget\", how to quickly reformat for Facebook, Instagram, and other services. We've also got a nice \"Round Table\" discussion. Anther \"Panel\" about self care and burnout. And we also have an \"Expo Night.\" And then day two we also have three different tracks, \"Creative Strategy\", \"Creating Content\", \"The Business of Being a Vlogger\". We're still working on filling out the entire schedule, but this is gonna be super fun. And here's my little track over here. We've got \"Creative Intuition\" from development to execution, the importance of collabing, branding techniques, green screening on a budget, \"Tik Tok Production\", \"Brand Deals\", \"Audience Development\", \"Building Your Team\". That's actually my manager, hi Petar. We've got a nice fun \"Apple Presentation\". This last \"Panel\" here that is talking analyzing the future of influencers and social media. That's not even the final schedule yet. We still have things to fill in. It's so much great stuff that honestly, (sighs) I can't believe it. So January 31st and February 1st, I look forward to seeing you guys there and being your teacher. (squeals) It's gonna be incredible. All right, that it, I'm gonna go. I'll see you later, bye. (rhythmic music)",
    "transcript_keywords": [
        "Final Cut",
        "guys",
        "Convention Center",
        "Los Angeles",
        "talking",
        "Final",
        "Vlog University",
        "Cut",
        "Final Cut classes",
        "people",
        "Final Cut Pro",
        "content",
        "Justine",
        "great Final Cut",
        "classes",
        "day",
        "production",
        "Vlog",
        "University",
        "things"
    ],
    "transcript_entities": [
        [
            "the Convention Center",
            "FAC"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "Vlog University",
            "ORG"
        ],
        [
            "the past 13 years",
            "DATE"
        ],
        [
            "this weekend",
            "DATE"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "January 31st to February 1st",
            "DATE"
        ],
        [
            "years",
            "DATE"
        ],
        [
            "Camera 101",
            "WORK_OF_ART"
        ],
        [
            "YouTuber",
            "ORG"
        ],
        [
            "Instagram",
            "ORG"
        ],
        [
            "three",
            "CARDINAL"
        ],
        [
            "Apple Presentation",
            "WORK_OF_ART"
        ],
        [
            "YouTube",
            "ORG"
        ],
        [
            "Los Angeles",
            "GPE"
        ],
        [
            "Vidcon",
            "PERSON"
        ],
        [
            "The Business of Being a Vlogger",
            "WORK_OF_ART"
        ],
        [
            "Building Your Team",
            "WORK_OF_ART"
        ],
        [
            "TikTokers",
            "ORG"
        ],
        [
            "the first year",
            "DATE"
        ],
        [
            "Petar",
            "PERSON"
        ],
        [
            "daily",
            "DATE"
        ],
        [
            "Final Cut",
            "WORK_OF_ART"
        ],
        [
            "Contact Us",
            "WORK_OF_ART"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "Panel",
            "WORK_OF_ART"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "January 31st and February 1st",
            "DATE"
        ],
        [
            "Francesca",
            "PERSON"
        ],
        [
            "Final Cut Pro",
            "PRODUCT"
        ],
        [
            "Expo Night",
            "WORK_OF_ART"
        ],
        [
            "Facebook",
            "ORG"
        ],
        [
            "Final Cut",
            "PRODUCT"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "Audience Development\"",
            "WORK_OF_ART"
        ],
        [
            "YouTubers",
            "ORG"
        ],
        [
            "VidCon",
            "PERSON"
        ],
        [
            "Creating Content",
            "WORK_OF_ART"
        ],
        [
            "day two",
            "DATE"
        ],
        [
            "Instagramers",
            "ORG"
        ],
        [
            "Building your Home Studio on a Budget",
            "WORK_OF_ART"
        ],
        [
            "two days",
            "DATE"
        ],
        [
            "TikTok",
            "ORG"
        ],
        [
            "One",
            "CARDINAL"
        ]
    ]
}