{
    "video_id": "PAyEwqld6W8",
    "title": "Will I get a Galaxy S9?",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-03-19T17:59:48Z",
    "video_url": "https://www.youtube.com/watch?v=PAyEwqld6W8",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "samsung s9",
        "samsung galaxy s9"
    ],
    "views": 222796,
    "likes": 8270,
    "comments_count": 1244,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, how's it going, it's Justine, and today we're doing an ask iJ episode, that's where you guys ask me questions, I usually ask you on Twitter using the hashtag askIJ, and I was actually shocked, being obviously a huge iPhone Apple fan, you guys are super obsessed with me using Android phones. I saw so many questions asking me if I'm getting an S9, what current Android phone am I using, and first I'm going to answer the question of what Android phone am I currently using right now. Right now I am currently using the Pixel Two, when I was traveling I wanted to bring my Google phone along, mostly because I really love the front facing portrait mode. But before that I was using the OnePlus 5T in sandstone, this phone is beautiful. When I think about what a perfect phone looks like, this is it. I love the look of this, I love the placement of the fingerprint sensor, it's so slick and beautiful, I mean it just fits right in at home with my little shooting set up here. And before that I was using the Note8, and then before that I was using the S8. Leading in the question of Justine, are you going to get an S9, which is what all of you guys wanted to know, there are so many S9 questions, I was like well we need to talk about it, that's gonna be the first question that we address. And yes, I am going to get an S9, and I'm kind of excited about it, because I love the dual aperture. One of the things that's really difficult with smartphones is taking photos in low light. So with the dual aperture, depending upon what lighting situation you'll be in, it will adjust accordingly. So I cannot wait to go and try and take some night photos and see how this thing stands up. I'm also kind of excited about the AR emojis that they have, much like the animojis on the iPhone, you can take a selfie with the Samsung S9 and it will create an augmented reality version of yourself, so you will look something similar to this. So I'm really excited to see what my AR emoji looks like. Will it look like me, will it not, I'm not sure. I've seen so many of my friends posting their AR emojis, so I can't wait to see what mine looks like. It has new intelligent scans, so it's using facial recognition and iris scannings, so it's supposedly will help you be able to unlock your phone quicker in the dark. Also I'm excited about the live translation, when I was in Austria recently I just, it's crazy because everybody else outside of the U.S. speaks English, thankfully, because us Americans, we barely know one language, so it's really unfortunate traveling abroad, because I usually don't know what signs say, so I was using Google Translate on my iPhone. But with live translations, it will happen super super fast. So in the S8 one of the biggest complaints I think a lot of people had was the fingerprint sensor was off-centered, so they now have moved it a little bit lower, right below the camera, so it's nice and centered depending upon which fingerprint you have, it'll be easier to access. As for which color, I definitely want to get the lilac one, mostly because it's different than any other phone that I have, so when I saw that that was one of the color choices, I just had to do it. I'll be posting that review very shortly, so stay tuned. If you guys aren't subscribed, make sure you subscribe so you don't miss it. Moving along, from the S9 questions, we have got, well you're probably gonna ask Justine, what is on your phone right now? I went to the Grand Canyon recently and I think that when I posted that vlog, Youtube was broken because nobody saw it, you didn't get it in your subscriptions, so if you want to see that I will put an annotation here, and a link in the description if you want to watch it. We rode mules around the Grand Canyon, and one of the things that we had to do, we had to have our phones attached to ourselves, so I took this GoPro strap that was from one of the GoPro floating devices, and I attached it to my Tech21 case, so it's kind of not really that sturdy, but I've had it on here for several weeks, and now I'm addicted, like I don't want to use my phone without a strap on it. That's a question that has been asked before but not in the askIJ hashtag. Carmen is asking would you drive this? Well I don't know if my body could fit in that, but I do have many Lego versions of myself that could, so yes, Lego Justine definitely would. Migs is asking what camera rig do you use for vlogging? The short answer is for the point and shoot camera I use is an RX100 Mark Five, but for on the go, better audio, lenses, I use the A6500. What do I do with all the Apple stickers that come with everything that I've bought over the years? That's actually a really good question, I wish that I would have saved them, but sometimes they get thrown away, sometimes they just stay in the box, other times I stick them to things, but most of the time I feel like they do get misplaced, but that would have been the coolest thing ever if I had saved all of those from the very beginning of buying Apple products. I really messed up. Terren is asking if I still edit my own videos. Yes, I do, I'm crazy. I really wanted to try to double the amount of content that I do this year, but it's really hard because I do need to find an editor, and I know so many of you guys have offered to edit for me, but I'm so picky, and I'm so silly, and I just feel like at some point I just want to do it myself, maybe I'm a control freak, I'm not sure. I usually don't think of myself as one, but when it comes to editing and creating my content, I'm like I know exactly what I want, let me just do it. Deb is asking can I play the drums? I did play drums actually in high school a little bit, but I wasn't very good, I didn't know what I was doing, I would just be like oh this sounds cool, I'm gonna play this. I also don't know how to read music, I feel like it's probably something that I could easily learn, but do I want to learn, I don't think so. Maybe one day I'm gonna be the next drummer in some random band, and you're gonna be like I remember when she made video on Youtube, and now she's the drummer in insert band name here. Deb is also asking what Audible book recommendation I've been listening to, surprise, time for the Audible plug but this is actually very exciting, because I didn't even know that you could do this until I recently found out. You can listen to Audible books on your Echo devices. Now I'm not gonna say her name, A-L-E-X-A, a lot of you guys have been very upset because I've been triggering your smart home devices, so I'm going to bleep every time I say her name. If you guys have never used Audible before, I definitely recommend it, I use it all the time when I'm traveling or in traffic to pass the time, you guys can get one month free trial plus a free audiobook, check out audible.com/ijustine, or text iJustine to 500500. But this is where it gets good, because if you've got one these little guys, I unboxed this not too long ago, this is the Echo Spot, I also have an Echo Show downstairs in my kitchen, you can listen to your Audible books on your Amazon Echo devices, and not only that, you won't lose your place if you decide to go from the Echo device to your phone, back to the device again, you can pause, you can rewind, you can set a timer. Let's try it out. Play my audiobook. - Getting your book from Audible, resuming iJustine. - [Audiobook] Of every text message, data transfer, and file download I've made since switching service providers. Why in the world would they send me this. - Pause. Okay so I paused it on there. And now I'm gonna open up my Audible app, and here it is, it picked up right where I left off on the Echo device. - [Audiobook] I mean really, since when does a phone bill come... - I know I've done a ton of these Audible plugs before but this is probably the most exciting, because this is the first time that I have listened to my own audiobook. It's one of those things where you do something, and you record it, and you're just afraid that it's not gonna be what you expect it to be, because I have no control over what it was, so I was like I'm just never gonna listen to it. So this is several years later, and this is the first time that I'm listening to it, and it's actually really, really cool. I'm kind of getting a little bit emotional now because this book meant so much to me, and it really kind of told my story of how I got started, and why I'm standing here today, I'm standing by the way, I'm not sitting down, so, spoiler alert. So if you haven't got this book, I would love for you to listen to it or read it, again, check out audible.com/ijustine. And if you guys have already read my book thank you so much, if you've listened to it, that's even more amazing, because you get to hear me read my book to you. Man, this is so crazy. It's kinda crazy because I released this book in 2015 and so it's already been several years since, so I feel like you know, telling the story of my life, it stops at a certain point, so now I feel like, how much time will pass before I write the second one. I really did enjoy the whole writing process, I feel like because it was my first book, I didn't really know what I was doing, Youtubers weren't really releasing books like they are now. I learned so much in that process so I definitely look forward to hopefully doing another one in the future, I have a bunch of fun ideas, not just an autobiography, but a few other things that I think you guys would enjoy. Well thank you guys for watching, I enjoyed reading all of your questions, which mostly were revolving around am I getting an S9, if you guys have any other questions I will be answering those in the comments below for the next few hours of this video, and usually the next couple of days I come back and forth and read and reply. If you have any other questions, leave 'em in the comments, and I will see you in my next video. Bye!",
    "transcript_keywords": [
        "Android phone",
        "current Android phone",
        "guys",
        "phone",
        "Audible",
        "Android",
        "questions",
        "book",
        "Audible books",
        "Echo",
        "time",
        "current Android",
        "question",
        "Echo devices",
        "iPhone Apple fan",
        "huge iPhone Apple",
        "Twitter",
        "Hey guys",
        "kind",
        "Justine"
    ],
    "transcript_entities": [
        [
            "Amazon Echo",
            "ORG"
        ],
        [
            "English",
            "LANGUAGE"
        ],
        [
            "an Echo Show",
            "WORK_OF_ART"
        ],
        [
            "second",
            "ORDINAL"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "iJustine",
            "PERSON"
        ],
        [
            "the next couple of days",
            "DATE"
        ],
        [
            "S9",
            "ORG"
        ],
        [
            "Carmen",
            "PERSON"
        ],
        [
            "Audible",
            "PERSON"
        ],
        [
            "Audiobook",
            "WORK_OF_ART"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "Two",
            "CARDINAL"
        ],
        [
            "Youtube",
            "PERSON"
        ],
        [
            "RX100 Mark Five",
            "PRODUCT"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "2015",
            "DATE"
        ],
        [
            "a ton",
            "QUANTITY"
        ],
        [
            "the years",
            "DATE"
        ],
        [
            "some night",
            "TIME"
        ],
        [
            "Twitter",
            "ORG"
        ],
        [
            "Lego",
            "ORG"
        ],
        [
            "the Echo Spot",
            "ORG"
        ],
        [
            "Samsung",
            "ORG"
        ],
        [
            "Google",
            "ORG"
        ],
        [
            "several years",
            "DATE"
        ],
        [
            "iris scannings",
            "ORG"
        ],
        [
            "S9",
            "PRODUCT"
        ],
        [
            "several weeks",
            "DATE"
        ],
        [
            "Terren",
            "PERSON"
        ],
        [
            "Deb",
            "PERSON"
        ],
        [
            "500500",
            "CARDINAL"
        ],
        [
            "Americans",
            "NORP"
        ],
        [
            "the next few hours",
            "TIME"
        ],
        [
            "OnePlus 5",
            "PRODUCT"
        ],
        [
            "S8",
            "PRODUCT"
        ],
        [
            "Austria",
            "GPE"
        ],
        [
            "U.S.",
            "GPE"
        ],
        [
            "GoPro",
            "FAC"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "this year",
            "DATE"
        ],
        [
            "several years later",
            "DATE"
        ],
        [
            "the Grand Canyon",
            "LOC"
        ],
        [
            "Migs",
            "PERSON"
        ],
        [
            "Android",
            "ORG"
        ],
        [
            "one month",
            "DATE"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "GoPro",
            "PERSON"
        ],
        [
            "Youtube",
            "ORG"
        ],
        [
            "iPhone Apple",
            "ORG"
        ],
        [
            "Lego Justine",
            "PERSON"
        ],
        [
            "One",
            "CARDINAL"
        ]
    ]
}