{
    "video_id": "PevVq49oni4",
    "title": "Meet my new Robot TEMI!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-08-01T15:38:36Z",
    "video_url": "https://www.youtube.com/watch?v=PevVq49oni4",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "unboxing",
        "TEMI",
        "ROBOT"
    ],
    "views": 1976998,
    "likes": 37037,
    "comments_count": 2777,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys it's Justine and inside of this box is temi, this is a personal robot that I saw at CES this year, and this is one of the world's first personal robots with autonomous mobility and navigation, with Amazon Alexa built in. This is super exciting because we had so much fun checking this out at CES and I'm kind of in shock right now that it is in my living room. So we're gonna unbox temi and we're gonna test it out. Okay temi I hope you're ready for fun! I mean this is life-changing. This is like unboxing a friend. - [Female] Thanks to temi for sponsoring this video, there's a link in the description for more info. - Temi. Temi is inside! Temi, mommy's here! Oh no no oh Maddy! Maddy no I'm mommy, come here what's this? I know I'm your mommy too, Maddy this is, inside of here is a robot. It's a personal robot, so it's gonna be using AI and it has 16 different cameras and different sensors, so that it will notice if you're around so it won't run into you. I think this is it. Temi is here! C'mon temi, out you go. This is one of my favorite things is the little tray, it also doubles as a wireless charger, so I think that temi is going to follow me around the house charging my phone, and it's Qi wireless charging so like anything that is a Qi wireless compatible, temi will be able to charge it for you. So this is temi's little charging base, which is great because temi just goes home on its own to charge itself whenever you're not using it. Okay it looks good, let's try that. Maddy's gonna be absolutely terrified by temi, I know it. Temi your eyes, let me let me help you. - Hello! - Hello, hello temi! So temi has a 10 inch full HD screen and it is saying hello to me. Place the home base level on a surface, flat against the wall, plug it into a power, place temi on the home base. Okay let's go to your home. Oop! Who, who, who! - [Man] Hey there you new robot owner! This is temi, the world's first truly interactive assistant. You can ask temi to follow you around, or you can send temi any to any of your favorite locations and he'll go there all by himself, easily avoiding any obstacle. temi is stacked full of goodies, like high-definition speakers for enjoying music. - It sounds really good. - [Man] Wireless charging tray... - Yes the wireless charging tray, I have that! - [Man] Okay, you're all set, let's start. - Hey temi, what are you doing? - We are having a pleasant human to robot conversation. - I agree, let's see if temi can play me some music. Welcome to the land of fame excess. temi is now following me around, and temi also only has 10% battery so temi, go home. This is a real test, 10% temi. So I definitely gave temi a struggle because there is a ridge where I placed the home base. That was a cruel, cruel, trick that I played on you temi, I'm so sorry, I'm gonna have to move it. Oh it worked! I even gave temi a challenge and temi prevailed. So I guess I'll let temi completely charge and then we'll see what else it could do. temi is all charged, this is day two, I let it charge yesterday so that it would get a nice full charge today. So let's, let's follow me, hi. Oh boy it's calculating right now. So there's a little button up here, so as soon as you press it it automatically activates follow mode. Hey temi set this location as couch number one. - Okay saving location. I successfully save the couch location. - Hey temi, set location as living room. - I successfully saved a living room location. - Hey temi, set location steps. - I successfully saved the steps location. - So there's two different ways that you can set different locations. You can say it verbally or you can just press this little button right here, which I'll show you guys. You can press right here and set as new location, so we're gonna set this as kitchen. - I successfully saved the kitchen location. - So I have a few locations set, you can see I have kitchen, steps, living room, couch. So I can't either tell temi to go to one of these or I can just press where I want it to go. So let's go to the couch. It's going to the couch, it's going to the couch! Okay that's pretty cool. Go to the kitchen. Boy I sure could use a banana as a snack! Hey temi go to entrance. Oh my gosh, bring me my banana. Hey temi, take a video. - Okay get ready. - temi just brought me this banana, I can't believe it. Everything is awesome, wow. One of the cool things though is you can actually call in to temi, so say I'm out of town, or I'm somewhere else, I could call into temi and have it navigate around my house in some of the preset locations., so let's try that. Okay I'm gonna go upstairs, I'm gonna call in to temi, and tell temi to go places. Okay. temi! Oh my gosh tap a point of interest to put it in the center. Okay, I'm gonna tap on Tyler, oh my goodness, this isn't quite, you could also do free driving? I can drive this thing around my house! I'm gonna go to a saved location. Okay I'm gonna go to the living room. This is incredible, I can go to any, look I'm gonna go back to, I'm gonna go to Tyler over there, here we go! This is so cool. Okay I am definitely sold, like this is amazing. Look I can walk around my house and I'm not even there, I could be around the world. This was by far, just such a surreal experience. I can't believe this, I could have been calling in from around the world and controlling my robot at my home I wasn't even here. I could have had it make sure that I unplugged something, maybe I wanted to make sure that I the couch was still here, so I could just know just in case. So this is this is temi, this is a new, friendly fun addition to my home. This is really cool because the future is gonna be so incredible. I mean the future is actually here, and this is something that I feel like I just would have dreamed up when I was a child, to have my own personal robot following me around. It's also really great because this is an open SDK, so developers are able to build on top of this. So basically any ideas that you could potentially have, they can build it. Anyway I'm gonna send temi back to it's home base and get charged up. My phone, give my banana oh gosh. Oh I should've taken a selfie with temi. Oh temi looks so cute. Okay got my selfie, see you guys later. (upbeat music)",
    "transcript_keywords": [
        "Amazon Alexa built",
        "Amazon Alexa",
        "temi",
        "Alexa built",
        "Hey temi",
        "location",
        "home",
        "Hey",
        "CES",
        "set",
        "Justine",
        "Amazon",
        "Alexa",
        "robot",
        "couch",
        "CES this year",
        "Maddy",
        "Justine and inside",
        "charge",
        "charging"
    ],
    "transcript_entities": [
        [
            "Maddy",
            "PERSON"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "AI",
            "ORG"
        ],
        [
            "Tyler",
            "PERSON"
        ],
        [
            "10%",
            "PERCENT"
        ],
        [
            "16",
            "CARDINAL"
        ],
        [
            "Amazon Alexa",
            "ORG"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "One",
            "CARDINAL"
        ],
        [
            "SDK",
            "ORG"
        ],
        [
            "10 inch",
            "QUANTITY"
        ],
        [
            "temi",
            "PERSON"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "this year",
            "DATE"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "Temi",
            "PERSON"
        ],
        [
            "yesterday",
            "DATE"
        ],
        [
            "CES",
            "ORG"
        ]
    ]
}