{
    "video_id": "Sh37jtrdLW8",
    "title": "On the go productivity with HP EliteBook 845 G9!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-09-20T20:36:09Z",
    "video_url": "https://www.youtube.com/watch?v=Sh37jtrdLW8",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 131491,
    "likes": 3300,
    "comments_count": 236,
    "description": "Thanks to HP for sponsoring this video! Go check out the HP EliteBook 845 G9 for yourself here! https://bit.ly/3RPv5VI\n\n🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "https://bit.ly/3RPv5VI",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- This video is sponsored by HP. (upbeat music plays) - Hey everyone, it's Justine and today we are checking out the HP EliteBook 845 G9 powered by AMD's latest Ryzen Pro 6000 Series processors. Over the past few years, we have evolved the way that we work and I was very excited. And HP reached out about taking a look at their new EliteBook 845 G9. I've covered a lot of these various HP laptops in the past. And a lot of these devices cater towards the business professionals or the enterprise market. It's starting more and more to feel like those lines are blurring between work, home and entertainment. So devices that may have once been considered for professionals can all benefit from some of those features. (upbeat music plays) So let's unbox it and see what is in here. (cardboard scrubs) (box drops) All right, what do we have here? We've got some paperwork and of course we have our laptop right here. Still absolutely love their new logo. I know it's been a while, but still it's perfection. (cord scrubs cardboard) Of course, we've got our power adapter. (Velcro separates) (cord scrubs table) There you are. (paper crinkles) Oh, I'm so excited to try this out. I love that this has a 16x10 aspect ratio. Even though this is a 14 inch display, just that different aspect ratio, I can already tell that you're gonna feel like you have so much more screen real estate. Let's plug it in. Get it all set up. (upbeat music) - And here it is, the EliteBook 845 G9, which has an AMD Ryzen Pro 6000 Series processor. Battery life is something that is very important for me when I'm looking for devices to purchase. And this offers up to 26 hours on the 16 inch version. This is the 14 inch, so you'll get up to 18 hours of battery. Of course that'll vary depending on what you're doing, but that's still pretty impressive. This is a 14 inch display with a 16x10 aspect ratio. Which will give you more vertical access. So that means less scrolling than on a traditional 16x9 display. You never realize how much of a difference that makes until you're using it for a while and then you go back to a 16x9 display. This also means a larger track pad. Which is really nice when working unplugged all day long. One of the real treats for me using this is all of the ports that it has available. On this side you've got two USBC, a USBA and an HDMI. You can also spec this out with an option to have a smart card reader that would be located right here. On the other side, we have a 3.5 millimeter headphone jack, USBA and an optional external sim card slot. As someone who is always using so many different types of USB devices, I can say that I've enjoyed having two USBA ports as an option. Security is something that we should care more about. When it comes to businesses, it's a top priority. So this has HPs always on security called Wolf Security for Business. It creates a hardware enforced, always on, multi-layered security below, in, and above the OS to protect your PC from threats. Couple that with AMD Pro Security features like AMD Memory Guard. And you have a PC that helps protect your most sensitive professional and personal data. Now that we're starting to head out of the house again and either back to work or a coffee shop or traveling, this has the option of adding 4G LTE built in. So you won't have to worry about searching for a wifi connection if you're out. But it does also have WiFi 60 and Bluetooth 5.2 For conference calls or online classes, there's a 5 megapixel camera with HP Auto Frame powered by HP Presence. And this can be customized in the settings in the My HP app. - Yeah, I just ate a really good dinner. Actually it's more like a lunch, but it's so loud here. Like there's some music bumping. Can you hear that? - Not really. Like I can hear there might be music but I don't really hear it now. - Hmm, interesting. Cause there's the new voice isolation. So when I talk, do you hear the music or do you not? Like what's the, what's it like? - No, I mean like I hear your voice. (upbeat music plays) - The speakers are also pretty good with Bang & Olufsen audio. Which goes great with watching YouTube videos, movies, gaming. I mean working. Watching work presentations and work email. And homework, right? Right. I also really love this feature. It's HP's AI based Voice Cancellation 2.0. This allows your voice to be way more isolated when you're talking in busy locations like a coffee shop. It'll drown out the background and your voice will be way more present for the person on the other end. (upbeat music) I also appreciate the fast charging on this. You'll be able to get a 50% charge in just 30 minutes. It happens way more often than I'd like to admit that I forget to charge my computer before I have to leave. So usually about a half hour before I'll finally remember that I didn't charge my computer last night. So that fast charge is definitely a nice touch. You're able to get this HP EliteBook in various configurations. Like I mentioned earlier, this is the 14 inch but there's also a 13.3 inch and a 16 inch variation. Each one has different Ryzen processor options and RAM. For the 14 inch model, you're able to configure up to 64 gigabytes of upgradable DDR5 RAM. And can choose between a 38 or 51 watt hour battery. Obviously, changing things will make a big difference in performance and pricing. So deciding what is most important to you is always a good thing to keep in mind. (bird chirps) (techno music plays) - They have Bang & Olufsen speakers, so using that audio system, it's delivering a pretty loud sound. I will say the bass is not as prominent but as far as the sound quality, it sounds really good and it's also very loud, which I love. Because I love editing without headphones if I don't have to. So just knowing that I'll be able to get that audio not only while I'm editing or working but for conference calls, listening to music, or you know just watching my own YouTube videos. (Justine laughs) (upbeat music, drums) (birds chirp) - Look, look, look. Hey little friend. Hi. Should I make a PowerPoint about squirrels? I could do that. I like that this has a taller aspect ratio, so it is 16x10 as opposed to 16x9, which is what most displays are. It also has a matte finish on it which I love for working outside. I almost always take all my conference calls. I do a lot of my emails. Almost as much as I possibly can, I take my laptops outside, so to have a device that does not have a reflective screen is seriously the best thing ever. See the sun just glares down on your laptop and it reflects back at you. There's reflections, and with this I just see my screen I don't see a lot of reflections. So definitely have been loving that. - Well, I had a really fun time checking out this HP EliteBook 845 G9. This was again, the 14 inch model and this does come in a bunch of other configurations. If you guys wanna see the full lineup that they have available, I'll put a link in the description where you can check that out. Again, huge thank you to HP for partnering with me on this video. Don't forget to subscribe, if you haven't already, to my channel. And be sure to hit the bell so to be notified when I post new videos. I look forward to seeing you guys in my next one. Bye. (calm outro music plays)",
    "transcript_keywords": [
        "inch",
        "AMD Ryzen Pro",
        "AMD Pro Security",
        "Ryzen Pro",
        "aspect ratio",
        "AMD latest Ryzen",
        "AMD",
        "love",
        "Security",
        "latest Ryzen Pro",
        "EliteBook",
        "voice",
        "work",
        "inch display",
        "hear",
        "Justine and today",
        "Pro",
        "Ryzen",
        "ratio",
        "AMD Pro"
    ],
    "transcript_entities": [
        [
            "14 inch",
            "QUANTITY"
        ],
        [
            "Wolf Security for Business",
            "ORG"
        ],
        [
            "Velcro",
            "ORG"
        ],
        [
            "5 megapixel",
            "QUANTITY"
        ],
        [
            "13.3 inch",
            "QUANTITY"
        ],
        [
            "PowerPoint",
            "PRODUCT"
        ],
        [
            "up to 26 hours",
            "TIME"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "USBA",
            "ORG"
        ],
        [
            "AMD Pro Security",
            "ORG"
        ],
        [
            "HP",
            "ORG"
        ],
        [
            "LTE",
            "ORG"
        ],
        [
            "4",
            "CARDINAL"
        ],
        [
            "38",
            "CARDINAL"
        ],
        [
            "USBC",
            "ORG"
        ],
        [
            "64 gigabytes",
            "QUANTITY"
        ],
        [
            "Ryzen Pro",
            "PERSON"
        ],
        [
            "EliteBook 845 G9",
            "PRODUCT"
        ],
        [
            "16x9",
            "ORG"
        ],
        [
            "16x10",
            "CARDINAL"
        ],
        [
            "AMD",
            "ORG"
        ],
        [
            "jack",
            "PERSON"
        ],
        [
            "DDR5 RAM",
            "PERSON"
        ],
        [
            "about a half hour",
            "TIME"
        ],
        [
            "EliteBook",
            "ORG"
        ],
        [
            "51 watt hour",
            "TIME"
        ],
        [
            "Bang & Olufsen",
            "ORG"
        ],
        [
            "RAM",
            "ORG"
        ],
        [
            "16 inch",
            "QUANTITY"
        ],
        [
            "up to 18 hours",
            "TIME"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "the past few years",
            "DATE"
        ],
        [
            "HP Presence",
            "ORG"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "16x9",
            "PRODUCT"
        ],
        [
            "YouTube",
            "PERSON"
        ],
        [
            "Ryzen",
            "NORP"
        ],
        [
            "AI",
            "ORG"
        ],
        [
            "50%",
            "PERCENT"
        ],
        [
            "3.5 millimeter",
            "QUANTITY"
        ],
        [
            "845 G9",
            "CARDINAL"
        ],
        [
            "last night",
            "TIME"
        ],
        [
            "HP Auto Frame",
            "ORG"
        ],
        [
            "just 30 minutes",
            "TIME"
        ],
        [
            "EliteBook",
            "PRODUCT"
        ],
        [
            "USB",
            "ORG"
        ],
        [
            "AMD Memory Guard",
            "ORG"
        ],
        [
            "Voice Cancellation 2.0",
            "ORG"
        ],
        [
            "One",
            "CARDINAL"
        ]
    ]
}