{
    "video_id": "ttV-8lI_AZw",
    "title": "Top iOS 12 Features",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-06-06T14:11:29Z",
    "video_url": "https://www.youtube.com/watch?v=ttV-8lI_AZw",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iOS 12 Features",
        "ios 12",
        "beta",
        "developer",
        "WWDC",
        "wwdc 2018",
        "iphone x",
        "iphone",
        "ijustine review",
        "ijustine wwdc"
    ],
    "views": 1502666,
    "likes": 33840,
    "comments_count": 2169,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "[Justine]- Hey guys, it's Justine and oh my goodness I had so much fun at WWDC and not only did I have a really great time at the event but I had a lot of fun meeting so many of you guys. I posted several videos if you guys haven't checked those out. I went to two Apple stores in Cupertino, I went to the One Infinite Loop store and I went to the visitors center. I posted a video using the emoji and I also posted another video, it was just a vlog of my sister kind of following me round WWDC so it was kind of like you guys were there with me. At the Apple store I bought this leather iPhone case. It's beautiful, it's kind of like a salmon color. I've never had a leather iphone case before, this is my first one. So I kind of had to give in cause this case was right next to an electric blue color which was my sisters favorite color. And the salmon is my favorite color, so I got us matching cases and I got us Apple watch bands to match. It was kind of like my gift for saying Jenna, thank you for filming for me all day. Let's take a look and see -- Oh wow, this looks really good. I think I'm gonna have to get my nails painted that color. I'll think about it, I thought about it. I'll do it. I also got this Apple watch band, it's very nice. But watch oS 5, really, really excited about it. The walkie talkie feature is going to be so fun. I'm probably gonna annoy the heck out of my sister. Any probably annoy any other friends that give me access to be able to walkie talkie them on my watch. So I install the iOs 12 beta and I am loving it so far. It's crazy how stable it is cause usually like the first iteration of an iOs is not very stable. So far its been awesome. One of the things that has already made my life so much better is group notifications. So as you an see here my sister just texted me several times. Okay, well it needs to be unlocked. That is my face. So when you press and click into it you can see the messages that you received. Hey Justine, hello What do you think we'll get for dinner tomorrow? Spageht? (laughs) We're obsessed with spaghetti. So when you click on those three dots this will bring up this little tab here This will let you adjust your notifications accordingly. Deliver quietly, turn it off, or you can go in to get more settings. So a lot of the complaints and issues that we all had in iOs 7, a lot of those are now officially being resolved in iOs 12. Of course again, this is still in beta so it won't be out until the fall for everyone. Obviously ne of the highlights is the Memoji. It's so silly but they're so much fun. Maybe soup, Jenna is still sending me messages even though I told her I was making a video. So I made this Memoji a little bit ago, my other one that I made at WWDC had curly hair but now I'm back to my straight hair again. Hey Jenna how's it going, I love spaghetti I also love souuuup, souuuup. I'll be like licking the soup out of the bowl. Cause now there's tongue detection. That was one of the funniest things whenever they announced the feature of tongue detection. It sounds really, really silly but I'll tell you what, you guys are not gonna tell me that there has not been many many times that you have used Animojis and you've stuck your tongue out and nothing has happened. So it kind of only is a natural progression. So I approve of it. So there's a few new Animojis, we have the tiger. Hello, I'm a Tiger. Then there's the Koala Bear. Look how cute! Oh I love the Koala, I think Jenna will like this. Hey Jenna, I'm a Koala! Oh my God, the Koala has a tongue too. This is so weird. T-Rex, um, hey Jenna when are we gonna go see Jurrasic World. Did you know that the park is gone? Boo, spooky! I'm gonna be so annoying. No friends will be safe in iOs 12. One of the things that has already slightly been driving me crazy is usually when you click on the camera app, it'll give you the option to go into your camera library. But instead you have to click on the little photo icon right there and that'll bring up your photos, so it's fine but not an ideal situation. So here is I showed you guys this in the other video I did about the Memoji but I'm gonna show you guys again. This is my Ani-- Wow, why does my head look so big? This is so silly, okay let's take a picture. Okay how do I look? Oh, I look just, basic. Oh I'm making a video, oops! Okay, I'm making a video. This is me, this is still all new to me because I just, Okay well, woops! Oh my God, this is me without the Animoji on my head, oh my God. I don't wanna see it, I don't wanna see it, I'm embarrassed. So you can add things. Let's see, what's this? Oh look at that, and it's great because you can just like pin them places too, so it's kind of like Snapchat. I'll pin that there, Wow! It's pretty accurate. Let's put an arrow, this is one of my favorite stickers, it's so stupid. It's called Poop Troop. They're just, they're little pooping stickers. I don't know, I have a problem. But of course if you don't have the iJustine stickers. Look at that, there's me! I'm sticking myself all over the place. Of course there's a poop, a coffee. Well I guess I'll take a picture of myself now. What have I done? So here is my screen time, this is out of five hours and 44 minutes. Wait a minute, no, that's how much I've used my phone. I thought that was just out of the past five hours. That's how much I've used my phone. So I've been in messages for an hour and 19 minutes. I've been social networking for 35 minutes. I've been on Twitter for 29 minutes, and other for an hour and 54 minutes. So let's go and look in here. Messages, social networking, what is the productivity? Oh, the Insta360 One, I'm doing a video on that. I've picked up my phone 12 times per hour. 277 pickups, if you guys can see here there's a little right there, I took a nap. So that's why there's no activity. So here's the notification, there's around 14 per hour. 208 messages, youtube tips, interesting. There is all very interesting. Yeah, that's when I took my nap, from five to six. That's why there was no activity. I installed this around noon today. So after a week I would love to give you guys an update just to see what my usage is actually like. Today was kind of like a weird day, I've been shooting a lot of videos, and kind of running around doing a lot of stuff so I haven't really been on my phone as much as I normally think I would. So that's definitely something that's going to be terrifying to see how much time you really are spending on your devices. So another huge iOs 12 update is stability and speed. Says its up to 75% faster camera swipe, 50% faster keyboard display and up to 2x faster app launch under heavy workload. You can also FaceTime up to 32 people which I don't think that I have 32 people that have iOs 12 beta installed so we're gonna have to try that another time. They've also updated photos so there is supposedly like a better search suggestion I really only search my photos, for photos of dogs so if you guys didn't know that you could do that, you can. Find me photos of dogs. There are 1500 pictures of dogs on my iPhone right now. So what's great is you can search by selfies, bursts, live photos or videos. So as you can see there's 1544 photos of Dogs. Oh look, there's categories! There's dogs, hot dogs and coach dogs? What does that mean? Okay this actually has pictures of hot dogs, this is from a super old video. Why is this even on my phone? This is from July 4, 2015. Oh this is May 2, 2015. That's not a hot dog those are actually fried Oreos. But hey, nice try. Okay let's search for a pig. Oh my gosh, I have a lot of pigs. These are my favorite pigs ever, this is is Prissy Pig. This is actually a photo from March 1, 2015. These are my favorite pigs ever. Here's a pig card, here's a pig and a cat, here's a pig smiling. Let's search for Tahoe, when we went to Tahoe. So there's some pictures from Tahoe. How about Hawaii? There's Hawaii pictures. What about Pittsburgh, oh my goodness. Wow, some of these pictures are like really old. This is crazy. Did I ever tell you guys I filmed a movie? Well, here's a spoiler alert. Here's me in the movie, we filmed it December 20, 2017. It's gonna be a cool movie, I'm very excited about it. Here's some old technology that I was using in the movie. So Siri shortcuts is also something that I'm really interested in. So you can make specific recipes for things that you wanna do. So if I tell Siri, hey, I'm on my way home, I can see up a shortcut to text my sister, have my lights turned on, change the temperature. Really whatever you can get your phone to do, You can have Siri do that for you. I haven't really had a chance to mess with shortcuts yet so I can't really speak too much on it. But as I play with i0s 12 a little bit more, I'm sure I will talk more about that in a future video. Let me know what you guys think of iOs 12. Have you installed it yet? I feel like so many of you guys keep asking how you get access to these betas to download on your phone If you have an Apple developer account you can download different profiles on your phone so that allows you to download beta software. So it's not something that is easily accessible for everyone. I don't have the watch oS 5 beta installed but I did go to yoga today and I even forgot my watch. So I was like even if I wanted to track it I wouldn't have even been able to. I'm excited about all of the new gym kit features. You can track yoga, hiking, but mostly, man, walkie talkie is gonna be fun. Well thank you guys for watching, I'll see you in my next video, bye bye!",
    "transcript_keywords": [
        "guys",
        "kind",
        "video",
        "Infinite Loop store",
        "Apple",
        "Jenna",
        "dogs",
        "Hey Jenna",
        "Apple watch",
        "iOs",
        "phone",
        "photos",
        "Hey",
        "watch",
        "WWDC",
        "Infinite Loop",
        "lot",
        "color",
        "pig",
        "Koala"
    ],
    "transcript_entities": [
        [
            "around 14 per hour",
            "TIME"
        ],
        [
            "all day",
            "DATE"
        ],
        [
            "WWDC",
            "EVENT"
        ],
        [
            "a minute",
            "TIME"
        ],
        [
            "35 minutes",
            "TIME"
        ],
        [
            "12",
            "CARDINAL"
        ],
        [
            "five hours and 44 minutes",
            "TIME"
        ],
        [
            "an hour and 54 minutes",
            "TIME"
        ],
        [
            "Animoji",
            "PERSON"
        ],
        [
            "a week",
            "DATE"
        ],
        [
            "iJustine",
            "PRODUCT"
        ],
        [
            "July 4, 2015",
            "DATE"
        ],
        [
            "the past five hours",
            "TIME"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "the Koala Bear",
            "GPE"
        ],
        [
            "Memoji",
            "PERSON"
        ],
        [
            "32",
            "CARDINAL"
        ],
        [
            "Hawaii",
            "GPE"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "Today",
            "DATE"
        ],
        [
            "walkie talkie",
            "PERSON"
        ],
        [
            "three",
            "CARDINAL"
        ],
        [
            "up to 2x",
            "CARDINAL"
        ],
        [
            "Cupertino",
            "GPE"
        ],
        [
            "Infinite Loop",
            "ORG"
        ],
        [
            "Twitter",
            "ORG"
        ],
        [
            "5",
            "CARDINAL"
        ],
        [
            "T-Rex",
            "PERSON"
        ],
        [
            "Poop Troop",
            "ORG"
        ],
        [
            "Tahoe",
            "LOC"
        ],
        [
            "Spageht",
            "PERSON"
        ],
        [
            "Koala",
            "PERSON"
        ],
        [
            "Siri",
            "PERSON"
        ],
        [
            "29 minutes",
            "TIME"
        ],
        [
            "277",
            "CARDINAL"
        ],
        [
            "Oreos",
            "PRODUCT"
        ],
        [
            "five to six",
            "CARDINAL"
        ],
        [
            "May 2, 2015",
            "DATE"
        ],
        [
            "Tahoe",
            "GPE"
        ],
        [
            "this around noon",
            "TIME"
        ],
        [
            "Boo",
            "PERSON"
        ],
        [
            "Pittsburgh",
            "GPE"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "Snapchat",
            "PERSON"
        ],
        [
            "iOs 7",
            "EVENT"
        ],
        [
            "208",
            "CARDINAL"
        ],
        [
            "March 1, 2015",
            "DATE"
        ],
        [
            "up to 75%",
            "PERCENT"
        ],
        [
            "50%",
            "PERCENT"
        ],
        [
            "an hour and 19 minutes",
            "TIME"
        ],
        [
            "FaceTime",
            "PRODUCT"
        ],
        [
            "Jurrasic World",
            "EVENT"
        ],
        [
            "December 20, 2017",
            "DATE"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "tomorrow",
            "DATE"
        ],
        [
            "1500",
            "CARDINAL"
        ],
        [
            "1544",
            "CARDINAL"
        ],
        [
            "Justine]-",
            "NORP"
        ],
        [
            "Jenna",
            "PERSON"
        ],
        [
            "One",
            "CARDINAL"
        ]
    ]
}