{
    "video_id": "tWIPhopGaHs",
    "title": "My NEW M1 Max Macbook Pro Accessories!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-11-24T21:13:13Z",
    "video_url": "https://www.youtube.com/watch?v=tWIPhopGaHs",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "macbook pro accessories",
        "new macbook pro",
        "apple macbook pro",
        "Logitech MX Keys Mini",
        "iJustine Apple",
        "iJustine Macbook"
    ],
    "views": 279299,
    "likes": 9604,
    "comments_count": 459,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and as you know, I have got my new MacBook and I'm so excited about it, but of course, we're gonna need to get some accessories to really trick this thing out. So, a huge thank you to Logitech for sponsoring a portion of this video. We have got a new keyboard to check out and why I'm so excited about this is not only will it work with my Mac, but it will also work with my iPad. This is the MX Keys Mini for Mac, this is the master series by Logitech, they also sent me a mouse to go with this and not only did they send this silver slash white version, they also sent me a pink one. Great, so here's the keyboard and the MX Anywhere 3 mouse for MAC and of course, look at this, the pink looks so good. Look this. Step one, turn it on, connect to Bluetooth and download the MX setup software. This is cool, you can set up some easy switch so I can connect it to my computer or my phone or a tablet. Mastered for Mac, okay, so the first thing that I notice is there's an emoji button, that is very, very important. So then charging cable, USB-C. Oh, look at you. The thing that I'm excited about this is I am actually gonna be traveling for the holidays, so I always like to bring a keyboard and a mouse home to my family's house, so this is gonna be great to just put right in my backpack. Oh, that's nice, look at that, love it! Another USB-C cable. Okay, let's check out this pink one. What's great about this one is this one is either Mac or PC so they have keys to correspond with either keyboard layout. Look at this one, oh, it's pink and beautiful. So this keyboard layout isn't specific to Mac, it actually has the option and start key and the command and alt right here, so this can also be used for your PC, which is where I think I'm gonna put this one actually. Oh, it's a nice type. We've also got the matching mouse, oh, there it is. This one has a little Bluetooth accessory that you would plug into your computer, so I really like this keyboard so far, which is because it does have a very compact nature and I like these kind of concaved keys 'cause it fits right at my fingertips. I also like that it has the emoji button, we've also got the mic mute and dictation button, let's turn this on. Oh, it's also back lit. I don't know if you guys can see it 'cause it's very bright in the studio but I love the backlit keys. Now that it's unboxed, let's go get this hooked up in my office, and as a note, I just started setting up my office, this is kind of a very temporary setup, it is extremely functional, but this cable management is an absolute disgrace. (gentle music) Everything is all connected to Bluetooth and here we are, I like that this has a scroll wheel on it and it also has some customizable side buttons, which is very nice. Let's do a nice little keyboard typing test. Okay, so my typing test went very well, I love the feeling of this keyboard so far. Lemme do a quick little editing test and see what it's like to edit with this mouse. I do edit a lot with keyboard shortcuts, so that's gonna be very, very important for me. Nice, nice, all right. The typing and editing test, two thumbs up. I also like that it has a dedicated do not disturb button like that is definitely key, notifications, don't wanna see 'em, very excited about my new addition to the office. You guys wanna check out this keyboard and the mouse, I will put a link in the description where you guys can get more information or purchase one. Thank you again to Logitech for sponsoring a portion of the video. So let's talk about the rest of my Mac accessories. Now everything is being powered by the new MacBook pro 16 inch and this thing is so incredible, I absolutely love it. These Pro Display XDRs are hooked directly into the MacBook but what's really powering everything is this OWC Thunderbolt Dock. Now why I love this is I don't need to plug in this computer. Like it is not only powering laptop, but it's also connecting all of my accessories. I have four different drives that are actually connected to this Thunderbolt dock. Now I love this 'cause it also has an audio output, it does have an SD card slot and it has various Thunderbolt and USB ports that I can have access to. It's really nice just having this one central hub that everything goes through. Speaking of things that are plugged into the hub, this is one of my favorite travel drives, this is the Envoy Pro EX and this is a Thunderbolt 3 drive, I have edited so many things off of this, I always put all of my footage on here when I'm on the go because this is actually four terabytes so I can fit a ton of content on here. Also plugged into this Thunderbolt dock are two different ThunderBlade drives. Now these drives are actually RAID drives so I have one that is an eight terabyte RAID and the other is a 16 terabyte RAID and I have edited 8K content off of this directly on those drives and these are actually Daisy chain to each other, so while they are plugged into the Thunderbolt dock, they're actually plugged into each other and then they're connecting to my computer. Now the main sort of storage solution that I've been using right now is this. This is the ThunderBay Flex and this is what I've been actually using to store all of my completed projects and all of my archived footage, this actually has 75 terabytes of usable storage, so I have plenty of space for past projects. I've got my coffee cup, which I'm actually drinking some sort of like weird powdered greens that are supposed to be healthy, but man, is it tastes rotten. Moving on, this is the Elgato Wave:3 microphone, I used to use this for gaming all the time, but I love it because it's USB-C and it has some on microphone controls, looks like it might have a little food on there too, but that's the kinda person I am. When I'm not using speakers, I do like to always test my audio on my videos on headphones, so these are the AirPods Max, which I love. We also have one of the Logitech Brio webcams, I used to use this all the time for live streaming, but I did move it over here and connected it to the MacBook since I don't have a webcam built into the Pro Display XDRs so this is perfect for conference calls. So that's really kind of the whole setup. This is basically what I use and if I'm not connected here, I've really been loving just being able to unplug everything and take this MacBook with me. I do also have one of the Sony CFexpress card readers, so that's just also connected to the dock and I know those exciting feature in the new MacBook was having a built-in SD card, but I don't really ever use SD cards anymore. It's like a stab, like right there, it's like, oh yeah, great, thanks now, now you put it back, what about the last six years? Well, thank you guys for watching, I'm so looking forward to you guys coming along on this new journey of setting up the new studio, I have so many fun things planned, so I can't wait for you guys to see all of what we do with this incredible space. You guys haven't already, be sure to subscribe and hit the bell so you'll be notified when I post new videos and leave me some comments below if you have any suggestions for things that you think that I should do in this space, and I'll see you guys in the next video, bye. (gentle music)",
    "transcript_keywords": [
        "Mac",
        "keyboard",
        "Thunderbolt Dock",
        "guys",
        "Thunderbolt",
        "love",
        "nice",
        "Justine",
        "mouse",
        "Logitech",
        "drives",
        "MacBook",
        "Dock",
        "pro",
        "Pro Display",
        "test",
        "Keys",
        "Hey guys",
        "put",
        "OWC Thunderbolt Dock"
    ],
    "transcript_entities": [
        [
            "the last six years",
            "DATE"
        ],
        [
            "Logitech",
            "ORG"
        ],
        [
            "the ThunderBay Flex",
            "ORG"
        ],
        [
            "Thunderbolt",
            "PRODUCT"
        ],
        [
            "MacBook",
            "FAC"
        ],
        [
            "ThunderBlade",
            "ORG"
        ],
        [
            "iPad",
            "ORG"
        ],
        [
            "MacBook pro 16 inch",
            "PRODUCT"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "USB-C",
            "ORG"
        ],
        [
            "USB-C. Oh",
            "ORG"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "Sony",
            "ORG"
        ],
        [
            "Mac",
            "PERSON"
        ],
        [
            "MX",
            "PRODUCT"
        ],
        [
            "a ton",
            "QUANTITY"
        ],
        [
            "eight terabyte",
            "QUANTITY"
        ],
        [
            "SD",
            "GPE"
        ],
        [
            "four",
            "CARDINAL"
        ],
        [
            "75 terabytes",
            "CARDINAL"
        ],
        [
            "8",
            "CARDINAL"
        ],
        [
            "Elgato Wave:3",
            "PRODUCT"
        ],
        [
            "the holidays",
            "DATE"
        ],
        [
            "emoji",
            "PRODUCT"
        ],
        [
            "3",
            "CARDINAL"
        ],
        [
            "OWC Thunderbolt Dock",
            "PRODUCT"
        ],
        [
            "SD",
            "ORG"
        ],
        [
            "Daisy",
            "PERSON"
        ],
        [
            "Thunderbolt",
            "ORG"
        ],
        [
            "16 terabyte",
            "QUANTITY"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "the AirPods Max",
            "PRODUCT"
        ],
        [
            "four terabytes",
            "QUANTITY"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "CFexpress",
            "PRODUCT"
        ],
        [
            "Logitech Brio",
            "ORG"
        ],
        [
            "MAC",
            "ORG"
        ],
        [
            "Mac",
            "ORG"
        ],
        [
            "USB",
            "ORG"
        ]
    ]
}