{
    "video_id": "YE2zsF9P47Y",
    "title": "New Samsung Galaxy S22+ and S22 Ultra Unboxing and First Impressions!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-02-10T03:55:42Z",
    "video_url": "https://www.youtube.com/watch?v=YE2zsF9P47Y",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 409688,
    "likes": 16160,
    "comments_count": 938,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Oh boy, what's up guys? I am so excited, because the Samsung event just ended. Well today, depending upon when you're watching this, which means, my friends, we have new devices in hand. I would say in studio, but I'm actually in my sister's basement because I'm on the East Coast right now. I am so excited about this because I obviously love testing out new phones and today we have got the Samsung Galaxy S22+ and the brand new Samsung Galaxy S22 Ultra. I'm gonna put some links in the description. If you guys want to get any of the phones, that I'm talking about today, these are affiliate links. So if you do use those, just know that you are helping me out and my channel. You might hear some stomping feet upstairs, that is the sound of a two year old just making her way around the house. So the first thing that we're gonna unbox, is the Samsung Galaxy S22+, there are two versions of this. There's the S22+, which is the larger display and the S22, which is a little bit smaller of a display. So this one we're gonna open it first because this is the gold pink color. And when I saw this during the announcement I was like, oh, beautiful! So let's see what it looks like in person. So here's the unboxing, it's very simple. Now that nothing really comes in the boxes anymore. It's like, basically like, here's the phone, good luck have fun. Oh, we do have SIM card ejector, just quite a treat. Wow, this color is really, really pretty. So like I said, there are two version of the S22, the S22 and the S22+. They both have an internal storage option of 128 and 256 gigs, both running Snapdragon 8 Gen 1, both with eight gigs of RAM. They each have three rear cameras, a 50 megapixel wide, a 12 megapixel ultra wide, a 10 megapixel telephoto with 3X optical zoom and the front facing camera is 10 megapixels. The smaller S22 has a 3,700 milliamp hour battery with a 6.1 inch display. Whereas the S22+ has a 4,500 milliamp hour battery and a 6.6 inch display. These come in the phantom black, phantom white, green, pink gold and there are some Samsung exclusive colors, graphite, cream, sky blue and violet. And I think this pink gold might be my favorite. Are we surprised? No, we're not. Since we're doing an unboxing, we might as well see what we've gotten here. We've got USB-C to USB-C cable and a lovely little piece of paper. Where's my Ultra? Where's the Ultra? How is this an unboxing with no lid? What have I done? Oh gosh. Okay, well the lid has fallen off, so no, it's not the lid, this is the bottom of the box. (laughing) So I don't know which color this one is. We're gonna find out. Oh, it's look, it's a fantom black, look at that. Okay, we gotta take the sticker off. Okay, we got a front sticker too. Ready? Front sticker, front sticker, get into it. So satisfying. It's actually so strange going from the S21 Ultra because the S21 had such a huge camera bump. Whereas this, it's just like the lenses are kinda popping up. So there's no actual bump on the S22. So you guys can see like, it's crazy cause it's like, it's not there. I think I like it. I'm not really sure. I'm kind of, I'm a little indifferent about it. Did like the camera bump, cause it really did sort of set it apart and it kinda separated from the phone. Maybe I do like this more. I'm not sure. I'll get back to you in the full review. I do like that, it's all very seamless. So it feels very, very clean. So the S22 Ultra has a, 6.8 inch Edge QHD+ Dynamic AMOLED 2X display, with a refresh rate between 1 and 120 Hertz. It has four rear cameras. There's an ultra wide, a wide, two telephoto lenses and a front facing 40 megapixel camera. It has a 5,000 milliamp battery life and there's four colors that you can choose from. There's fantom black, white, green and burgundy. They do have some online, exclusive colors. There's a graphite, a red and the sky blue that one's actually, it's pretty nice. One thing that I'm most excited to test out on this is the Nightography. So this is a new feature where of course it's using AI. I feel like the AI buzzwords, is this two words, artificial intelligence. You know what I mean. It has been tossed around so much over the past couple of years. Like what does that actually mean? Well, in this case, in the presentation they were showing how it takes a bunch of photos and then it goes in and determines which photos look the best. If there's some blurry or shaky ones those are then removed and then all of those photos are kinda merged together to make one solid still and crisp image. That's gonna be something, that is definitely high on the list to test off, test out. Who is reading this? (giggling) Which is how to power off your phone. I can't do two things at once. I don't, I just, it's impossible. Another thing that I'm excited to test out is in their portrait videography, portrait photo for video, you can now kinda shift the focus and that's gonna be kinda interesting and I feel like that's kinda rivaling the iPhone 13's Cinematic Mode. Which I'm not gonna lie to you. I don't think I've ever used since I did my review of the iPhone. Now that I'm thinking about it. They've also improved the portrait mode. They also showed this really cool demo of, I know for a fact that if any of you have ever used portrait mode. If you're holding something or it's like the example that they showed was, this girl had a straw on her drink. Then the straw goes out of focus or whatever your holding kinda goes outta focus. So with this, it's being able to detect, what should actually be in focus. Like, if you're holding something, that is a part of the image, that is a part of your body right now, that should say in focus. So I'm very excited to also test that out. I feel like there's so many small little updates that may seem kind of insignificant, but in the grand scheme of things, like these small little updates to video and photo are actually a pretty big deal. Another thing is the new S Pen. So this new S Pen is supposed to have 70% improved accuracy over the S21, which is kind of exciting because it really is so interesting, like, trying to use these pens and then having them not be as responsive as possible and I think Samsung is actually done a pretty good job with that. So I'm added to the list. Another thing that Justine is excited to try out on the new devices. So here they are both next to each other. The S22 definitely has a much more rounded kind of look, where the S22 Ultra kind of, it's a little more boxy. With this new S22 Ultra and of course the advancements in the S Pen. This has a very Note-ish feel. I mean, this basically feels like a note but it's not a note, but it might as well be a note. Like what is a note? I don't even know anymore (laughing). If you guys haven't already be sure to subscribe because I'm gonna be doing a follow up review on both of these devices. They may be in one single video. They may be in separate videos. Let me know what you guys would prefer. And if you're interested in getting any of these devices, again, I put some affiliate links in the description below. So be sure to go check those out. If you are looking to get one of these devices and with that, my friends, I will see you in the next video. (upbeat music) Samsung Galaxy-- - [Jessy] (babbling) Galaxy. - S22 Ultra. - [Jessy] (babbling) Ultra. - Do you wanna show them the other phone? Look, hold it up in the air. - [Jessy] Yes, please. - That's Jessy's, hold up, show 'em. There you go, nice, nice. Good job, keep holding it up. There you go. - [Jessy] So nice. - [woman] Yeah, now it's Jessy's. - That's nice, keep holding it up. You gotta show it to 'em. Okay.",
    "transcript_keywords": [
        "Samsung Galaxy",
        "Samsung Galaxy Galaxy",
        "Ultra",
        "kind",
        "Samsung",
        "Galaxy",
        "Galaxy Galaxy",
        "excited",
        "ultra wide",
        "thing",
        "display",
        "front",
        "guys",
        "test",
        "nice",
        "holding",
        "East Coast",
        "devices",
        "focus",
        "Ultra kind"
    ],
    "transcript_entities": [
        [
            "between 1",
            "CARDINAL"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "USB-C",
            "ORG"
        ],
        [
            "S21",
            "ORG"
        ],
        [
            "S Pen",
            "EVENT"
        ],
        [
            "10 megapixels",
            "QUANTITY"
        ],
        [
            "Ultra",
            "PERSON"
        ],
        [
            "the S22 Ultra",
            "ORG"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "256",
            "CARDINAL"
        ],
        [
            "6.6 inch",
            "QUANTITY"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "three",
            "CARDINAL"
        ],
        [
            "the past couple of years",
            "DATE"
        ],
        [
            "6.8 inch",
            "QUANTITY"
        ],
        [
            "the S21 Ultra",
            "ORG"
        ],
        [
            "6.1 inch",
            "QUANTITY"
        ],
        [
            "Snapdragon 8 Gen 1",
            "LAW"
        ],
        [
            "Samsung",
            "ORG"
        ],
        [
            "four",
            "CARDINAL"
        ],
        [
            "Hertz",
            "GPE"
        ],
        [
            "Nightography",
            "LOC"
        ],
        [
            "the East Coast",
            "LOC"
        ],
        [
            "RAM",
            "ORG"
        ],
        [
            "3X",
            "CARDINAL"
        ],
        [
            "12 megapixel",
            "QUANTITY"
        ],
        [
            "3,700 milliamp hour",
            "QUANTITY"
        ],
        [
            "10 megapixel",
            "QUANTITY"
        ],
        [
            "40 megapixel",
            "QUANTITY"
        ],
        [
            "eight",
            "CARDINAL"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "128",
            "CARDINAL"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "the S Pen",
            "LOC"
        ],
        [
            "50 megapixel",
            "QUANTITY"
        ],
        [
            "two year old",
            "DATE"
        ],
        [
            "AI",
            "ORG"
        ],
        [
            "4,500 milliamp hour",
            "QUANTITY"
        ],
        [
            "5,000 milliamp",
            "QUANTITY"
        ],
        [
            "Cinematic Mode",
            "EVENT"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "120",
            "CARDINAL"
        ],
        [
            "Samsung Galaxy S22 Ultra",
            "ORG"
        ],
        [
            "Jessy",
            "PERSON"
        ],
        [
            "70%",
            "PERCENT"
        ],
        [
            "One",
            "CARDINAL"
        ]
    ]
}