{
    "video_id": "zseDc1_xSSM",
    "title": "Samsung Galaxy S9+ Unboxing!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-03-22T13:39:46Z",
    "video_url": "https://www.youtube.com/watch?v=zseDc1_xSSM",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "s9+ unboxing",
        "knife",
        "pink knife",
        "justine ezarik",
        "samsung galaxy s9",
        "samsung galaxy s9+",
        "samsung",
        "note 8",
        "galaxy 8"
    ],
    "views": 2559967,
    "likes": 48567,
    "comments_count": 4120,
    "description": "🔔 PLEASE SUBSCRIBE: http://www.youtube.com/subscription_center?add_user=ijustine\n💕GET MY PINK iJUSTINE CABLES HERE: https://geni.us/wnIN\n\n🎥GET MY EDITING PLUGIN:  https://mvfx.co/mKeynote-with-iJustine\n🎶 MUSIC I USE - http://share.epidemicsound.com/NNNGs\n\n✅FRIEND ME HERE:\nhttp://twitter.com/ijustine\nhttp://instagram.com/ijustine\nhttp://facebook.com/ijustine\nhttps://tiktok.com/@ijustine\nhttps://snapchat.com/add/ijustine\n\n🐷 MY NEW PROJECT: http://twitter.com/jpig\n🎤 PODCAST: http://youtube.com/samebrain\n\n———\n\n\n🎥 WHAT I USE TO MAKE VIDEOS 📷 \n\nCAMERAS:\nSony a7 IV - https://geni.us/U70407\nSony a1 -  https://amzn.to/3jScz3h\nSony a7s III - https://geni.us/mAtruYL \nInsta 360 ONE X3 - https://geni.us/2mPGn\nInsta 360 ONE RS - https://geni.us/8kJHun\nInsta 360 GO2 - https://geni.us/cZGA6ST\n\nLENSES:\nNew Sony GM 24-70mm ii - https://geni.us/liSjf\nOlder Sony GM 24-70mm - https://amzn.to/3DWqJau\nNew Sony Sony 20-70mm - https://geni.us/irEgHq\nSony GM 16-35mm - https://geni.us/vwolf\nSony GM 50mm - https://geni.us/gxDS\nSony GM 135mm - https://geni.us/R46usnU\nSony GM 85mm - https://geni.us/diFZAJ\n\nAUDIO: \nSennheiser AVX Digital Wireless - https://geni.us/eaUR\nSony XLR Adapter - https://geni.us/TfEu\nSony Hot Shoe Shotgun - https://geni.us/eqim0\nTiny Sony Microphone - https://geni.us/hjmjD\nDJI Mics - https://geni.us/pxN9Vw6\nRode Podcaster Pro II - https://geni.us/OmAta4o\nPodcaster Mic - https://geni.us/6KKHkB\nElgato Wave 3 Mic - https://geni.us/DXX7\n\nDRONES:\nDJI Mavic 3 - https://geni.us/RU6m\nDJI Mini 3 - https://geni.us/Ga4H\nDJI Air 2S - https://geni.us/RaBW61\n\nLIGHTING:\nAputure 600d Pro - https://geni.us/uKRvYQ\nAputure Light Dome II - https://geni.us/M1MUS\nAputure Amaran 200d - https://geni.us/8I5a\nAputure 35in Light Dome - https://geni.us/DOJNEo\nAputure Lantern Softbox - https://geni.us/0b4zBFR\n\nSony CF Express A 160g + Card Reader- https://geni.us/Gku22\nSony CF Express A 800g - https://geni.us/p3RtyR\n\n——— \nThese links are affiliate and by using them you’re helping out my channel! Thank you! \n——— \n\nBECOME A CHANNEL MEMBER: https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, how's it going? It's Justine and I am so excited because today I finally got my hands on the new Samsung Galaxy S9 and a huge thank you to Samsung for sending me this to review. The one that I ordered at the time of filming this video is not currently here yet. I did order the lilac color for myself. So probably by the time that I post this video, I'm already working on the review video. So stay tuned for that. If you guys aren't subscribed already, make sure you hit subscribe and I will see you in that next video. But for now, we are going to unbox the new S9. I can't wait to try this out. I'm so excited that I decided today that I would match my outfit with my knife, because why not? Pretty sure I don't even need a knife to open this but we're gonna use one anyway. So, let's get started. Wow. This knife is super sharp. My sister got me this for my birthday. Oh, look at that. Completely unnecessary of a cut. Anything else I can cut? No, I don't think so. I've got all of our paperwork. Okay, let's take it out. Fingerprint sensor front and center. Oh, I love it. This looks great. I cannot wait to test this out. So let's set this aside and let's see what else is in the box because I'm sure you haven't seen an S9 unboxing yet, so you're probably curious. Justine, I have no idea, what else could be in there? We've go our charging brick. We've got our USBC converter. We've got our USBC cable and we have our AKG headphones. In case you haven't seen these before, but you probably saw them in my no date 'em boxing and everybody else who has posted one. The midnight black does look really good. I cannot wait to see the lilac though because, obviously, it's gonna look fantastic. The S9 is officially unboxed and I'm about to boot it up and pop in a sim card and then we can get this thing going. (upbeat pop music) It's kind of crazy going from the iPhone X because it is much bigger and I'm so used to the smaller form factor. That's a pretty significant height difference. Yeah, yeah, yeah, I agree. We're setting up intelligent scan face recognition, iris scanner, fingerprint scanner, PIN, or nothing. Set a secure screen lock, register your face and irises. I don't wanna take my contacts out but I'm probably gonna have to, so hold on. Okay, well, now I took my contacts out so I can't see anything. Well, that's it. A lot of you guys always ask what this drink is. It is Guayaki Yerba Mate. I get it at Whole Foods or you can but it by the case online. Not sponsored. I agree to turn on everything. Just let me use my phone, please. Just do what you wanna do. You basically already oh my gosh! Look at this picture of me! Okay, so now my phone is pretty much set up. Let's see, swipe screen unlock and it unlocked. Ta-da! Shop for products super slow-mo AR Emoji. This is what I've been waiting for. So right here is the option to create my emoji. Let's hit that. For best results, remove hair. Smile with your lips closed and give it a whirl. Is it gonna look like me? Is it gonna look like me? Oh my gosh, I don't know. I don't know. I'm super... What? Okay, it kinda does look like me. Oh my god, it's creeping me out. This is so weird! It actually does look like me! Oh my gosh! Okay, I can change my hair 'cause I'd like my hair to be a little bit longer. So there's different hair options here. I also think that my hair might be a little bit blonder than this picture but this actually looks like me and I'm so creeped out right now, especially when it starts smiling all weird. Oh my gosh! This is insane. It's just weird that there's not a more blonde hair color. Okay, well I guess let's pick out our outfit. Oh, so business chic. What is that? I don't wear shorts. Okay, that's something that I would probably wear. Meh meh eh ugh. What do you think I am? A fashonista? Okay, I'll wear that, I guess. That's fine. You can send emoji stickers straight from the keyboard. Oh my god, this is gonna be so silly. This is weird, guys. This is freaking weird. It sort of actually looks like me. Not quite picking up my face perfectly. So here is some of my AR emoji gifs. I know, you guys don't say it as jifs but I do and so does the person who created the gif. He pronounced it as jif. He created it. He gets to decide. Okay, I'm gonna text my sister and she's probably gonna be super creeped out by this. Hi Jenna, does this look like me at all, do you think? Do I look nice? Do I look pretty? Do I look pretty nice? I hear Matty barking in the background. So one of the things that I do like about the super slow mo is there is this little square box right in the center so it determines when something is actually happening that it should take the slow mo video. So let's try for example. (earphones rumbling) So it didn't capture the first one but here's the second drop and it captured that one. It looks pretty awesome. I'm so excited to try all this stuff out. Well guys, that's it. Thank you for watching this unboxing. I just wanted to do a quick little video showing you guys the unboxing and trying out the AR emoji 'cause I was super excited to see how realistic it looked to my real features. It was accurate enough to make me feel super uncomfortable looking at an AR version of myself that kind of appeared right before my eyes. Let me know if there's any tests you guys would like to see me try with this. Leave those in the comments below and let me know as soon as this video goes up because probably by the time I post it I'm gonna be starting on the review. I'm also very excited to test out the dual aperture in low lights so that's definitely something that I'll probably be focusing a lot on. New phone, who dis actually? New phone, who dis? I feel like people just say that and you're like you didn't really get a new phone, it's just an excuse to not talk to you. New phone, who dis? (upbeat pop music)",
    "transcript_keywords": [
        "Samsung Galaxy",
        "guys",
        "video",
        "super",
        "Pretty",
        "hair",
        "Samsung",
        "phone",
        "Hey guys",
        "Emoji",
        "weird",
        "excited",
        "gosh",
        "time",
        "review",
        "Samsung for sending",
        "knife",
        "wait",
        "Yeah",
        "set"
    ],
    "transcript_entities": [
        [
            "Matty",
            "PERSON"
        ],
        [
            "second",
            "ORDINAL"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "S9",
            "ORG"
        ],
        [
            "AR emoji gifs",
            "PRODUCT"
        ],
        [
            "Justine",
            "PERSON"
        ],
        [
            "USBC",
            "ORG"
        ],
        [
            "PIN",
            "ORG"
        ],
        [
            "midnight",
            "TIME"
        ],
        [
            "AKG",
            "ORG"
        ],
        [
            "iris scanner",
            "ORG"
        ],
        [
            "Samsung",
            "ORG"
        ],
        [
            "Samsung Galaxy S9",
            "ORG"
        ],
        [
            "Whole Foods",
            "ORG"
        ],
        [
            "Guayaki Yerba Mate",
            "PERSON"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "jifs",
            "PERSON"
        ],
        [
            "Ta-da!",
            "PERSON"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "Jenna",
            "PERSON"
        ]
    ]
}