{
    "video_id": "LO3SlqqgLIU",
    "title": "Should YOU Buy The iPhone 12?",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-10-28T06:55:08Z",
    "video_url": "https://www.youtube.com/watch?v=LO3SlqqgLIU",
    "category": "Science & Technology",
    "tags": [],
    "views": 354682,
    "likes": 16681,
    "comments_count": 1692,
    "description": "Check out Pulseway's Techathlon Tech Quiz night, featuring Linus at https://lmg.gg/pulsewaywebinar\n\nBuy iPhone 12\nOn Amazon (PAID LINK): https://geni.us/zqA4\n\nBuy iPhone 12 Pro\nOn Amazon (PAID LINK): https://geni.us/jzw67\n\nWhat are the most interesting features of the iPhone 12 - and more importantly, are they worth spending money on?\n\nLeave a reply with your requests for future episodes, or tweet them here: https://twitter.com/jmart604\n\n►GET MERCH: http://www.LTTStore.com/\n►SUPPORT US ON FLOATPLANE: https://www.floatplane.com/  \n►LTX EXPO: https://www.ltxexpo.com/   \n\nAFFILIATES & REFERRALS\n---------------------------------------------------\n►Affiliates, Sponsors & Referrals: https://lmg.gg/sponsors\n►Private Internet Access VPN: https://lmg.gg/pialinus2\n►MK Keyboards: https://lmg.gg/LyLtl\n►Nerd or Die Stream Overlays: https://lmg.gg/avLlO\n►NEEDforSEAT Gaming Chairs: https://lmg.gg/DJQYb\n►Displate Metal Prints: https://lmg.gg/displateltt\n►Epic Games Store (LINUSMEDIAGROUP): https://lmg.gg/kRTpY\n►Amazon Prime: https://lmg.gg/8KV1v\n►Audible Free Trial: https://lmg.gg/8242J\n►Our Gear on Amazon: https://geni.us/OhmF\n \nFOLLOW US ELSEWHERE\n---------------------------------------------------  \nTwitter: https://twitter.com/linustech\nFacebook: http://www.facebook.com/LinusTech\nInstagram: https://www.instagram.com/linustech\nTwitch: https://www.twitch.tv/linustech\n\nFOLLOW OUR OTHER CHANNELS\n---------------------------------------------------  \nLinus Tech Tips: https://lmg.gg/linustechtipsyt\nTechLinked: https://lmg.gg/techlinkedyt\nShortCircuit: https://lmg.gg/shortcircuityt\n\nLMG Clips: https://lmg.gg/lmgclipsyt\nChannel Super Fun: https://lmg.gg/channelsuperfunyt\nCarpool Critics: https://lmg.gg/carpoolcriticsyt",
    "description_links": [
        "https://lmg.gg/pulsewaywebinar",
        "https://geni.us/zqA4",
        "https://geni.us/jzw67",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- The annual September new iPhone ritual was pushed back a month this year for obvious reasons but nonetheless, all eyes were on Cupertino again for one day as the iPhone 12 lineup was revealed to the world with all the usual pomp and circumstance. Diving right in for the first time iPhones are getting 5G connectivity and with a number of Android devices already boasting it, it would have looked pretty silly for the iPhone 12 series to not have it. Apple's implementation does support millimeter wave, but only on US sold models. Then it's got support for the slower 5G standards across the board. So you should be covered regardless of what your carrier offers. Under the hood, there's a new system on chip as expected, the Apple A14 bionic. Now it doesn't bring much in the way of new features, but you do get a pretty sizeable generational performance boost and interestingly, it's the first commercially available chip that I'm aware of on the five nanometer process from TSMC, which should mean a more powerful phone without sacrificing battery life. We're also getting OLED screens up and down the stack for the first time. Even though the iPhone 11 base model was positioned as a high end smartphone compared with the rest of the market, Apple went with a more traditional LCD display, not so with the iPhone 12, who screen is not only OLED but even boasts 1200 nits of peak brightness for HDR content consumption. On the subject of HDR, the iPhone 12 also supports recording with Dolby vision, making it the first mobile phone capable of doing so. Of course, that isn't to say that it's going to be a replacement for professional grade cameras, it's just that with HDR compatible monitors and TVs becoming more common and the ability of YouTube to support HDR uploads, it could be that the iPhone is the thing that finally pushes HDR into the mainstream. It's gonna be real handy for content creators. Both the standard and wide angle cameras are getting night mode for better results when shooting in low light and the pro version of the iPhone 12 is getting LiDAR similar to what police use to give you a speeding ticket. But instead of raising your insurance rates, iPhone LiDAR will help map the surrounding environment more quickly for augmented reality applications and enable the camera to focus faster in dim conditions when taking a phone. Additionally, there's a system in the pro models that stabilizes the image sensor itself with a gyroscope, which should allow you to take sharper photos especially if you're using longer exposure times. Previously, the iPhones optical image stabilization worked by moving the lens. It's also important to note that the base iPhone 12 and the new iPhone 12 mini are pretty much the same phone with the same features with the mini just being, you guessed it, smaller. We're already used to smaller iPhones in the form of the SE models, but in this case, Apple might have changed the nomenclature to get across the message that the phones have nearly identical innards. Regardless which model you go with, MagSafe is making a return. You probably remember MagSafe chargers for Apple laptops from a few years ago where the magnetic contact mechanism would prevent damage to the computer or to your body if you tripped over it. But while a laptop MagSafe has been phased out in favor of USB-C, now it's back on the iPhone 12 series as a wireless charging mechanism, and Apple has already promised that there will be third-party MagSafe accessories as well. In less welcome news, the iPhone 12 is keeping the lightening connector dashing any hopes that we'll finally be seeing an open connector standard iPhones at least for one more year. So is all of this enough to lure you in for an upgrade or are you gonna stick with your old device? Let us know down in the comments and remember that the iPhone 12 doesn't come with a charter surging brick. So you'll have to pick one up for yourself. I wonder if an Apple produced self-driving car with optional add-on brakes, is gonna be far behind. What do you think Brandon, iCar? - [Brandon] Yeah, sure. - You know what else is too far behind? Pulseway's virtual quiz night on October 29th at 6:00 PM Eastern, it'll be full of questions, fun and memes and Linus himself, that's right, me, is gonna be co-hosting the event along with Edgar, Pulseway's director of marketing. So you can answer questions, collect points, and chat with other systems admins and IT pros. You can even win prizes including apparently swag from lttstore.com. So check out the link below to learn more. Thanks for watching guys. Like dislike, check out our other videos and leave a comment if you have a suggestion for a future fast as possible, we do love to hear from you guys.",
    "transcript_keywords": [
        "annual September",
        "iPhone",
        "Apple",
        "reasons but nonetheless",
        "pomp and circumstance",
        "ritual was pushed",
        "obvious reasons",
        "lineup was revealed",
        "usual pomp",
        "HDR",
        "iPhone ritual",
        "iPhones",
        "September",
        "Cupertino",
        "September new iPhone",
        "support HDR",
        "number of Android",
        "phone",
        "support HDR uploads",
        "time iPhones"
    ],
    "transcript_entities": [
        [
            "iPhone 11",
            "PRODUCT"
        ],
        [
            "iCar",
            "ORG"
        ],
        [
            "one more year",
            "DATE"
        ],
        [
            "Cupertino",
            "GPE"
        ],
        [
            "millimeter",
            "CARDINAL"
        ],
        [
            "a month this year",
            "DATE"
        ],
        [
            "US",
            "GPE"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "iPhone LiDAR",
            "ORG"
        ],
        [
            "October 29th",
            "DATE"
        ],
        [
            "A14",
            "PRODUCT"
        ],
        [
            "TSMC",
            "ORG"
        ],
        [
            "Dolby",
            "ORG"
        ],
        [
            "MagSafe",
            "ORG"
        ],
        [
            "a few years ago",
            "DATE"
        ],
        [
            "MagSafe",
            "PRODUCT"
        ],
        [
            "6:00 PM Eastern",
            "TIME"
        ],
        [
            "September",
            "DATE"
        ],
        [
            "third",
            "ORDINAL"
        ],
        [
            "Brandon",
            "PERSON"
        ],
        [
            "Pulseway",
            "ORG"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "iPhones",
            "NORP"
        ],
        [
            "Android",
            "ORG"
        ],
        [
            "LCD",
            "ORG"
        ],
        [
            "1200",
            "CARDINAL"
        ],
        [
            "SE",
            "PERSON"
        ],
        [
            "one day",
            "DATE"
        ],
        [
            "12",
            "CARDINAL"
        ],
        [
            "USB-C",
            "ORG"
        ],
        [
            "Linus",
            "PERSON"
        ],
        [
            "five nanometer",
            "QUANTITY"
        ],
        [
            "Edgar",
            "PERSON"
        ],
        [
            "YouTube",
            "ORG"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "5",
            "CARDINAL"
        ]
    ]
}