{
    "video_id": "xSlj7aGA38s",
    "title": "Remember American TV Brands? What happened to them??",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-05-13T17:01:34Z",
    "video_url": "https://www.youtube.com/watch?v=xSlj7aGA38s",
    "category": "Science & Technology",
    "tags": [],
    "views": 404169,
    "likes": 21009,
    "comments_count": 1291,
    "description": "Check out the Massdrop x Sennheiser HD 6XX Headphones at https://dro.ps/techquickie-may-6xx\n\nWhat happened to old TV brands like Zenith and RCA?\n\nLeave a reply with your requests for future episodes, or tweet them here: https://twitter.com/jmart604\n\nGET MERCH: http://www.LTTStore.com/\nSUPPORT US ON FLOATPLANE: https://www.floatplane.com/  \nLTX EXPO: https://www.ltxexpo.com/   \n\nAFFILIATES & REFERRALS\n---------------------------------------------------\nAffiliates, Sponsors & Referrals: https://lmg.gg/sponsors\nGet Private Internet Access VPN at https://lmg.gg/pialinus2\nGet a Displate Metal Print at https://lmg.gg/displateltt\nSupport a Creator code LINUSMEDIAGROUP on Epic Games Store: https://lmg.gg/kRTpY\nGet a 30-day free trial of Amazon Prime at https://lmg.gg/8KV1v\nOur Test Benches on Amazon: https://lmg.gg/HOx0z\nOur Production Gear: https://lmg.gg/4oPzt\n \nFOLLOW US ELSEWHERE\n---------------------------------------------------  \nTwitter: https://twitter.com/linustech\nFacebook: http://www.facebook.com/LinusTech\nInstagram: https://www.instagram.com/linustech\nTwitch: https://www.twitch.tv/linustech\n\nFOLLOW OUR OTHER CHANNELS\n---------------------------------------------------  \nLinus Tech Tips: https://lmg.gg/linustechtipsyt\nTechLinked: https://lmg.gg/techlinkedyt\nShortCircuit: https://lmg.gg/shortcircuityt\n\nLMG Clips: https://lmg.gg/lmgclipsyt\nChannel Super Fun: https://lmg.gg/channelsuperfunyt\nCarpool Critics: https://lmg.gg/carpoolcriticsyt",
    "description_links": [
        "https://dro.ps/techquickie-may-6xx",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- No matter who you are, star athlete, charismatic tech news host, or Eastern Bloc dictator, holding onto power is a difficult task. And perhaps few people realized this more than the people behind the iconic TV brands of yesteryear. There's a good chance you remember a time when iconic brands like Zenith were found in every hotel room, and store shelves were chock full of RCA TVs. But these days, they've all but vanished. So what the heck happened? A lot of major brands that we were used to seeing here in North America were domestically-based, and it's no secret that tons of manufacturing has left the United States and is now based in China. You can learn about the rise of Chinese electronics in this video, but it doesn't tell the whole story of what specifically happened to those old TV-makers. To a large extent, the U.S. TV industry became architects of their own demise. Although major American TV manufacturers once were global brands, they couldn't sell in every major market, and a very important one, Japan, had serious legal hurdles that made it tough for foreign companies to sell products there. So instead, they licensed their tech out to Japanese electronics firms, hoping to reap profits off of royalties. But instead, Japanese companies took the technology and actually improved on it! And before long, Japanese TVs entered the U.S. market and began to steamroll the American brands. In the U.S., the TV industry was viewed as mature, and the attitude among the folks in charge was, \"Hey, what we have is good enough for everybody, \"so let's just focus on marketing and cost-efficiency.\" (slot machine clinking) Cha-ching. But obviously, we're no longer watching massive tube TVs in wooden cabinets. Japanese brands believed a better strategy was to continue innovating, (chuckles) imagine that! And sure enough, they introduced models that were higher quality and more lightweight, thanks to their use of transistors instead of vacuum tubes. In fact, between 1970 and 1976, Japanese brands like Sony and Panasonic tripled their market share in the U.S., capturing nearly one-half of it! Zenith's response, however, wasn't to pour more money into development to make their own products better, but instead, to take the Japanese companies to court for supposed antitrust violations. (chuckles) (buzzer buzzing) That's one way to do it! Now, this cost a lot of money, and the litigation dragged on for over a decade, (graphics crashing) but Zenith ultimately lost anyways. (laughs) (cameraman laughing) Making matters even worse, the U.S. companies failed to see the potential of emerging TV-related technologies. For example, Sony started working on a low-cost VCR back in 1956, way before they even knew there would be a demand for it. American electronic companies at the time typically took a much more conservative approach by trying to ensure through consumer studies that there would be a market for something before they produced it, which ended up biting them, as Ford manufacturers were effectively creating new markets, and VCRs became much more widespread than the disc-based technology the American companies were working on. Now, this put even more financial pressure on American companies who didn't have as many product segments to compete in, and the dominoes, (dominoes clattering) they began fallin', baby! Zenith was bought by Korea-based LG in 1995 and no longer makes TVs, RCA only exists as a brand name now, owned by a company based here in Canada, and Magnavox is now also a minor brand owned by a Japanese company. It was taken over by a couple of entrepreneurs from Tennessee, but then went bankrupt in 2004 after China was admitted to the WTO a few years prior, and started exporting TVs en masse (graphics popping) to the United States. So the moral of the story here is that many of these brands that we used to see all the time disappeared in huge part because many of them were just standing still. Good times simply don't last if you don't do anything to innovate! In fact, we're thinking about moving Techquickie off of YouTube and just full-time onto TikTok. Maybe that'll work, you know, just gotta keep movin'! We're not doing that, that's not happening. Speaking of TikTokin', I'm gonna TikTok about our sponsor, the Massdrop HD 6XX open-backed headphones, a collaboration with Sennheiser. Over 70,000 have already been sold, and why not? They have the same great sound as the HD 650, with a few updates, a balanced midrange, and natural-sounding bass. You can use the parts with other Sennheiser headphones, and they both come with a 1/8-inch plug for everyday use and a 1/4-inch adapter for professionals! Click the link below for more information and to get yours today. All right, that's it for this video, guys! Hey, thanks for watchin'. Why don't you check out some of our other videos, 'cause there's lots, and if you have an idea for what we can talk about next on Techquickie, leave a comment below! Also, subscribe!",
    "transcript_keywords": [
        "Eastern Bloc dictator",
        "Eastern Bloc",
        "Bloc dictator",
        "star athlete",
        "holding onto power",
        "difficult task",
        "Japanese",
        "brands",
        "Japanese brands",
        "companies",
        "Japanese companies",
        "American",
        "American companies",
        "Eastern",
        "Bloc",
        "United States",
        "American electronic companies",
        "TVs",
        "Zenith",
        "charismatic tech"
    ],
    "transcript_entities": [
        [
            "Techquickie",
            "GPE"
        ],
        [
            "TikTok",
            "ORG"
        ],
        [
            "everyday",
            "DATE"
        ],
        [
            "Over 70,000",
            "CARDINAL"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "U.S.",
            "GPE"
        ],
        [
            "Panasonic",
            "ORG"
        ],
        [
            "American TV",
            "ORG"
        ],
        [
            "RCA",
            "ORG"
        ],
        [
            "Japan",
            "GPE"
        ],
        [
            "nearly one-half",
            "CARDINAL"
        ],
        [
            "Zenith",
            "PERSON"
        ],
        [
            "Korea",
            "GPE"
        ],
        [
            "over a decade",
            "DATE"
        ],
        [
            "Ford",
            "ORG"
        ],
        [
            "Tennessee",
            "GPE"
        ],
        [
            "Japanese",
            "NORP"
        ],
        [
            "Sennheiser",
            "ORG"
        ],
        [
            "American",
            "NORP"
        ],
        [
            "a few years prior",
            "DATE"
        ],
        [
            "North America",
            "LOC"
        ],
        [
            "China",
            "GPE"
        ],
        [
            "LG",
            "ORG"
        ],
        [
            "1995",
            "DATE"
        ],
        [
            "Magnavox",
            "ORG"
        ],
        [
            "2004",
            "DATE"
        ],
        [
            "TikTokin",
            "ORG"
        ],
        [
            "Chinese",
            "NORP"
        ],
        [
            "these days",
            "DATE"
        ],
        [
            "Sony",
            "ORG"
        ],
        [
            "between 1970 and 1976",
            "DATE"
        ],
        [
            "Canada",
            "GPE"
        ],
        [
            "Eastern Bloc",
            "LOC"
        ],
        [
            "the United States",
            "GPE"
        ],
        [
            "WTO",
            "ORG"
        ],
        [
            "Zenith",
            "ORG"
        ],
        [
            "YouTube",
            "ORG"
        ],
        [
            "1/4-inch",
            "QUANTITY"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "1/8-inch",
            "QUANTITY"
        ],
        [
            "1956",
            "DATE"
        ]
    ]
}