{
    "video_id": "nVnhQ3e5W_8",
    "title": "How to Play Flash After January 12 - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2021-01-12T13:00:26Z",
    "video_url": "https://www.youtube.com/watch?v=nVnhQ3e5W_8",
    "category": "Science & Technology",
    "tags": [
        "How to Play Flash Games and Animations (After EOL) - Krazy Ken's Tech Talk",
        "Adobe Flash Player",
        "Adobe Shockwave",
        "RIP Flash",
        "BlueMaxima Flashpoint",
        "Flashpoint",
        "Windows",
        "PC",
        "Microsoft",
        "Shockwave Player",
        "Computer",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Tech",
        "Computer Clan",
        "Silverlight",
        "Adobe Flash",
        "Flash Player"
    ],
    "views": 37398,
    "likes": 1616,
    "comments_count": 173,
    "description": "BlueMaxima's Flashpoint is a great way to play archived Flash games and animations, even after Flash's end-of-life date; this also works with Shockwave content, and more. Check out this quick episode for more info.\n\nDownload Flashpoint here ● https://bluemaxima.org/flashpoint/\nRIP Flash 😢 Check out the history here ● https://youtu.be/-ZFusHTXYNE\nDownload our epic wallpapers ● https://thecomputerclan.com/wallpapers\nSupport our channel and get cool stuff ● https://Patreon.com/KrazyKen\n\nSubscribe and listen to our podcast ● https://anchor.fm/computerclan\nSubscribe for more tech videos! ● http://subscribe.thecomputerclan.com\n\nFollow us on Twitter ● http://twitter.com/thecomputerclan\nLike us on Facebook ● http://facebook.com/computerclan\n\nKrazy Ken's Tech Talk - How to Play Flash After January 12\n\n⭐️ Patrons got to see this episode early (and in much higher playback quality). They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support. http://Patreon.com/KrazyKen\n\n📱Contact Us ● https://thecomputerclan.com/contact\n\n🎬Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free: https://bit.ly/clan2Dr3M3e\n\n🎵I also use Artlist for the music in my videos. I highly recommend them 👌 Click for 2 extra months free: http://bit.ly/clan2LBaKov\n\n🎥Get film gear Ken uses ● http://amzn.to/2hmJhHU\nOn a lower budget? ● http://amzn.to/2hLrJBL\n\nComputer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.\n#KrazyKen #ComputerClan",
    "description_links": [
        "https://bluemaxima.org/flashpoint/",
        "https://youtu.be/-ZFusHTXYNE",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "https://anchor.fm/computerclan",
        "http://subscribe.thecomputerclan.com",
        "http://twitter.com/thecomputerclan",
        "http://facebook.com/computerclan",
        "http://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken, and today we're gonna take a quick look at BlueMaxima's Flashpoint, which is a Windows app that allows you to play archived Flash games and animations. And it works with other multimedia platforms too, like Shockwave and Silverlight. Now this is important because now that Adobe is blocking the Flash Player plugin from running, users will have to find other ways to play this archived stuff, and there's multiple ways to do it, but the way I'm familiar with is Flashpoint. All right, let's dive in. First, go to bluemaxima.org/flashpoint and click download. There's several options here, but the two main ones are Ultimate and Infinity. I recommend using Infinity because it uses less hard drive space and the media files will only save to your computer once you first watch them on demand. Ultimate, on the other hand, doesn't require additional downloads when you launch the media files, because everything is already saved to your hard drive, but keep in mind, it's a massive download. It's 478 gigabytes. But for now, we'll stick to Infinity. Once the Infinity installer is downloaded, open the 7Z file from your downloads location, and the contents will self extract any location you choose. When the extraction is done, open the Flashpoint folder, double click on Start Flashpoint, and boom, enjoy the massive library. You can browse the categories across the top of the screen, and I recommend dragging your favorite items into the favorites list so you can access them quicker. And one more quick tip, if you need to access the source files like a SWF file, right click on any item and choose Open File Location, and the file Explorer will reveal the source file. So that's Flashpoint, go ahead and download it, the link is in the description, and thank you so much to everybody who contributed to the project and to all archival projects for Flash and Shockwave content everywhere. So go ahead and download that and have some fun. And if you wanna have a mega nostalgic time-travel trip about the history of the Adobe Flash Player, I did a separate episode on that too, and it's a lot of fun, so go ahead and check that out. And hey, if you liked this episode, you know what to do. Thanks for sticking with me Catch the crazy, pass it on. (upbeat music)",
    "transcript_keywords": [
        "Flashpoint",
        "Adobe Flash Player",
        "Flash Player",
        "Flash",
        "file",
        "Krazy Ken",
        "play archived Flash",
        "Flash Player plugin",
        "download",
        "Adobe Flash",
        "Open File Location",
        "files",
        "Start Flashpoint",
        "archived Flash games",
        "media files",
        "Hey guys",
        "open",
        "archived Flash",
        "location",
        "BlueMaxima Flashpoint"
    ],
    "transcript_entities": [
        [
            "478 gigabytes",
            "QUANTITY"
        ],
        [
            "Open File Location",
            "ORG"
        ],
        [
            "Adobe",
            "ORG"
        ],
        [
            "Ultimate",
            "ORG"
        ],
        [
            "Explorer",
            "PRODUCT"
        ],
        [
            "Flash Player",
            "ORG"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "BlueMaxima",
            "ORG"
        ],
        [
            "Silverlight",
            "PRODUCT"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "Krazy Ken",
            "PERSON"
        ],
        [
            "Shockwave",
            "PRODUCT"
        ],
        [
            "Infinity",
            "ORG"
        ],
        [
            "Flash and Shockwave",
            "ORG"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "Windows",
            "PRODUCT"
        ],
        [
            "Adobe Flash Player",
            "ORG"
        ],
        [
            "SWF",
            "ORG"
        ],
        [
            "First",
            "ORDINAL"
        ],
        [
            "Flashpoint",
            "PERSON"
        ],
        [
            "Catch",
            "PERSON"
        ]
    ]
}