{
    "video_id": "0orbL_WNcWE",
    "title": "What's in My Tech Bag 2019!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2019-04-10T04:25:25Z",
    "video_url": "https://www.youtube.com/watch?v=0orbL_WNcWE",
    "category": "Science & Technology",
    "tags": [
        "tech",
        "tech bag",
        "what's in my tech bag",
        "what's in my bag",
        "tech bag 2019",
        "2019",
        "jonathan morrison",
        "tech bag 2018",
        "tld",
        "macbook pro",
        "apple",
        "macbook pro 2019",
        "13 inch macbook pro",
        "headphones",
        "aer",
        "aer go pack",
        "best tech bag"
    ],
    "views": 269993,
    "likes": 8839,
    "comments_count": 329,
    "description": "Headed over to NAB 2019 so it's time for another What's in My Tech Bag showcase...this might be my best. Watch until to end to find out why. Love your faces! ❤️❤️❤️\n\nCheck my last What's in My Tech Bag video: https://youtu.be/I0ecbOexux8\n\nTHE BAG! Infinite heart-eye emoji's 😍: https://bit.ly/2U4dAm8\n13 Inch MacBook Pro Computational Thingy: https://amzn.to/2IoU69F\nProtective Sleeve For That Computational Thingy: https://amzn.to/2X4xjEd\nBlackmagic Studio Cinema 4K...get it: https://amzn.to/2G1qMTG\nFLEX with those AirPods 2's: https://bhpho.to/2Vy7cVP\nFocal Listen (GOAT for audiophiles): https://amzn.to/2X0StmG\nGreatest CFAST Reader Ever?!: https://bhpho.to/2GbZWcR\nMy New Favorite Portable Charger: https://amzn.to/2GaTIK8\nThis. Light. Is. Waterproof?!: https://amzn.to/2Kotvfs\nI Keep ALL THE THINGS on this: https://bhpho.to/2GbNn1l\n\nTLD BINGEFEST!\nApple AirPods 2 vs Samsung Galaxy Buds!: https://youtu.be/-dkfZuT7OCE\nTech that made my iPhone better: https://youtu.be/LrcHHyMSVtY\nThe Perfect MacBook Pro Setup: https://www.youtube.com/watch?v=fBTNg...\n\nTLD Spotify Playlist! https://open.spotify.com/user/jonathan.morrison/playlist/3wmqwmIrP6MFizjiyM7k6y?si=x_rBjHbiQp2lFmyM5Qj5SQ\n\nTLD Behind the Scenes! http://bit.ly/TLDBreakdown\nMobile users: https://www.youtube.com/channel/UCDlQ...\n\nMusic via Musicbed: http://share.mscbd.fm/tldtoday\n\nMy Audio Setup & Gear: https://youtu.be/v9hu-Avj2oE?list=PLq...",
    "description_links": [
        "https://youtu.be/I0ecbOexux8",
        "https://bit.ly/2U4dAm8",
        "https://amzn.to/2IoU69F",
        "https://amzn.to/2X4xjEd",
        "https://amzn.to/2G1qMTG",
        "https://bhpho.to/2Vy7cVP",
        "https://amzn.to/2X0StmG",
        "https://bhpho.to/2GbZWcR",
        "https://amzn.to/2GaTIK8",
        "https://amzn.to/2Kotvfs",
        "https://bhpho.to/2GbNn1l",
        "https://youtu.be/-dkfZuT7OCE",
        "https://youtu.be/LrcHHyMSVtY",
        "https://www.youtube.com/watch?v=fBTNg...",
        "https://open.spotify.com/user/jonathan.morrison/playlist/3wmqwmIrP6MFizjiyM7k6y?si=x_rBjHbiQp2lFmyM5Qj5SQ",
        "http://bit.ly/TLDBreakdown",
        "https://www.youtube.com/channel/UCDlQ...",
        "http://share.mscbd.fm/tldtoday",
        "https://youtu.be/v9hu-Avj2oE?list=PLq..."
    ],
    "transcript": "(upbeat electronic music) - Yo, guys, Jonathan here headed out to NAB 2019, which is this huge tech show for everything camera-related, and with that, I thought it'd be cool to take you along with me and showcase what's in my bag. So for the past six months or so, this has been my go-to bag. It's amazing, you can fit pretty much your entire life inside. But the problem is when you do, it weighs a ton. So I wanted to lighten things up, and that's where this comes in, the Air GO Pack. So this bag is lightweight, it looks great, and that makes it a great option to carry with you, but it also dual functions in the sense that you can actually pack it into a suitcase or a carry-on and really keep things minimal. Hands-down though, my favorite feature with this bag has gotta be the quick access compartment up front because it has this super neat magnetic lock. First and foremost, it's going to make sure that you close up and secure all your valuables inside. And secondly, there's just something really satisfying about hearing that click. (clicks) So inside there, I have my MacBook charger. Gen two AirPods. There is the dot don't judge me. My go-to monster 7.6 terabyte external SSD from Glyph, a CFast reader, this really cool battery bank, and an eighth inch audio cable that goes to these Focal headphones. I showcased these headphones a couple videos back, and for the most part I use them in conjunction with this Lightning V-MODA DAC, which is a game changer. It sounds amazing, but I also keep that eighth inch cable with me just in case I wanna use it with my MacBook Pro and edit on the go. Sound quality is phenomenal, and even though these technically aren't noise-canceling headphones, on a plane these things are incredible, which is perfect because as much as I love AirPods, even the second generation, on a plane, those things are trash. Now this battery bank is freaking amazing. One, it self charges, you just plug it into a wall. No cables needed. And two, it also packs wireless charging, which makes it perfect for the second generation AirPods. Now in the spirit of lightening things up, I usually rock a 15-inch MacBook Pro, but for the most part, I shoot everything in ProRes, not raw, final cut is super optimized, and now the fact the 13-inch MacBook Pros have a quad-core option, switching to one has been seamless. Now one trade-off with this bag is because it's so lightweight, there isn't a ton of padding or protection, so I would recommend grabbing some sort of sleeve or case with your laptop. This one in particular is from Incase. It's simple, it's minimal, but adds a ton of protection and padding. It gives you quick access, and I am definitely not the most careful person on the planet, so having that extra peace of mind makes this worth picking up. Continuing the theme of lightening things up, the main camera we shoot with is an Arri ALEXA Mini, which you absolutely cannot fit in this bag. What you can fit in this bag though is the brand new Blackmagic Pocket Cinema 4K, which is a mouthful, but it's an amazing camera. I have this paired with the Metabones Micro Four Thirds to EF adapter, so I can throw Canon glass on here. I didn't really find the need to go the speed boost option, and honestly, this has been an amazing combo. Don't get me wrong, I still love the A7 III, it's an amazing camera, but there's something just super cinematic about this camera. And honestly, for the price, if you don't care about stills, you are not gonna get a better image for the money. Now when I'm traveling I usually like to carry some sort of portable light with me. This one in particular from Aputure has a ton of features, it's waterproof, more than anything it is just a really bright, high quality LED. Aputure, if you're watching, if you're listening, we gotta talk because there needs to be some sort of official way to mount this into the Light Dome Mini II. That would be incredible. Now the main reason I'm out here in Vegas is to edit this video that you're watching right now live on stage at the LumaForge Faster Together event. If all goes to plan, this was done like an hour ago. So if you're watching, we did it, thank you guys for your support. Thanks, everyone that came out. Love your faces. This is Jonathan, and I will catch you guys later. (upbeat music)",
    "transcript_keywords": [
        "huge tech show",
        "huge tech",
        "tech show",
        "bag",
        "NAB",
        "amazing",
        "things",
        "MacBook Pro",
        "MacBook",
        "ton",
        "amazing camera",
        "camera",
        "Lightning VMODA DAC",
        "makes",
        "inside",
        "lightening things",
        "AirPods",
        "Pro",
        "Arri ALEXA Mini",
        "Jonathan here headed"
    ],
    "transcript_entities": [
        [
            "two",
            "CARDINAL"
        ],
        [
            "secondly",
            "ORDINAL"
        ],
        [
            "Focal",
            "ORG"
        ],
        [
            "MacBook",
            "PRODUCT"
        ],
        [
            "MacBook Pros",
            "ORG"
        ],
        [
            "Aputure",
            "ORG"
        ],
        [
            "One",
            "CARDINAL"
        ],
        [
            "EF",
            "ORG"
        ],
        [
            "ProRes",
            "ORG"
        ],
        [
            "15-inch",
            "QUANTITY"
        ],
        [
            "the Air GO Pack",
            "ORG"
        ],
        [
            "eighth",
            "ORDINAL"
        ],
        [
            "the Metabones Micro Four Thirds",
            "ORG"
        ],
        [
            "the Light Dome Mini II",
            "PRODUCT"
        ],
        [
            "a ton",
            "QUANTITY"
        ],
        [
            "AirPods",
            "PRODUCT"
        ],
        [
            "2019",
            "DATE"
        ],
        [
            "Vegas",
            "GPE"
        ],
        [
            "the past six months or so",
            "DATE"
        ],
        [
            "MacBook Pro",
            "PRODUCT"
        ],
        [
            "13-inch",
            "QUANTITY"
        ],
        [
            "second",
            "ORDINAL"
        ],
        [
            "First",
            "ORDINAL"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "SSD",
            "ORG"
        ],
        [
            "MacBook Pro",
            "ORG"
        ],
        [
            "7.6",
            "CARDINAL"
        ],
        [
            "Glyph",
            "ORG"
        ],
        [
            "LumaForge",
            "ORG"
        ],
        [
            "Blackmagic Pocket Cinema 4K",
            "ORG"
        ],
        [
            "Jonathan",
            "PERSON"
        ]
    ]
}