{
    "video_id": "2e_zYUpwZkw",
    "title": "Last Minute 2018 Holiday Tech Gifts!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2018-11-27T00:29:13Z",
    "video_url": "https://www.youtube.com/watch?v=2e_zYUpwZkw",
    "category": "Science & Technology",
    "tags": [
        "Cyber monday",
        "cyber monday deals",
        "cyber monday tech",
        "tech deals",
        "tech",
        "2018",
        "macbook",
        "macbook air",
        "galaxy s9",
        "apple watch",
        "apple watch series 3",
        "canon",
        "6D",
        "canon 6D",
        "alexa",
        "amazon echo",
        "smart home",
        "tech under",
        "tech gifts",
        "holiday tech guide",
        "tld",
        "jonathan morrison",
        "black friday",
        "philips hue",
        "headphones"
    ],
    "views": 257091,
    "likes": 8126,
    "comments_count": 408,
    "description": "The Mac Mini Thiccccc Boi setup: https://youtu.be/RqnovPrGxvU\nThe Black Friday tech deals kind of sucked so here are 20 last minute Cyber Monday tech deals that didn't!  \n\n***The Deals And Things I Mentioned In The Video Thingy***\nBarrel of Monkeys!!!: https://amzn.to/2Kxzvie\nThat Galaxy S9/Echo Spot DOTY: https://amzn.to/2KG2MHT\nTHANOS INFINITY GAUNTLET!: https://amzn.to/2KxDfR3\nAcer 23.8 IPS Single G Big Boy Monitor: https://amzn.to/2ztBOPc\nJENGA! JENGA! JENGA!: https://amzn.to/2TKq17L\nEcho Dots For Everyone!: https://amzn.to/2KytvGb\nPhilips Hue ALL The Things!: https://amzn.to/2Rf1ztp\nSengled Smart LED Package: https://amzn.to/2BycdGi\nWiFi We Use, The Orbi: https://amzn.to/2TOHJXM\nKingston ELITE 64GB Flash Drive: https://amzn.to/2DZGwYP\nToshiba 43-Inch FIRE TV: https://amzn.to/2DZ0UJx\nToshiba 50-Inch FIRE TV: https://amzn.to/2SgFHxW\nPolk Audio With Freaking Alexa Built In!: https://amzn.to/2DYTNRk\nIt's CRUCIAL You Get This RAM (heh): https://amzn.to/2KBzQk6\n12-Inch Macbook DEAL: https://bit.ly/2KBSvvY\nCanon T6 Crazy Deal!: https://amzn.to/2TLokXo\nCRAZIER CAMERA DEAL!!!: https://amzn.to/2zmtdxJ\nApple Watch Series 3!: https://bhpho.to/2FHkdIV\n2015 15.4 MacBook Pro: https://bhpho.to/2FFdPC9\nDJI Mavic Air FLY MORE Combo: https://bhpho.to/2FJy55t\n\n\nMONSTER iPAD REVIEW IS COMING!\nCatch up on all things iPad to prepare your mind:\nhttps://youtu.be/lqLR20jh9Qk\nhttps://youtu.be/-ZpsliNmJLo\nhttps://youtu.be/dItCj676GmA\nhttps://youtu.be/ZxvliLODkxI\n\nTLD Behind the Scenes! http://bit.ly/TLDBreakdown\nMobile users: https://www.youtube.com/channel/UCDlQwv99CovKafGvxyaiNDA/join\n\nMusic via Musicbed: http://share.mscbd.fm/tldtoday\n\nMy Audio Setup & Gear: https://youtu.be/v9hu-Avj2oE?list=PLq...\n\nInstagram: http://www.instagram.com/tldtoday",
    "description_links": [
        "https://youtu.be/RqnovPrGxvU",
        "https://amzn.to/2Kxzvie",
        "https://amzn.to/2KG2MHT",
        "https://amzn.to/2KxDfR3",
        "https://amzn.to/2ztBOPc",
        "https://amzn.to/2TKq17L",
        "https://amzn.to/2KytvGb",
        "https://amzn.to/2Rf1ztp",
        "https://amzn.to/2BycdGi",
        "https://amzn.to/2TOHJXM",
        "https://amzn.to/2DZGwYP",
        "https://amzn.to/2DZ0UJx",
        "https://amzn.to/2SgFHxW",
        "https://amzn.to/2DYTNRk",
        "https://amzn.to/2KBzQk6",
        "https://bit.ly/2KBSvvY",
        "https://amzn.to/2TLokXo",
        "https://amzn.to/2zmtdxJ",
        "https://bhpho.to/2FHkdIV",
        "https://bhpho.to/2FFdPC9",
        "https://bhpho.to/2FJy55t",
        "https://youtu.be/lqLR20jh9Qk",
        "https://youtu.be/-ZpsliNmJLo",
        "https://youtu.be/dItCj676GmA",
        "https://youtu.be/ZxvliLODkxI",
        "http://bit.ly/TLDBreakdown",
        "https://www.youtube.com/channel/UCDlQwv99CovKafGvxyaiNDA/join",
        "http://share.mscbd.fm/tldtoday",
        "https://youtu.be/v9hu-Avj2oE?list=PLq...",
        "http://www.instagram.com/tldtoday"
    ],
    "transcript": "(gentle holiday music) - Yo, guys, Jonathan here. Black Friday sucked. Cyber Monday is here, though. Things are looking up, and I'm kicking today's deal list off with potentially the greatest Cyber Monday deal of all time in human existence, Barrel Monkeys for $3.82. And that, my friends, for that price, you cannot build yourself a custom water-cooled gaming PC. From there, if you've been looking to pick up a Galaxy S9 but have been holding off for that deal, that deal of the year, this one caught my eye. You get a Galaxy S9 unlocked, but it's not stopping there. You get that, plus, an Echo Spot for $519. They are basically giving these things away. PSA, though, these deals, these prices, they will change, they will sell out faster than these fingers can eliminate existence. And what's also cool, is this Infinity Gauntlet is also on sale for Cyber Monday, link below. Link below. Not up there, down here. I don't feel so good. So next, for those that caught the Mac mini setup, again, one of the best things about the Mac mini is the fact that you can build it out any way you want and at your pace. So maybe, you're not about that thicc life. Maybe you want something a little more low-key, a little more reserved. There's an Acer 23.8 inch monitor on sale for $99 right now. Maybe that's not your size, that's not your flavor. There's a ton more on sale, link below. Next from there, coming in, a potentially the second greatest Cyber Monday deal of all time, second only to Barrel of Monkeys, JENGA for $9. That's a cheap way to get your kid off the tablet. And JENGA is fun as shh. - Sha-ka-ka. - Next from there, if you're looking to step into the smart home game, the Echo Dot is currently on sale for $19.99. That is cheap as hell. For that price, you could grab 10, you can grab two for your brother, for your sister, for your friends, for your family, to people who you mildly like. It'll make a great gift. From there, you guys know I love Philips Hue. It's what creates that beautiful splash of color behind me. And today, as the Hodge twins would say, there are all kinds of Philips Hue and Amazon Echo deals just sandwiched together in different configurations. So I will drop a link to everything in the description. With that said, I realize Philips Hue can be a little on the pricier side. So if you don't wanna dive into that ecosystem just yet, there is a Sengled Multicolor Smart LED Kit with two bulbs for 49 bucks. Try and beat that. Next from there, speaking of smart home items, if you've been looking to upgrade your Wi-Fi system, this is the Orbis. It's actually what we use here in the office. But we paid $299 for ours like suckers. And you don't have to be a sucker. It is currently on sale for $199. Next from there, if you like your USB sticks looking badass, my friend, I got the one for you. This is a 64 gigabyte Kingston Elite G2 on sale for $9 plus $10. - 21. - I know it's crazy as smartphone prices go higher and higher and higher, it seems like 4K TVs go lower and lower and lower. As JD Tech TV said, it's essentially the normal now. And there's never been a better time to buy one. Not only can you grab a 43 inch 4K TV for $249, there is also Amazon Fire TV built into this guy. Granted, it is Toshiba, which isn't the best brand in the world. But again, it's a 43 inch 4K TV with pretty solid reviews for under 300 bucks. TV people, it is now your time to shine. If you have a nice TV, maybe you want to upgrade your sound package. - Oh, well, well, this here? Oh, it's just my package. - There's this pretty sweet Polk Audio Sound Bar with a sub. And the icing on the top, the cherry on the cake, is that there is built-in Amazon Alexa compatibilities. So we just got tech sandwiches just piling in our faces right now. RAM boys, laptop boys, you guys looking for a deal potentially and, or an upgrade, there is an eight gigabyte kit from Crucial on sale for 48 bucks. In a time where it was looking a little dark for PC upgrades, where those prices were just skyrocketing, this is actually a breath of fresh air in terms of PC deals. Next from there, if you were pissed off at the 2018 MacBook Air release, and that really wasn't your jam, the 12 inch MacBook actually isn't a terrible idea. And currently, it is $200 off at Best Buy. So you can scoop up this little dude for $1,099. Camera people, if you've been looking to grab something to get into the game without dropping a ton of cash, I got the deal for you. The Canon T6 is on sale for $399, but you get two lenses. So that's essentially everything you need to get started out of the gate, making some crispy content. Apple Watch people, if you've been looking to grab one, but don't wanna spend all that Apple cash, you can pick one up for under 300 bucks right now. It is Series 3, but I think that's a fantastic deal if you're just looking to grab an Apple Watch for the first time ever. Now, I realize this is an older model from 2015, but B&H has a pretty solid deal on a 15 inch MacBook Pro for $1,599. And I realize, you're technically supposed to pay tax, and I'm not telling you how to live your lives. But I'm just saying, there's a good chance that if you check out, you're probably not gonna pay more than $1,599. (dramatic music) Newsflash, got that FreshTech TV Gloria Borger update. There is a Canon 60 32 item pack with seven lenses on sale for $2,400. Cyber Monday is shaming Black Friday. You get an indie filter, you get an SD card, you get a lens. You could just buy the pack and give away lenses to your friends, or you could use them. Your choice. Speaking of crazy packaged deals, B&H has the Mavic Fly More Combo for 280 George Washingtons off. Crazy, that's quite a bit of deals. Hopefully you guys enjoyed the video. If you did, and you are feeling like being awesome, make sure you guys smash that like button. If you missed it, I recently dropped this beautiful Mac mini setup with that ultra-wide thicc boi. This is Jonathan, and I'll catch you guys later. (upbeat music)",
    "transcript_keywords": [
        "Cyber Monday",
        "Cyber Monday deal",
        "greatest Cyber Monday",
        "sale",
        "deal",
        "Monday",
        "Monday deal",
        "Philips Hue",
        "Cyber",
        "deals",
        "guys",
        "Amazon Echo deals",
        "time",
        "grab",
        "Mac mini",
        "inch",
        "greatest Cyber",
        "Echo",
        "Philips",
        "Hue"
    ],
    "transcript_entities": [
        [
            "Black Friday",
            "EVENT"
        ],
        [
            "the Echo Dot",
            "ORG"
        ],
        [
            "4",
            "CARDINAL"
        ],
        [
            "the year",
            "DATE"
        ],
        [
            "2018",
            "DATE"
        ],
        [
            "seven",
            "CARDINAL"
        ],
        [
            "the Mavic Fly More Combo",
            "ORG"
        ],
        [
            "George Washingtons",
            "PERSON"
        ],
        [
            "32",
            "CARDINAL"
        ],
        [
            "Kingston Elite G2",
            "ORG"
        ],
        [
            "Philips Hue",
            "ORG"
        ],
        [
            "JENGA",
            "ORG"
        ],
        [
            "Orbis",
            "ORG"
        ],
        [
            "Jonathan",
            "PERSON"
        ],
        [
            "Mac",
            "ORG"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "this Infinity Gauntlet",
            "ORG"
        ],
        [
            "Apple Watch",
            "ORG"
        ],
        [
            "Hodge",
            "PERSON"
        ],
        [
            "Barrel Monkeys",
            "ORG"
        ],
        [
            "Philips Hue",
            "PERSON"
        ],
        [
            "T6",
            "PRODUCT"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "1,099",
            "MONEY"
        ],
        [
            "Amazon Fire TV",
            "ORG"
        ],
        [
            "eight gigabyte kit",
            "MONEY"
        ],
        [
            "Mac",
            "PERSON"
        ],
        [
            "99",
            "MONEY"
        ],
        [
            "Monday",
            "DATE"
        ],
        [
            "FreshTech TV",
            "ORG"
        ],
        [
            "9",
            "MONEY"
        ],
        [
            "Wi-Fi",
            "LOC"
        ],
        [
            "1,599",
            "MONEY"
        ],
        [
            "12 inch",
            "QUANTITY"
        ],
        [
            "64",
            "CARDINAL"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "Gloria Borger",
            "PERSON"
        ],
        [
            "MacBook Pro",
            "ORG"
        ],
        [
            "199",
            "MONEY"
        ],
        [
            "299",
            "MONEY"
        ],
        [
            "Cyber",
            "PRODUCT"
        ],
        [
            "Alexa",
            "PRODUCT"
        ],
        [
            "200",
            "MONEY"
        ],
        [
            "2015",
            "DATE"
        ],
        [
            "SD",
            "ORG"
        ],
        [
            "10",
            "CARDINAL"
        ],
        [
            "Newsflash",
            "ORG"
        ],
        [
            "K TV",
            "ORG"
        ],
        [
            "Toshiba",
            "ORG"
        ],
        [
            "49 bucks",
            "MONEY"
        ],
        [
            "USB",
            "ORG"
        ],
        [
            "RAM",
            "PERSON"
        ],
        [
            "a ton",
            "QUANTITY"
        ],
        [
            "more than $1,599",
            "MONEY"
        ],
        [
            "15 inch",
            "QUANTITY"
        ],
        [
            "3",
            "CARDINAL"
        ],
        [
            "48 bucks",
            "MONEY"
        ],
        [
            "Amazon",
            "ORG"
        ],
        [
            "19.99",
            "MONEY"
        ],
        [
            "300 bucks",
            "MONEY"
        ],
        [
            "Echo Spot",
            "ORG"
        ],
        [
            "280",
            "CARDINAL"
        ],
        [
            "$9 plus $10",
            "MONEY"
        ],
        [
            "2,400",
            "MONEY"
        ],
        [
            "MacBook",
            "ORG"
        ],
        [
            "519",
            "MONEY"
        ],
        [
            "Amazon Echo",
            "ORG"
        ],
        [
            "3.82",
            "MONEY"
        ],
        [
            "second",
            "ORDINAL"
        ],
        [
            "Best Buy",
            "ORG"
        ],
        [
            "Friday",
            "DATE"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "a 43 inch",
            "QUANTITY"
        ],
        [
            "MacBook Air",
            "EVENT"
        ],
        [
            "399",
            "MONEY"
        ],
        [
            "JD Tech TV",
            "ORG"
        ],
        [
            "249",
            "MONEY"
        ],
        [
            "Galaxy S9",
            "PRODUCT"
        ]
    ]
}