{
    "video_id": "GtRa34XO1xE",
    "title": "Galaxy Watch 6 review: better battery, better bezel, but is it enough?",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-08-09T14:00:09Z",
    "video_url": "https://www.youtube.com/watch?v=GtRa34XO1xE",
    "category": "Science & Technology",
    "tags": [
        "galaxy watch 6",
        "watch 6",
        "samsung galaxy watch 6",
        "samsung",
        "galaxy watch 6 classic",
        "samsung galaxy watch 6 classic",
        "watch 6 classic",
        "galaxy watch 6 features",
        "watch 6 samsung",
        "galaxy watch 6 pro",
        "samsung galaxy watch 6 unboxing",
        "samsung galaxy watch 6 pro",
        "galaxy watch 6 leaks",
        "galaxy watch 6 price",
        "samsung galaxy watch 6 specs",
        "samsung galaxy watch",
        "galaxy watch 6 release date",
        "galaxy watch 6 pro unboxing",
        "galaxy watch 6 rumors",
        "samsung watch 6 classic",
        "galaxy watch 6 unboxing"
    ],
    "views": 365116,
    "likes": 3941,
    "comments_count": 269,
    "description": "The Samsung Galaxy Watch 6 and Watch 6 Classic don’t change much. The battery life is better, the bezels are thinner, and Samsung’s finally doing stuff with its temperature sensor, but there are more Wear OS smartwatches than ever. A Pixel Watch 2 is supposedly on the way. So while these are excellent smartwatches, can Samsung afford to stick to the same formula? #Samsung #Technology #Smartwatch\n\n00:00 Intro\n00:52 What's new in the Watch 6 Series\n01:19 Using the Watch 6 with the Pixel 7 Pro vs Samsung\n03:08 Temperature Check\n04:47 Improved Battery?\n07:32 Conclusion\n\nRead more here: https://bit.ly/3DOa0pm\n\nIf you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy: http://bit.ly/2TQsqjB\n\nYou can get the Samsung Galaxy Watch 6 here: https://bit.ly/3Qv3uve\n\nSubscribe: http://goo.gl/G5RXGs\nSubscribe: http://goo.gl/G5RXGs\nLike The Verge on Facebook: https://goo.gl/2P1aGc\nFollow on Twitter: https://goo.gl/XTWX61\nFollow on Instagram: https://goo.gl/7ZeLvX\nFollow on TikTok: http://bit.ly/42VeCVU\n\nThe Vergecast Podcast: https://pod.link/430333725\nDecoder with Nilay Patel: http://apple.co/3v29nDc \nMore about our podcasts: https://www.theverge.com/podcasts\n\nRead More: http://www.theverge.com\nCommunity guidelines: http://bit.ly/2D0hlAv\nWallpapers from The Verge: https://bit.ly/2xQXYJr\n\nSubscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday: https://bit.ly/3I6nJtz",
    "description_links": [
        "https://bit.ly/3DOa0pm",
        "http://bit.ly/2TQsqjB",
        "https://bit.ly/3Qv3uve",
        "http://goo.gl/G5RXGs",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "(bright music) - So what's new with the Samsung Galaxy Watch 6 series? Well, you can do this with the temperature sensor now. It says the water is 70 degrees Fahrenheit and the cooking thermometer says 59 degrees. So it's just wrong. Cool. It's very cold. If you were looking for something to upend the entire Android wearable landscape, these smartwatches ain't it. (upbeat music) Samsung's basically taking the watches you know and repackaging them into something slightly better. So for this review, I figured we should address the main questions people have asked me about these watches. Namely: what's actually new? How well do these work with a non-Samsung Android phone? And has the battery life improved? First, here's a quick run through of what Samsung's changed from the Galaxy Watch 5 to the Galaxy Watch 6. We've got the return of the rotating bezel, woo, thinner bezels on both the regular Watch 6 and Classic, a new processor that's a smidge better than the old one, Wear OS 4 and One UI 5 Watch, slightly bigger batteries, minor health and sleep tracking updates, and a new strap mechanism. That's about it. Samsung is a bit like Apple in that its products always work best within its own ecosystem. So in the past when I've tested Galaxy Watches, I've always paired them with Samsung phones, but Google overtook Samsung in Wear OS smartwatch sales with the Pixel Watch last year and the Pixel Watch is going to get you the same experience regardless of what phone you use. So this time I wanted to see what it was like to pair the Galaxy Watch 6 series with a Pixel 7 Pro. For the most part, the experience is very similar, but you do miss out on a handful of things. Setup is a bit more tedious because you have the extra step of downloading two or three separate Samsung apps, creating a Samsung account, yada, yada, yada. This part is just a lot simpler on a Samsung phone. Six minutes versus 15. Can't really argue with that. And that's just for basic stuff. I'm not talking about downloading your third-party apps, downloading all of that sort of stuff. It's just always a little better with a Samsung device. You also miss out on EKGs and the new irregular heart rhythm notifications, which passively monitor for AFib in the background. For that, you're gonna need the Samsung Health Monitor app and that's a Samsung phone exclusive. Samsung's Camera Controller app is the same way. You need a Samsung phone to use it. You can't even download these apps from the Play Store on other Android phones. My other pet peeve is reprogramming the bottom button, which is unchanged from last year's Galaxy Watches. A long press is hard coded to bring up Samsung Wallet and you can't even switch it to Google Wallet. That said, these are minor issues. Setup is mostly a one-time thing. If you don't care about EKGs, you are not gonna miss the Health Monitor app. There are third-party camera controller apps in the Play Store. It's all just mildly annoying. (upbeat music) (water sploshing) Last year, Samsung introduced a temperature sensor on the Galaxy Watch 5 series. At launch, it did diddly-squat, but now you can use it for advanced period tracking. But if you don't have periods, you can download the Thermo Check app. It's a third-party app that uses Samsung's API so you can measure the temperature of things in your surroundings. It's fun and very silly and not really all that useful. We have this cold soda can. Low. Well, I can tell you that it's low. I can just touch it and tell you that it's low. It's 32. It's not freezing. 28? It says 28 degrees. You okay, watch? Hot cup of tea. 121. That's pretty close. A book. 73.4 versus 70. Still pretty close. Okay, as fun as this is, this is more of a, hey, you can do stuff with a temperature sensor than a super useful feature. It's not that it's wrong. It's just that are you going to use a smartwatch to measure the temperature of these things? Hmm, probably not. Still, I can't deny that it's fun and hopefully other third-party app makers can figure out slightly more useful applications for the temperature sensor. (upbeat music) The big new thing is Wear OS 4, but so far, Wear OS 4 on the Galaxy Watch 6 series looks, feels, and functions a lot like Wear OS 3 on the Galaxy Watch 5. Samsung says that the Exynos W930 chip delivers 18% faster performance, but I really didn't notice much of a difference. What Wear OS 4 brings to the table is cloud backups because finally you don't have to factory reset your watch if you get a new phone and better battery, which Samsung has struggled with in the past. I'm not gonna lie, I was really cheesed last year when Samsung made a big deal about improving battery life and my regular 40-millimeter Galaxy Watch 5 couldn't even last the whole day. Subsequent software updates made it better, but it was never what I would call amazing. The Watch 5 Pro fared better, but still never really hit Samsung's 80-hour estimate. So with that in mind, the Galaxy Watch 6 series has improved, but your mileage will vary. This is true of every smartwatch, but your individual use is going to heavily impact how much stamina you get off of a single charge. And in Samsung's case, there are a lot of settings that can impact your battery. For example, the first full day I wore the regular Watch 6, I still had 78% left by 5:00 p.m., but that was a sedentary day with barely any notifications enabled and the more battery-guzzling sleep tracking sensors turned off. Once you turn on the continuous SpO2 sensing overnight and all the other stuff, it does take a hit. I went to bed with about 35 to 40% battery and woke up eight hours later with 15%. I did notice a big improvement on the 40-millimeter's battery with GPS tracking. I went on a 45-minute run and it only lost 12% of charge and that's really good compared to last year. It's the same story with the 47-millimeter Classic, though, because of the bigger watch size, you do get an even larger battery and a little extra oomph. Yesterday, I woke up with about 88% battery, did a bunch of testing, including a 30-minute GPS run, got a ton of notifications, replied to a few messages, and by 4:00 p.m., I still had 59% battery left. I didn't have to charge before bed, and because I enabled the new sleep mode, I woke up with 28% battery and just popped it on the charger while I got ready for the day. Overall, I'd say I got pretty close to Samsung's battery estimates on both watches, but you're still basically charging every day or, at the very least, every other day. It's now good enough for me that I'm a lot less anxious about the battery dying on me at an inconvenient moment, but you're gonna have to go with the Watch 5 Pro if you really want multi-day battery life. While not a ton has changed on these watches, meaningful updates don't have to be big or splashy. There's a lot to like about the Galaxy Watch 6 series. I really dig that Samsung didn't have to turn either the Galaxy Watch 6 or the Classic into a hockey puck just to increase the display size or pack in larger batteries. The 47-millimeter Classic is probably the most comfy big boy watch I've ever tested. I've already said a lot about how stoked I am to see the rotating bezel come back, so I'm not gonna repeat myself other than to say that if you're a Watch 4 Classic owner, I think you're gonna be happy upgrading. If you have the regular Watch 5 and are thinking about the standard Watch 6, eh, I mean, it's great that the bezels are 30% thinner on the 6, but the majority of the watch faces have a black background and just about everything else is gonna be the same thing. Basically, if you've ever had a Samsung smartwatch before, you already know what you're getting here. Depending on your perspective, that could be a good or a bad thing. Personally, I don't know that Samsung can afford to coast like this for much longer. Just as there are more foldables than there used to be, there are a lot more Wear OS smartwatches too. Rumor has it that a Pixel Watch 2 is coming and all it really needs to do is fix battery life to give these watches a serious run for their money. So it's okay for Samsung to stick with a tried and true formula this year. Next year, maybe not so much. Hey, guys, thanks for watching, and, yes, I am always double wristing. Guess what? I have the double watch tans to prove it. Occupational hazard.",
    "transcript_keywords": [
        "Galaxy Watch",
        "Watch",
        "Samsung Galaxy Watch",
        "Samsung",
        "Galaxy",
        "Pixel Watch",
        "battery",
        "Samsung phone",
        "Samsung Galaxy",
        "regular Watch",
        "Wear",
        "Galaxy Watches",
        "Samsung Health Monitor",
        "watches",
        "year Galaxy Watches",
        "Classic",
        "app",
        "Health Monitor app",
        "lot",
        "year"
    ],
    "transcript_entities": [
        [
            "SpO2",
            "PRODUCT"
        ],
        [
            "Android",
            "ORG"
        ],
        [
            "15%",
            "PERCENT"
        ],
        [
            "40-millimeter",
            "QUANTITY"
        ],
        [
            "eight hours later",
            "TIME"
        ],
        [
            "the day",
            "DATE"
        ],
        [
            "78%",
            "PERCENT"
        ],
        [
            "30%",
            "PERCENT"
        ],
        [
            "the Galaxy Watch 5",
            "ORG"
        ],
        [
            "70 degrees Fahrenheit",
            "QUANTITY"
        ],
        [
            "59 degrees",
            "QUANTITY"
        ],
        [
            "5:00 p.m.",
            "TIME"
        ],
        [
            "the Health Monitor",
            "ORG"
        ],
        [
            "about 88%",
            "PERCENT"
        ],
        [
            "One",
            "CARDINAL"
        ],
        [
            "6",
            "CARDINAL"
        ],
        [
            "the first full day",
            "DATE"
        ],
        [
            "4:00 p.m.",
            "TIME"
        ],
        [
            "28 degrees",
            "QUANTITY"
        ],
        [
            "every day",
            "DATE"
        ],
        [
            "Wear OS 3",
            "ORG"
        ],
        [
            "Galaxy Watches",
            "PRODUCT"
        ],
        [
            "Watch 6",
            "EVENT"
        ],
        [
            "Classic",
            "PRODUCT"
        ],
        [
            "Galaxy Watches",
            "WORK_OF_ART"
        ],
        [
            "third",
            "ORDINAL"
        ],
        [
            "Galaxy Watch 5",
            "ORG"
        ],
        [
            "two or three",
            "CARDINAL"
        ],
        [
            "18%",
            "PERCENT"
        ],
        [
            "overnight",
            "TIME"
        ],
        [
            "Google",
            "ORG"
        ],
        [
            "28%",
            "PERCENT"
        ],
        [
            "the Play Store on other Android",
            "WORK_OF_ART"
        ],
        [
            "non-Samsung Android",
            "NORP"
        ],
        [
            "Google Wallet",
            "ORG"
        ],
        [
            "40-millimeter's",
            "TIME"
        ],
        [
            "30-minute",
            "TIME"
        ],
        [
            "Samsung",
            "ORG"
        ],
        [
            "the Galaxy Watch 6",
            "FAC"
        ],
        [
            "32",
            "CARDINAL"
        ],
        [
            "the whole day",
            "DATE"
        ],
        [
            "this year",
            "DATE"
        ],
        [
            "Next year",
            "DATE"
        ],
        [
            "70",
            "CARDINAL"
        ],
        [
            "about 35 to 40%",
            "CARDINAL"
        ],
        [
            "the Samsung Health Monitor",
            "ORG"
        ],
        [
            "a ton",
            "QUANTITY"
        ],
        [
            "last year",
            "DATE"
        ],
        [
            "the Samsung Galaxy Watch 6",
            "ORG"
        ],
        [
            "the Galaxy Watch 6",
            "ORG"
        ],
        [
            "80-hour",
            "TIME"
        ],
        [
            "47-millimeter",
            "QUANTITY"
        ],
        [
            "12%",
            "PERCENT"
        ],
        [
            "Wear OS 4",
            "ORG"
        ],
        [
            "Six minutes",
            "TIME"
        ],
        [
            "Watch 5",
            "EVENT"
        ],
        [
            "Last year",
            "DATE"
        ],
        [
            "the Galaxy Watch 5",
            "FAC"
        ],
        [
            "73.4",
            "CARDINAL"
        ],
        [
            "Wear OS 4",
            "LAW"
        ],
        [
            "Yesterday",
            "DATE"
        ],
        [
            "45-minute",
            "TIME"
        ],
        [
            "Thermo",
            "ORG"
        ],
        [
            "the Pixel Watch",
            "ORG"
        ],
        [
            "First",
            "ORDINAL"
        ],
        [
            "The Watch 5 Pro",
            "ORG"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "Exynos",
            "ORG"
        ],
        [
            "the Play Store",
            "WORK_OF_ART"
        ],
        [
            "UI 5 Watch",
            "ORG"
        ],
        [
            "59%",
            "PERCENT"
        ],
        [
            "Wear",
            "ORG"
        ],
        [
            "API",
            "ORG"
        ],
        [
            "15",
            "CARDINAL"
        ],
        [
            "121",
            "CARDINAL"
        ],
        [
            "the Watch 5 Pro",
            "ORG"
        ],
        [
            "last year's",
            "DATE"
        ]
    ]
}