{
    "video_id": "LKF3Qy21W1g",
    "title": "Razer Raptor hands-on: a unique new gaming monitor",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-01-07T06:00:49Z",
    "video_url": "https://www.youtube.com/watch?v=LKF3Qy21W1g",
    "category": "Science & Technology",
    "tags": [
        "razer",
        "razer raptor",
        "gaming",
        "gaming laptop",
        "raptor",
        "best gaming laptop",
        "pc gaming",
        "pc",
        "gaming laptop 2018",
        "laptop",
        "gaming pc",
        "best pc",
        "best laptop 2018",
        "best budget gaming laptop",
        "razer blade 15",
        "gaming notebook",
        "gaming laptop review",
        "best gaming laptops 2018",
        "is it worth it",
        "ces 2019",
        "ces",
        "2019",
        "2018",
        "ces 2018",
        "tv",
        "tablets",
        "desktops",
        "new tech",
        "gadgets",
        "technology",
        "tech news",
        "first look",
        "hands on",
        "review",
        "tech review",
        "tech",
        "latest updates",
        "did you know",
        "verge",
        "the verge",
        "vox"
    ],
    "views": 296254,
    "likes": 5142,
    "comments_count": 431,
    "description": "The Razer Raptor is a 27-inch gaming monitor and marks the first time that the hardware company has stepped into the standalone display space. But there’s an additional twist here: the Raptor isn’t just a cool CES prototype. It’s also going to be a real product. Razer is planning to ship the Raptor later this year for $699.99. \n\nAs for the actual display, it’s in line with other top gaming monitors: it has a 27-inch screen with 2560 x 1440 QHD resolution, a 144Hz refresh rate, and between a 1ms (with Motion Blur reduction) and 7ms (typical) response rate. The screen reaches a brightness of up to 420 nits, and it supports HDR (although Razer hasn’t specified which HDR standard, specifically). The one downside: there’s only support for AMD’s FreeSync tech, not Nvidia G-Sync.\n\nRead more here: http://bit.ly/2TvZJ84\n\nSubscribe: http://goo.gl/G5RXGs\n\nLike The Verge on Facebook: https://goo.gl/2P1aGc\nFollow on Twitter: https://goo.gl/XTWX61\nFollow on Instagram: https://goo.gl/7ZeLvX\nListen to our podcasts: https://www.theverge.com/podcasts\nRead More: http://www.theverge.com\nCommunity guidelines: http://bit.ly/2D0hlAv\nWallpapers from The Verge: https://bit.ly/2xQXYJr\n\nSubscribe to Verge Science on YouTube, a new home base for our explorations into the future of science: http://bit.ly/2FqJZMl",
    "description_links": [
        "http://bit.ly/2TvZJ84",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(relaxing hip hop music) - Hey, I'm Vlad with the Verge. Here at CES 2019 and I'm here with the Razer Raptor 27 inch monitor that is the latest edition to Razer's Chroma family of RGB LED illuminated products. It's a 27 inch 2560 by 1440 display, IPS one millisecond refresh time. It has AMD FreeSync support. Razer's working with Nvidia to add G-Sync support. It is intended for gamers. And it does add a little bit of Razer's own brand of extra design, so what you get with it is you get aluminum on the frame, then you get aluminum framework on the back, and you get a forged aluminum stand. And here's the cool thing. You can pivot this thing back 90 degrees to give you really easy access to over the cables back here. It comes with five green cables. They come bundled with the monitor. One of them is for your choice of HDMI or Display Port. One is USB-C, two of them are USB-A pass throughs and one of them is power. So, this whole tilting thing is just to give you easy access to plug things in and out. Around the back, there's a routing mechanism that kinda makes it look like all the cables just flowing out of the back of the monitor, which is just a cool design feature. So there are no buttons on the bottom, top or sides of the thing. There's only just analog joystick over here which turns it on and off. Gets you into the menus, on-screen controls and so on. So let's get the thing I don't like out of the way first. I've seen better displays than this. I've seen deeper blacks, more saturated colors. Better contrast. Razer says there's 420 nits of brightness in this display, so it's bright enough, but it doesn't impress me on first sight. That being said, I do like the flexibility of being able to adjust the height. I like the system that Razer has implemented with all the cables and just the way that it's color themed and synchronized. I'm not myself a fan of Chroma, but the fact that it's here and the fact that it can sync up with, it's currently run via USB-C via this Razer Blade laptop. You can sync it up with a laptop. You can sync it up with your desktop and the same mousepad and mouse and so on. There's definitely a sense of an ecosystem and a family of products here. So even though I criticized the contrast of this display, I do love the fact that it's matte, so maybe that's part of what loses some of that punchiness of the color. As somebody who hates the glare on his 27 inch iMac, I do really appreciate a large screen display with a matte screen which handles any light in the room with ease instead of giving me a mirror reflection. So, unfortunately we weren't able to do the most important thing that you can do with a gaming monitor, which is play some actual games on it, but we can talk about it's price. The 27 inch Razer Raptor will be available in the first half of 2019 for $699. For more coverage from here at CES 2019, stay tuned to theVerge.com and youtube.com/TheVerge.",
    "transcript_keywords": [
        "RGB LED illuminated",
        "Razer",
        "RGB LED",
        "Razer Raptor",
        "Verge",
        "Vlad",
        "thing",
        "back",
        "inch Razer Raptor",
        "display",
        "LED illuminated products",
        "LED illuminated",
        "Razer Chroma family",
        "cables",
        "monitor",
        "Razer Chroma",
        "inch",
        "family of RGB",
        "AMD FreeSync support",
        "Razer Blade laptop"
    ],
    "transcript_entities": [
        [
            "one",
            "CARDINAL"
        ],
        [
            "Razer",
            "ORG"
        ],
        [
            "Chroma",
            "PRODUCT"
        ],
        [
            "iMac",
            "ORG"
        ],
        [
            "USB",
            "ORG"
        ],
        [
            "Razer Blade",
            "PERSON"
        ],
        [
            "1440",
            "CARDINAL"
        ],
        [
            "Display Port",
            "FAC"
        ],
        [
            "Razer Raptor 27",
            "PRODUCT"
        ],
        [
            "RGB",
            "ORG"
        ],
        [
            "90 degrees",
            "QUANTITY"
        ],
        [
            "the first half of 2019",
            "DATE"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "One",
            "CARDINAL"
        ],
        [
            "27 inch",
            "QUANTITY"
        ],
        [
            "Razer Raptor",
            "ORG"
        ],
        [
            "2019",
            "DATE"
        ],
        [
            "USB-C",
            "ORG"
        ],
        [
            "2560",
            "CARDINAL"
        ],
        [
            "five",
            "CARDINAL"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "Nvidia",
            "ORG"
        ],
        [
            "Razer",
            "PERSON"
        ],
        [
            "HDMI",
            "ORG"
        ],
        [
            "Vlad",
            "PERSON"
        ],
        [
            "420",
            "CARDINAL"
        ],
        [
            "699",
            "MONEY"
        ]
    ]
}