{
    "video_id": "MCz3e5OspZQ",
    "title": "Apple iPhone 11 hands-on",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-09-10T22:48:56Z",
    "video_url": "https://www.youtube.com/watch?v=MCz3e5OspZQ",
    "category": "Science & Technology",
    "tags": [
        "iphone 11r",
        "11r",
        "apple iphone",
        "apple iphone 11r",
        "apple",
        "new iphone",
        "iphone 11",
        "iphone 11 max",
        "iphone 11 pro",
        "iphone 11 pro max",
        "apple iphone 11",
        "iphone pro max",
        "11 pro max",
        "11 pro",
        "11 max",
        "apple iphones",
        "apple new iphones",
        "iphone 11 camera",
        "iphone 11 pro camera",
        "iphone new camera",
        "apple new camera",
        "apple iphone camera",
        "iphone 11 price",
        "iphone 11 rumors",
        "iPhone 11 release date",
        "release date",
        "camera",
        "price",
        "hands on",
        "first look",
        "technology",
        "tech",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 962736,
    "likes": 7153,
    "comments_count": 1240,
    "description": "Apple’s iPhone 11 is a worthy successor to the iPhone XR. It includes a new dual-camera system, a night mode for night time shots, and extra hours worth of battery life. It’s arriving on September 20th, priced at $699.\n\nRead more about the iPhone 11 hands-on: http://bit.ly/2kDQzL2\nTop event announcements: http://bit.ly/2lKAeEv\niPad hands-on: http://bit.ly/2k8B7WY\niPhone 11 Pro and 11 Pro Max hands-on: http://bit.ly/2lP1TE8\nWatch Series 5 hands-on: http://bit.ly/2lIt7wm\n\nSubscribe: http://goo.gl/G5RXGs\nLike The Verge on Facebook: https://goo.gl/2P1aGc\nFollow on Twitter: https://goo.gl/XTWX61\nFollow on Instagram: https://goo.gl/7ZeLvX\n\nWhy'd You Push That Button Podcast: https://pod.link/1295289748\nThe Vergecast Podcast: https://pod.link/430333725\nMore about our podcasts: https://www.theverge.com/podcasts\n\nRead More: http://www.theverge.com\nCommunity guidelines: http://bit.ly/2D0hlAv\nWallpapers from The Verge: https://bit.ly/2xQXYJr\n\nSubscribe to Verge Science on YouTube, a new home base for our explorations into the future of science: http://bit.ly/2FqJZMl",
    "description_links": [
        "http://bit.ly/2kDQzL2",
        "http://bit.ly/2lKAeEv",
        "http://bit.ly/2k8B7WY",
        "http://bit.ly/2lP1TE8",
        "http://bit.ly/2lIt7wm",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- This is the iPhone 11. The sixth phase and updates to the wildly popular iPhone 10R. On the outside it looks almost exactly the same. You got a 6.1 inch Liquid Retina LCD display. Yep, it's still an LCD. It's covered in a stronger glass this year though. On the back, the big change, two cameras. You've got the 12 megapixel, wide angle F 1.8 lens, and then a new F 2.4 ultra wide angle that lets you see a lot more of the frame. Apple's calling them 1X and .5X. Those cameras are now covered in a new camera bump that's integrated into this glass. So you've got the stronger glass here and then kind of a matte finish camera bump, which is really interesting to look at. You kind of have to see it in person but it looks really cool. So you can see the new software interface for the camera and iOS 13 lets you see the wide angle while you're shooting with the regular camera and you can push shot, you can zoom out, you can see way more of the frame, you can push in and then obviously you've got the zoom slider here that lets you go all the way from wide, all the way to 5X digital zoom. A lot of people asked me to tutor where the live photo icon moved. You see this icon here? The live photos are still right here, you can turn them on and off. This little arrow brings up your options over here. So you got filters, the timer, the framing. You got the live photo button there and the flash. So that's all been hidden away so you get to see more of what's going on down here. Of course, there's still the flash button and you can flip the camera around, get the new selfie camera, which shots in 4K, 6D, and has a slow-mo video. I asked my friend Joanna Stern to help me shoot a slow-mo selfie. Let's check it out. The iPhone 13 has Apples A-13 bionic processor, which is up to 20% faster than the A-12 bionic in the iPhone 10R. It also offers up to an hour longer battery life than the 10R, which I think is what most people will be most excited about. And you can see it's playing this game from Apple Arcade just fine Apple also announced Apple Arcade today, it's $4.99 a month for all the games you can play from Apple Arcade. Videos also been updated from iPhone 11. You can shoot 4K 6D from both lenses, with the regular and the ultra wide. You can also shoot 4K 6D from the front. It's got that slow-mo selfie mode. And, check this out on the front camera You here, you turn it wide you'll see it pushes out wide. So you'll get a wide angle selfie. There's Deeter, Want Deeter out, you pull 'em in There's Deeter again, Here I am, THere's Deeter. It's pretty good on the front camera. iPhone 11 starts at $699 and goes on sale September 20. It's available in six colors, let me see if I can get 'em all black, white, red, purple, yellow, green. That's it, that's the iPhone 11. Ready Go Give me a hair flip (laughing)",
    "transcript_keywords": [
        "Liquid Retina LCD",
        "Apple Arcade",
        "camera",
        "wide",
        "Apple",
        "iPhone",
        "wide angle",
        "Retina LCD display",
        "Deeter",
        "Retina LCD",
        "inch Liquid Retina",
        "Liquid Retina",
        "Arcade",
        "angle",
        "front camera",
        "camera bump",
        "selfie",
        "LCD",
        "Apple Arcade today",
        "announced Apple Arcade"
    ],
    "transcript_entities": [
        [
            "LCD",
            "ORG"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "up to 20%",
            "PERCENT"
        ],
        [
            "iOS 13",
            "LAW"
        ],
        [
            "Apple Arcade",
            "ORG"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "Deeter",
            "PERSON"
        ],
        [
            "six",
            "CARDINAL"
        ],
        [
            "F 2.4",
            "PRODUCT"
        ],
        [
            "6D",
            "DATE"
        ],
        [
            "A-12",
            "PRODUCT"
        ],
        [
            "F 1.8",
            "PRODUCT"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "sixth",
            "ORDINAL"
        ],
        [
            "Deeter, Want Deeter",
            "WORK_OF_ART"
        ],
        [
            "Apples",
            "ORG"
        ],
        [
            "4",
            "CARDINAL"
        ],
        [
            "12 megapixel",
            "QUANTITY"
        ],
        [
            "this year",
            "DATE"
        ],
        [
            "up to an hour",
            "TIME"
        ],
        [
            "iPhone 11",
            "PRODUCT"
        ],
        [
            "10R.",
            "DATE"
        ],
        [
            "Joanna Stern",
            "PERSON"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "Liquid Retina LCD",
            "PRODUCT"
        ],
        [
            "4.99",
            "MONEY"
        ],
        [
            "6.1 inch",
            "QUANTITY"
        ],
        [
            "September 20",
            "DATE"
        ],
        [
            "699",
            "MONEY"
        ]
    ]
}