{
    "video_id": "QvVuh7HQ0yw",
    "title": "Apple Macbook Air 2018 hands-on",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-10-30T17:39:29Z",
    "video_url": "https://www.youtube.com/watch?v=QvVuh7HQ0yw",
    "category": "Science & Technology",
    "tags": [
        "macbook",
        "macbook air",
        "apple",
        "apple macbook",
        "macbook 2018",
        "pro",
        "air",
        "2018",
        "apple macbook pro",
        "laptop",
        "macbook pro",
        "new macbook pro",
        "macbook pro review",
        "macbook pro 2018",
        "macbook pro vs air",
        "macbook review",
        "2018 macbook pro",
        "apple macbook pro 2018",
        "keynote",
        "tim cook",
        "apple products",
        "steve jobs",
        "apple 2018",
        "event",
        "new iphones",
        "rumors",
        "apple ny",
        "apple media event",
        "apple official",
        "technology",
        "gadgets",
        "tech",
        "first look",
        "hands on",
        "latest updates",
        "iphone",
        "review",
        "verge",
        "the verge"
    ],
    "views": 1028055,
    "likes": 10762,
    "comments_count": 1323,
    "description": "Apple has unveiled the new MacBook Air, replacing the influential but outdated laptop with a new model that adds a high-resolution Retina display, USB-C, and Touch ID. The laptop strongly resembles the 13.3-inch MacBook Pro that was released two years ago, but the design has been tweaked with a subtle taper to make it a bit smaller and to more closely resemble the iconic Air.\n\nSubscribe: http://goo.gl/G5RXGs\n\nLike The Verge on Facebook: https://goo.gl/2P1aGc\nFollow on Twitter: https://goo.gl/XTWX61\nFollow on Instagram: https://goo.gl/7ZeLvX\nRead More: http://www.theverge.com\nCommunity guidelines: http://bit.ly/2D0hlAv\n\nSubscribe to Verge Science on YouTube, a new home base for our explorations into the future of science: http://bit.ly/2FqJZMl",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hey everybody, this is Dieter with The Verge. I'm here at Apple's event in Brooklyn, and I am holding the all-new 13.3-inch MacBook Air. We've been waiting for this thing for a very, very long time, so I wanna get into it and see what we got. As you can see, the star of the show is the new fully-retina display. It's still 13.3 inches, but they shrunk the bezels down. They also made them black and glass and glossy, but that means that its overall footprint is smaller than the last-generation MacBook Airs. But it's full sRGB, and it has a very high resolution, same as the 13-inch MacBook Pro. And you could also see some other changes. It has this third-generation butterfly keyboard, which means that it's a little bit quieter than the older MacBook Pros, but it's still pretty slim key travel, but you'll also see, right there, there's a Touch ID sensor so that you can log in with your fingerprint. And that's great 'cause it's way more convenient than typing in your passcode or waiting for your Apple Watch to finally connect to it. Now, in order to make that thing work, it includes this new T2 chip, which makes everything more secure. It also controls the SSD and so on, but the real processor you care about is the Intel processor. It's an eighth-generation Intel processor. The base model here is a Core i5 with 8 gigs of RAM and 128 gig SSD, and it costs $1,199. Now, this looks quite a bit like the generation of MacBook Pros that we've seen recently, but it's nice and tapered along the side, so you get that classic MacBook Air look. There is, of course, a headphone jack. And then over on the other side, your two parts are USB-C and Thunderbolt. They book work as Thunderbolts, so you're gonna lose MagSafe, which is gonna be a bummer for a lot of people, but USB-C is a lot more versatile, although you are probably still gonna have to deal with some dongles. The last thing I will point out on this thing is the Trackpad. It's huge. It's a giant Trackpad. It's just really big. It's also using Force Touch, so you can click anywhere on the Trackpad, and it will click. It works really well, so that is it. It is the MacBook Air. You can go and pre-order it right now. It should be shipping I think as soon as next week, and again, the base model costs $1,199, which is a little bit more than I was hoping, but it's still a pretty decent price for a MacBook Air that finally, finally, finally has modern specs. You can also see that they've added the speakers at the side just like on the MacBook Pros, and they are supposed to be much louder than before. The new MacBook Air is gonna come in the standard MacBook colors, the gold, the space gray, and the gray. You'll also see that it's got this aluminum finish. They're all made of aluminum of course, but it's 100% recycled aluminum, and it weighs 2.75 pounds, which actually isn't that much. But it's a little bit less than the old MacBook Air, although it is more than the little 12-inch Mac. The other Mac that was announced here today was a brand-new Mac mini. It looks exactly the same as the old Mac mini, but it has all-new modern specs, USB-C, basically everything you were hoping that they would've put in that device, so for much more on what's going on here at Apple's event, the MacBook Air, the Mac mini, and the new iPad Pro, definitely keep it locked to The Verge.",
    "transcript_keywords": [
        "MacBook Air",
        "MacBook",
        "MacBook Pros",
        "Air",
        "Mac",
        "Dieter",
        "Mac mini",
        "lastgeneration MacBook Airs",
        "Pros",
        "classic MacBook Air",
        "older MacBook Pros",
        "Apple",
        "Trackpad",
        "Apple event",
        "USBC",
        "thing",
        "Intel processor",
        "bit",
        "finally",
        "Pro"
    ],
    "transcript_entities": [
        [
            "third",
            "ORDINAL"
        ],
        [
            "the MacBook Pros",
            "WORK_OF_ART"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "Mac",
            "ORG"
        ],
        [
            "MacBook Airs",
            "PRODUCT"
        ],
        [
            "128",
            "CARDINAL"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "your Apple Watch",
            "ORG"
        ],
        [
            "T2",
            "ORG"
        ],
        [
            "8",
            "CARDINAL"
        ],
        [
            "MacBook Pro",
            "ORG"
        ],
        [
            "12-inch",
            "QUANTITY"
        ],
        [
            "13.3 inches",
            "QUANTITY"
        ],
        [
            "100%",
            "PERCENT"
        ],
        [
            "Trackpad",
            "PERSON"
        ],
        [
            "1,199",
            "MONEY"
        ],
        [
            "MacBook Air",
            "ORG"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "eighth",
            "ORDINAL"
        ],
        [
            "jack",
            "PERSON"
        ],
        [
            "iPad Pro",
            "PRODUCT"
        ],
        [
            "MagSafe",
            "PRODUCT"
        ],
        [
            "2.75 pounds",
            "QUANTITY"
        ],
        [
            "MacBook",
            "FAC"
        ],
        [
            "MacBook Air",
            "PRODUCT"
        ],
        [
            "Core",
            "ORG"
        ],
        [
            "next week",
            "DATE"
        ],
        [
            "Brooklyn",
            "GPE"
        ],
        [
            "USB-C",
            "ORG"
        ],
        [
            "Force",
            "ORG"
        ],
        [
            "Thunderbolts",
            "ORG"
        ],
        [
            "13-inch",
            "QUANTITY"
        ],
        [
            "Dieter with The Verge",
            "WORK_OF_ART"
        ],
        [
            "SSD",
            "ORG"
        ],
        [
            "Mac",
            "PERSON"
        ],
        [
            "Intel",
            "ORG"
        ],
        [
            "the MacBook Air",
            "ORG"
        ],
        [
            "RAM",
            "ORG"
        ],
        [
            "MacBook Pros",
            "ORG"
        ],
        [
            "13.3-inch",
            "QUANTITY"
        ]
    ]
}