{
    "video_id": "zZEfV4SJoSE",
    "title": "Sony at CES 2022 in 5 minutes: PlayStation VR2 and Vision S EV",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-01-05T02:09:04Z",
    "video_url": "https://www.youtube.com/watch?v=zZEfV4SJoSE",
    "category": "Science & Technology",
    "tags": [
        "sony ces",
        "ces 2022",
        "best of ces",
        "best of ces 2022",
        "led",
        "oled",
        "best tv",
        "best smart tvs",
        "QD-OLED 4K TV",
        "tom holland",
        "sony entertainment",
        "uncharted",
        "playstation",
        "PS5",
        "VR",
        "virtual reality",
        "playstation VR2",
        "PSVR 2",
        "vision s",
        "Vision-S electric car",
        "evs",
        "sony mobility inc",
        "supercut",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 549928,
    "likes": 7652,
    "comments_count": 535,
    "description": "Sony just wrapped its keynote at CES 2022 where it showed a Vision SUV prototype and announced a new car company: Sony Mobility Inc. Sony also confirmed that its next VR headset will be called PlayStation VR2 and announced Horizon: Call of the Mountain, a new PSVR game.\n\nRead more here:\nSony pivots into cars with Sony Mobility and a Vision-S SUV prototype at CES 2022: https://bit.ly/3JFbqEp \nSony confirms PlayStation VR2 name and Horizon game: https://bit.ly/3HHlA5P \n\n0:00 PlayStation VR2 announcement \n1:23 Horizon: Call of the Mountain VR teaser\n1:52 Sony Vision S ev announcement\n4:12 Sony Mobility Inc. announcement \n\nSubscribe: http://goo.gl/G5RXGs\nLike The Verge on Facebook: https://goo.gl/2P1aGc\nFollow on Twitter: https://goo.gl/XTWX61\nFollow on Instagram: https://goo.gl/7ZeLvX\n\nThe Vergecast Podcast: https://pod.link/430333725\nDecoder with Nilay Patel: http://apple.co/3v29nDc \nMore about our podcasts: https://www.theverge.com/podcasts\n\nRead More: http://www.theverge.com\nCommunity guidelines: http://bit.ly/2D0hlAv\nWallpapers from The Verge: https://bit.ly/2xQXYJr\n\nSubscribe to Verge Science on YouTube, a new home base for our explorations into the future of science: http://bit.ly/2FqJZMl",
    "description_links": [
        "https://bit.ly/3JFbqEp",
        "https://bit.ly/3HHlA5P",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Welcome to CES 2022. - Today, I'm thrilled to announce the official names for our next gen VR system, \"PlayStation.VR2\". And our next gen controllers will be called, \"PlayStation.VR2 Sense Controllers\". PlayStation.VR2 will bring together the power of technology with the creativity of developers. We've developed new sensory features, enhanced controls and tracking, and upgraded visual fidelity. For example, with eye tracking, you'll be able to interact more intuitively as your character while allowing for improved social expression. The headset also has feedback. So players will feel subtle, responsive vibrations that heightened the sensations of their in-game actions. Visually, PlayStation.VR2 will offer a best-in-class experience with 4K HDR, foveated rendering, and a 110 degree field of view. All of this is on top of the new PlayStation.VR2 sense controllers, which enable players to feel and interact with games in a much more visceral way. We're also excited to announce that one of the biggest exclusive franchises on PlayStation will be coming to PlayStation.VR2. \"Horizon Call of the Mountain\" from \"Guerrilla Games and Firesprite Games\". (intense music) - [In-Game Character] There. (dramatic music) - [In-Game Character] What's that tall neck doing? - It's headed towards Storms Grasp. - It's headed towards us. (dramatic music) - And today I drag to show you a new \"Vision-S\" prototype. (dramatic music) This is our new prototype SUV. Vision-S has been developed on a foundation of safety, adaptability, and entertainment. A total of 40 sensors, including Sony CMOs image sensors are installed, inside and outside the vehicle to monitor safety. In terms of adaptability, the Vision-S prototype is a good with network connectivity, which allows us to be the vehicle that continuously evolves. It also makes it possible personalize a cabin for each user. And with 5g, it enables high speed, high capacity, and low rate AC connection between the in-vehicle system and the cloud. The Vision-S also evolves mobility as an entertainment space and features our 360 reality audio, gaming experiences, and Bravia core for Vision-S, a fully integrated digital video service. We have learned more about mobility through our exploration on Vision-S and from the various partners who have supported these efforts. With our imaging and sensing, club, 5g, and entertainment technologies combined with content mastery, we believe Sony is well positioned as a creativity themed company, to redefine mobility. That being said, I'm excited to announce, this spring, we are establishing a new company, Sony Mobility Inc. to accelerate these efforts. And, we are exploring a commercial launch of Sony's EV. Sony Mobility Inc will harness the potential of mobility, utilizing our AI and robotics. This is a bold step into the future, bringing our expertise in creating diverse and innovative solutions to the world. Thank you for being with us today. Enjoy CES. (everyone clapping)",
    "transcript_keywords": [
        "mobility",
        "Sony",
        "VisionS",
        "Sense Controllers",
        "Sony Mobility",
        "PlayStation",
        "games",
        "controllers",
        "gen controllers",
        "announce",
        "gen",
        "Sense",
        "CES",
        "Today",
        "prototype",
        "entertainment",
        "Guerrilla Games",
        "Firesprite Games",
        "excited to announce",
        "Horizon Call"
    ],
    "transcript_entities": [
        [
            "Today",
            "DATE"
        ],
        [
            "CES",
            "ORG"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "AI",
            "ORG"
        ],
        [
            "Horizon Call of the Mountain",
            "WORK_OF_ART"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "this spring",
            "DATE"
        ],
        [
            "AC",
            "ORG"
        ],
        [
            "5",
            "CARDINAL"
        ],
        [
            "Sony Mobility Inc.",
            "ORG"
        ],
        [
            "Sony Mobility Inc",
            "ORG"
        ],
        [
            "EV",
            "ORG"
        ],
        [
            "Vision-S",
            "ORG"
        ],
        [
            "Bravia",
            "GPE"
        ],
        [
            "4",
            "CARDINAL"
        ],
        [
            "Sony",
            "ORG"
        ],
        [
            "PlayStation",
            "PRODUCT"
        ],
        [
            "Vision-S",
            "WORK_OF_ART"
        ],
        [
            "110 degree",
            "QUANTITY"
        ],
        [
            "40",
            "CARDINAL"
        ],
        [
            "Guerrilla Games",
            "WORK_OF_ART"
        ]
    ]
}