{
    "video_id": "044FUX0OO10",
    "title": "The LG Gram Is (Still) The Lightest Laptop Around",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-04-12T16:49:01Z",
    "video_url": "https://www.youtube.com/watch?v=044FUX0OO10",
    "category": "Science & Technology",
    "tags": [
        "lg gram review",
        "lg gram 13z975",
        "lg gram 13z980",
        "lightest laptop",
        "best laptop 2018",
        "lightest laptop 2018",
        "mrmobile",
        "michael fisher",
        "lg laptop"
    ],
    "views": 98223,
    "likes": 3908,
    "comments_count": 209,
    "description": "Making things thinner and lighter has been standard procedure in the tech game for years, and it’s not that exciting anymore when it comes to smartphones. Laptops, though, are another story. I’m MrMobile and while I already produced an LG Gram review last year, there's a new crop of contenders for \"lightest laptop\" over at LG ... and they're every bit as featherweight as their predecessors. In fact the LG Gram 13Z975 model in my office has already been eclipsed by the newer 13Z980 line – but the point I'm making, that a two-pound laptop is as rare as it is precious – is ably demonstrated by even the older model. Join me for a fresh (and brief) look at the LG Gram, one of the lightest laptops of 2018, and stay tuned for more laptop coverage coming soon at MrMobile!\n\n\n[SUBSCRIBE TO MRMOBILE]\n\nhttps://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1\n\n\n[ABOUT MRMOBILE'S LG GRAM 2018 QUICK LOOK]\n\nMrMobile's LG Gram Quick Look for 2018 was produced following several days with an LG Gram 13Z975 review device provided by LG. The device received one Windows 10 update during the production period, and was not put through the full review process for this quick-look video.\n\n\n[PRODUCTS IN THIS VIDEO]\n\nLG Gram 13Z980 [Amazon]:\nhttp://mrmobile.tech/4n3\n\nPeak Design 30L Backpack (Ash) [Amazon]:\nhttp://mrmobile.tech/4my\n\nMrMobile's Amazon Influencer List Of Tech:\nhttp://a.co/aCziLqV\n\n\n[MUSIC]\n\n“Green Fever” by Flash Fluharty, available at Premium Beat:\nhttps://www.premiumbeat.com/royalty_free_music/songs/green-fever\n\n“Boosted” by Cymatix, available at Premium Beat:\nhttps://www.premiumbeat.com/royalty_free_music/songs/boosted\n\n\n[SOCIALIZE]\n\nhttp://facebook.com/themrmobile\nhttp://instagram.com/themrmobile\nhttp://twitter.com/themrmobile\nhttp://mrmobile.tech\n\n\n[DISCLOSURE]\n\nThis post may contain affiliate links. See Mobile Nations' disclosure policy for more details: http://www.mobilenations.com/external-links",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/4n3",
        "http://mrmobile.tech/4my",
        "http://a.co/aCziLqV",
        "https://www.premiumbeat.com/royalty_free_music/songs/green-fever",
        "https://www.premiumbeat.com/royalty_free_music/songs/boosted",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- Making things thinner and lighter has been standard procedure in the tech game for years, and it's not all that exciting anymore when it comes to smartphones. Laptops though, that's another story. I'm Mr. Mobile and this is a quick look at the new lightest laptop I've used, the LG Gram. (funky music) Now, half of you may be wondering, if you're having memory problems, so let me put your mind at ease, yes, I've covered a laptop called the LG Gram before. It's the one that stayed ultra-light, no matter how much praise I heaped upon it. The one that endured countless tosses down to the down to the, to the floor. So this is one of the newer models, and when LG sent it to me late last year, it took the opportunity to bump the specs some. An eighth generation Intel Core i7 to be specific. But you know, the i5 on the older model was plenty speedy for my tastes. It's the practical improvements on the newer one that have me smiling. Like the built-in fingerprint sensor, and the touch layer atop the display. Those features only sweeten an already tempting pot for a guy who's always on the road. See, I'm fresh off the review of Huawei MateBook X Pro, and before that the Surface Book 2, both very capable machines, but they're also beefy in a bag. Well, the Gram is feather-weight. I said in my review of the previous model that all a sales person should have to do is put this machine in a customer's hands, basically it'll sell itself from that point. And it still manages to cram in a 60 watt hour battery. That same capacity gave the previous model endurance that I called ridiculously, no outrageously, good. Almost 13 hours of use at one point. I haven't been able to put the improved version to a proper endurance test, but I should mention that there's actually a still a newer model than the one I have, which ups the battery to 72 watt hours, and moves the fingerprint sensor to the power button. And there's a bunch of 50 inch variants Windows Central has reviewed, but I haven't touched those. My point with this quick look is just to remind everyone that there's another option out there for a laptop you can legitimately forget is in your bag. Lest you think this is some kind of puff-piece, I must also remind you of the down sides. The speakers on this thing are bad, producing some of the thinnest, flattest sound around. The hinge is a terrible place to put a camera, if you care at all about what you look like on a video conference. The track pad is not as large or comfortable as I'd like. And a sleek and light machine like this deserves better than this clunky, bulky charger, which looks like something from 20 years ago. If you have a USB charger lying around with some chutzpah, you can charge via the USB-C port too. Let's let those ports lead us through the rest of the upsides on our way out the door. You get every form of IO you can reasonably expect on a small machine, including a micro-SD card slot, which makes this a great notebook for viewing drone footage out in the field. And the magnesium frame means that even if you drop it in the process, it'll probably come home in working condition anyway. Don't push it though, as the older Gram discovered, when my laptop rack literally fell off the wall. The lightweight casing won't handle everything you throw at it. The 13Z975 is tough to find on Amazon these days, but the updated 980 model is there, where it ranges from 1200 to 1400 dollars, depending on processor. That's a crowded price point where you'll find laptops from Dell, HP and ASUS, some of which have features like reversible screens. But they're all at least 25% heavier than the Gram. So if you're serious enough about putting mobility first, that you want the lightest Windows laptop you can find, at least the lightest one I've ever tested, and you're willing to put up with the same bad camera placement that got Huawei the stink-eye in my last review, add the LG Gram to your list of considerations. This video was brought to you by Thrifter. Thrifter is a new way to save money on everything from gadgets to home goods, by shopping based on value and not hype. Check out the latest deals at thrifter.com, and tell 'em Mr. Mobile sent ya. Keep in mind folks, this was just a quick look, not a proper review, for that head on over to Windows Central, which has tons of deep dives on machines heavy and small, large and light. Until next time, thanks for watching, and stay mobile my friends.",
    "transcript_keywords": [
        "Making things thinner",
        "thinner and lighter",
        "standard procedure",
        "tech game",
        "exciting anymore",
        "Gram",
        "model",
        "laptop",
        "Windows Central",
        "put",
        "lightest Windows laptop",
        "Making things",
        "things thinner",
        "point",
        "review",
        "previous model",
        "Windows",
        "Windows laptop",
        "Mobile",
        "machine"
    ],
    "transcript_entities": [
        [
            "Huawei",
            "ORG"
        ],
        [
            "eighth",
            "ORDINAL"
        ],
        [
            "Dell",
            "ORG"
        ],
        [
            "half",
            "CARDINAL"
        ],
        [
            "60 watt hour",
            "TIME"
        ],
        [
            "980",
            "CARDINAL"
        ],
        [
            "HP",
            "ORG"
        ],
        [
            "Almost 13 hours",
            "TIME"
        ],
        [
            "at least 25%",
            "PERCENT"
        ],
        [
            "ASUS",
            "ORG"
        ],
        [
            "USB",
            "ORG"
        ],
        [
            "Mobile",
            "PERSON"
        ],
        [
            "Amazon",
            "ORG"
        ],
        [
            "the Surface Book 2",
            "EVENT"
        ],
        [
            "1200 to 1400 dollars",
            "MONEY"
        ],
        [
            "Windows Central",
            "ORG"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "the LG Gram",
            "PRODUCT"
        ],
        [
            "Huawei MateBook X Pro",
            "ORG"
        ],
        [
            "these days",
            "DATE"
        ],
        [
            "years",
            "DATE"
        ],
        [
            "Gram",
            "PRODUCT"
        ],
        [
            "IO",
            "GPE"
        ],
        [
            "Intel Core",
            "ORG"
        ],
        [
            "20 years ago",
            "DATE"
        ],
        [
            "LG",
            "ORG"
        ],
        [
            "Gram",
            "PERSON"
        ],
        [
            "late last year",
            "DATE"
        ],
        [
            "13Z975",
            "CARDINAL"
        ],
        [
            "Thrifter",
            "PERSON"
        ],
        [
            "Windows",
            "PRODUCT"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "72 watt hours",
            "TIME"
        ],
        [
            "50 inch",
            "QUANTITY"
        ]
    ]
}