{
    "video_id": "aR_kNDjrZiM",
    "title": "Surface Book 2 Review: That Special Something",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-02-10T14:51:13Z",
    "video_url": "https://www.youtube.com/watch?v=aR_kNDjrZiM",
    "category": "Science & Technology",
    "tags": [
        "surface book 2 review",
        "surface book 2 vs macbook pro",
        "surface book 2 15",
        "surface book 2 vs surface book",
        "best laptop 2018",
        "best tablet 2018",
        "surface book review",
        "mrmobile",
        "michael fisher",
        "windows central"
    ],
    "views": 346266,
    "likes": 9470,
    "comments_count": 558,
    "description": "Sponsored by NordVPN. Try it out and get 77% off a three-year package! Click here: https://nordvpn.com/mrmobile and use discount code \"mrmobile\"\n\n\n[SURFACE BOOK 2 REVIEW]\n\nThere’s just something about the Surface. Every convertible wants to be the Surface Pro; every notebook should aspire to be as comfortable as the Surface Laptop; and … there’s nothing quite like the Surface Book. Nothing except its sequel, that is. I'm MrMobile; join me for the Surface Book 2 Review!\n\n\n[SUBSCRIBE]\n\nhttps://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1\n\n\n[ABOUT MRMOBILE'S SURFACE BOOK 2 REVIEW]\n\nMrMobile's Surface Book 2 Review was produced following 7 days with a Surface Book 2 review device provided by Microsoft. The test unit was the top trim, with a Core i7-8650U processor, 16GB of RAM and 1TB SSD. Retail price: $3,299. [The 15-inch model starts at $2,499 with the same specs with the exception of a 256GB SSD. A mid-tier variant offers 512GB of storage and costs $2,899.]\n\n\n[PRODUCTS IN THIS VIDEO]\n\nMicrosoft Surface Book 2 15\" [Amazon]:\nhttp://mrmobile.tech/4jt\n\nMicrosoft Arc Touch Mouse:\nhttp://mrmobile.tech/4j6\n\nMicrosoft Surface Precision Mouse:\nhttp://mrmobile.tech/4ju\n\nAnker PowerCore+ 26800:\nhttp://mrmobile.tech/4j2\n\n\n[LINKS]\n\nSurface Book 2 Review [Windows Central]:\nhttps://www.windowscentral.com/surface-book-2\n\n\n[MUSIC]\n\n“First Thing” by JAM Studio, available at Premium Beat:\nhttps://www.premiumbeat.com/royalty_free_music/songs/first-thing\n\n“Green Fever” by Flash Fluharty, available at Premium Beat:\nhttps://www.premiumbeat.com/royalty_free_music/songs/green-fever\n\n\n[SOCIALIZE]\n\nhttp://facebook.com/themrmobile\nhttp://instagram.com/themrmobile\nhttp://twitter.com/themrmobile\nhttps://www.snapchat.com/add/mrmobilesnaps\nhttp://mrmobile.tech\n\n\n[DISCLOSURE]\n\nThis post may contain affiliate links. See Mobile Nations' disclosure policy for more details: http://www.mobilenations.com/external-links",
    "description_links": [
        "https://nordvpn.com/mrmobile",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/4jt",
        "http://mrmobile.tech/4j6",
        "http://mrmobile.tech/4ju",
        "http://mrmobile.tech/4j2",
        "https://www.windowscentral.com/surface-book-2",
        "https://www.premiumbeat.com/royalty_free_music/songs/first-thing",
        "https://www.premiumbeat.com/royalty_free_music/songs/green-fever",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Mr. Mobile] There's just something about the Surface. Almost every convertible PC wants to be the Surface Pro. Every notebook should be as comfortable as the Surface laptop. And there's nothing quite like the Surface Book. Except of course, it's sequel. I'm Mr. Mobile, and this is the Surface Book 2 Review, brought to you by NordVPN. (upbeat music) The Surface Book 2 launched back in November, and while I'd love to have gotten it earlier, the bright side is that other reviewers have already done the hard work for me. So, if you want all the granular details, the benchmarks, and such, I'll refer you to Windows Central. If you just want the TLDR on performance, it's this: there's enough power on the Surface Book 2 to run demanding titles like Doom, Destiny 2, and Gears of War 4 very well. And given the specs on the top shelf trim that I reviewed, that's probably no surprise. As for my own gaming testing, well, I mainly stuck to the classics. Sure, make fun of me for testing a 2018 laptop using a game made in 1995. But Tie Fighter shines a light on some of my favorite things about the Surface Book 2. I can plug a joystick right in without an adapter, Since Microsoft was kind enough to retain a couple of USBA ports. And even if you don't have a joystick, they also come in handy for things like cameras and audio accessories, you know, pro things. Tie Fighter is also still playable, even in a brighter room than my studio, thanks to the bump in contrast and max brightness this screen has gotten over the previous Surface Book. And the speakers flanking that display hit you with a lot of sound for their small size. It's certainly enough to drown out the machine's occasional fan noise. (video game sounds) Now even a game that's 20 years old will run down a battery, so it's fortunate the Surface Book 2 has such a massive one. We're talking 80 watt hours spread across the clipboard and the base, which was enough on one particular day to see me through over nine hours of work, with the brightness at suggested, the usual mix of Spotify, Slack and Evernote, and about 12 tabs open in Chrome. When you do have to charge it back up, the system will top up the clipboard battery first, followed by the base, and yes, the Surface connect port is still magnetic, in case you trip over it. It's also possible to charge on the go, thanks to the addition of a USB-C port that supports power delivery. Just don't expect any miracles. My 30 watt anchor power cord was only able to give me a 7% boost over an hour of charging. That's understandable given how much power this machine draws, but less forgivable is the lack of Thunderbolt 3, which most other devices in this class do include. That omission makes for slower data throughput, and it means you won't be able to use the laptop with some newer accessories. Regrettable on a notebook this expensive. (funky music) I keep saying notebook, and laptop, but if you spill a lot of digital ink, you'll appreciate the fact that the clipboard is totally independent. Just like last year, this is the computer. Assuming you wanna spend an extra 100 bucks, you can use the Surface pen to kick out some art work, or sign PDFs. But, well, if the 13 inch Surface Book seems awkwardly huge in clipboard mode, which it does, then the 15 inch one feels positively preposterous. For me, it's much more useful to flip it around and plug it in backward, which lets the base serve as a stand, and also gives you access to it's graphics processor, the big battery, and all the ports. Oh, including a full size SD slot. Don't think I didn't appreciate that. Microsoft said it had to redesign the hinge to bear the added weight of the 15 inch clipboard, but I still found myself wishing for less wobble when I used it as a touch screen. On the other hand, the current design let's the machine pass the one handed opening test just barely. So, as usual, it's a compromise. My final few impressions paint the familiar picture of an iterative upgrade. The keyboard is just as comfy as the last one, and the lack of media controls on it are just as annoying. Lap ability is okay for a bigger machine, though it is still top heavy. Windows Hello is super fast on this machine. Maybe thanks in part to a better front facing camera. And while Microsoft sent over two very comfortable mice, the Surface Precision, and my favorite, ARK mouse for travel, the Book 2s track pad was smooth and precise enough that I seldom had use for either of them. So should you buy it? Well for once it's not that hard a question to answer. If you need a typical laptop for conventional work, and you don't want to spend a ton, then no. There's no shortage of affordable alternatives, most of which will be more portable than even the 13 inch Surface Book 2. These are big machines. You can also find similar features in the Lenovo Yoga 920, and the Spectre X360 from HP. But if you need this exact cocktail of a powerful PC with discreet graphics, and a detachable pen enabled tablet, the Surface Book 2 really is a one of a kind thing. And yeah, I think it's worth it. Even for someone like me, who doesn't care about the pen and never takes off the clipboard. The combination of ports, with the big battery, and great display, and very nice attention to detail, makes for an alluring alternative to the new MacBook Pro. When you top it off with the bloat free build of Windows 10 and this crisp, industrial design that looks like nothing else out there... Well, I said it at the top, didn't I? There's just something about the Surface. And no matter what machine you use, today's sponsor can help you use it to surf securely. NordVPN let's you browse privately with double data encryption and unlimited bandwidth. The company doesn't log your data, but it does stay available round the clock with 24-7 customer care. You can use NordVPN on an IOS, Android, Windows, Mac, there's even a Chrome extension to secure your browsing in seconds. I've been using it for about two weeks to keep my coffee shop scripting sessions safe, and it's been great. If you wanna check it out, there's a 30 day money back guarantee, and you can get 77% off a three year plan. But only if you click the link in the description. NordVPN.com/mrmobile; that's M, R, M, O, B, I, L, E. And a big thanks to NordVPN for sponsoring this video. Folks, please subscribe and share this video if you enjoyed it, and let me know if you're buying a Surface, or something else, or sticking with what you've got. Until next time. Thanks for watching. And stay mobile, my friends.",
    "transcript_keywords": [
        "Surface Book",
        "inch Surface Book",
        "Surface",
        "Book",
        "previous Surface Book",
        "inch Surface",
        "Surface Pro",
        "Surface laptop",
        "Surface Precision",
        "Surface connect port",
        "machine",
        "clipboard",
        "Surface pen",
        "laptop",
        "Windows",
        "top",
        "previous Surface",
        "Tie Fighter",
        "Surface connect",
        "fortunate the Surface"
    ],
    "transcript_entities": [
        [
            "Thunderbolt 3",
            "PRODUCT"
        ],
        [
            "80 watt hours",
            "TIME"
        ],
        [
            "a ton",
            "QUANTITY"
        ],
        [
            "7%",
            "PERCENT"
        ],
        [
            "Surface Book 2",
            "WORK_OF_ART"
        ],
        [
            "the Surface Book",
            "EVENT"
        ],
        [
            "ARK",
            "ORG"
        ],
        [
            "30 day",
            "DATE"
        ],
        [
            "77%",
            "PERCENT"
        ],
        [
            "15 inch",
            "QUANTITY"
        ],
        [
            "Microsoft",
            "ORG"
        ],
        [
            "HP",
            "ORG"
        ],
        [
            "the Surface Book 2 Review",
            "ORG"
        ],
        [
            "USBA",
            "ORG"
        ],
        [
            "Slack",
            "ORG"
        ],
        [
            "MacBook Pro",
            "ORG"
        ],
        [
            "Spectre",
            "PERSON"
        ],
        [
            "an hour",
            "TIME"
        ],
        [
            "last year",
            "DATE"
        ],
        [
            "2018",
            "DATE"
        ],
        [
            "the 15 inch",
            "QUANTITY"
        ],
        [
            "about two weeks",
            "DATE"
        ],
        [
            "30 watt",
            "QUANTITY"
        ],
        [
            "the Surface Book 2",
            "ORG"
        ],
        [
            "one particular day",
            "DATE"
        ],
        [
            "Mobile",
            "PERSON"
        ],
        [
            "Doom",
            "PERSON"
        ],
        [
            "three year",
            "DATE"
        ],
        [
            "1995",
            "DATE"
        ],
        [
            "the Surface Book 2",
            "EVENT"
        ],
        [
            "24-7",
            "CARDINAL"
        ],
        [
            "Windows Central",
            "ORG"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "Windows, Mac",
            "ORG"
        ],
        [
            "2",
            "CARDINAL"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "Tie Fighter",
            "ORG"
        ],
        [
            "max",
            "PERSON"
        ],
        [
            "2s",
            "CARDINAL"
        ],
        [
            "TLDR",
            "ORG"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "20 years old",
            "DATE"
        ],
        [
            "IOS",
            "ORG"
        ],
        [
            "about 12",
            "CARDINAL"
        ],
        [
            "The Surface Book 2",
            "WORK_OF_ART"
        ],
        [
            "Surface",
            "ORG"
        ],
        [
            "Gears of War 4",
            "PRODUCT"
        ],
        [
            "Windows 10",
            "PRODUCT"
        ],
        [
            "920",
            "CARDINAL"
        ],
        [
            "Chrome",
            "ORG"
        ],
        [
            "Spotify",
            "GPE"
        ],
        [
            "the Surface Pro",
            "ORG"
        ],
        [
            "an extra 100 bucks",
            "MONEY"
        ],
        [
            "November",
            "DATE"
        ],
        [
            "the Surface Precision",
            "ORG"
        ],
        [
            "over nine hours",
            "TIME"
        ],
        [
            "SD",
            "ORG"
        ],
        [
            "13 inch",
            "QUANTITY"
        ],
        [
            "Android",
            "ORG"
        ],
        [
            "seconds",
            "TIME"
        ],
        [
            "Surface Book",
            "WORK_OF_ART"
        ]
    ]
}