{
    "video_id": "dGa5d8C-ko4",
    "title": "Samsung's New Gear To Keep You Fit [Hands-On]",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-08-30T16:00:31Z",
    "video_url": "https://www.youtube.com/watch?v=dGa5d8C-ko4",
    "category": "Science & Technology",
    "tags": [
        "gear sport",
        "samsung gear sport review",
        "fit2 pro",
        "samsung icon x 2018",
        "icon x review",
        "fit2 pro review",
        "gear sport hands on",
        "samsung gear fit",
        "samsung fit2 pro",
        "mrmobile",
        "michael fisher",
        "ifa 2017"
    ],
    "views": 109205,
    "likes": 4123,
    "comments_count": 225,
    "description": "Samsung’s Gear Sport, Gear Fit2 Pro and Icon X are all variations of designs we’ve seen before. The Gear Sport is an evolution of the Gear S3 Frontier, Samsung’s outdoor smartwatch I *reviewed* last year. I didn’t get as close a look at the Gear Fit2 or the Icon X earbuds – but maybe that’s just as well given how much the newer models improve upon their forebears. With MIL-STD 810G durability and 5ATM water resistance the Gear Sport and Fit2 Pro bring a strong outdoor game, while the 2018 revision of the Icon X earbuds improves battery life many times over. All that’s pretty exciting stuff even for a non-athlete such as myself – and to hear Samsung tell it, that’s kind of the whole idea.\n\n\n[SUBSCRIBE]\n\nhttps://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1\n\n\n[ABOUT THE SAMSUNG GEAR SPORT / FIT2 PRO / ICON X 2018 HANDS-ON]\n\nFilmed on location in Berlin, Germany at IFA 2017, with preproduction samples on loan from Samsung.\n\n\n[MUSIC]\n\n“Robot Town” by Phil Gardiner, available at Premium Beat:\nhttps://www.premiumbeat.com/royalty_free_music/songs/robot-town\n\n\n[SOCIALIZE]\n\nhttp://facebook.com/themrmobile\nhttp://instagram.com/themrmobile\nhttp://twitter.com/themrmobile\nhttps://www.snapchat.com/add/mrmobilesnaps\nhttp://mrmobile.tech\n\n\n[DISCLOSURE]\n\nThis post may contain affiliate links. See Mobile Nations' disclosure policy for more details: http://www.mobilenations.com/external-links",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.premiumbeat.com/royalty_free_music/songs/robot-town",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Narrator] I'm Mr. Mobile and I'm in Berlin, Germany for the IFA, an annual technology convention where this year Samsung is kicking things off with a bunch of gear to help keep you fit. (upbeat techno music) Now, these are all variations on existing products, so let's start with the one that's changed the most. The Gear Sport. At first, it looks a lot like the Gear S3 Frontier, last year's big outdoor smart watch, but the Sport is smaller, with the revised casing design and a bunch of available bands, from fabric to rubber to fabric and rubber. These are 20 millimeter straps that use standard connections, so you can swap them easily. The Gear Sport casing comes in two colors and it's substantially smaller on the wrist than the S3 series, but still carries the same MIL standard, 810G durability, and now five atmosphere water resistance as well. Samsung went out of its way to say that that rating includes saltwater and it'll offer custom swim workout profiles, thanks to a new partnership with Speedo. Unfortunately, some things had to be sacrificed in the smallification of the casing. The battery is 300 milliamp hours, down from 380 on the S3. Samsung Pay is now NFC only, and there's no 4GLTE. I don't think any of those are huge sacrifices given the fitness focus here. The watch still has standalone GPS and four gigs of onboard storage, so you can download Spotify tracks and pair earbuds directly to the watch. Speaking of buds, these are the new Icon X for 2018, and, just like last year's, they pack lots of functionality into a tiny footprint. They come in black, gray, and pink and lock firmly into your ear with a twist, that takes some getting used to, but they're less likely to bounce out on a run this way. You use taps and swipes on their integrated touch pads to control both music playback and the running coach. Both will work even if you don't bring your phone along with you, since the buds pack four gigs of storage a piece. If you do have your newer Samsung phone along, the buds will also talk to Bixby to help you manage your workout. This year, battery life has been expanded. Samsung promises up to six hours of music playback in stand alone mode, five hours of bluetooth streaming, and four hours of talk time, with a battery case that provides one additional full charge on the go. The new Icon X and Gear Sport go on sale later this year, but if you don't want to wait that long to map your run, the Gear Fit 2 Pro will be on shelves much sooner. This is the last product Samsung showed off here and, again, it's a sequel to a familiar design. This year with a more conventional clasp to prevent it from popping of your wrist as easily. Again, we have four gigs of onboard storage, five atmosphere water resistance, MIL standard 810g durability, and stand alone GPS support. So, you can sync it with your Spotify account for music on the go, and also use it with MapMyRun, and the whole Under Armour fitness suite, just in case Samsung's own health hub isn't your bag. There's also a continuous heart-rate tracking available, but given the smaller battery relative to the watch you'll want to wait for a full review to see how it holds up in the real world. Samsung says it wants to help people live healthier and well-balanced lives with this stuff. Achieving that takes a lot more than slapping on some tech, but if you're already on your way I can see how this gear would be very tempting. The Gear Fit 2 Pro is available for pre-sale August 31 and launches September 15 for 199 dollars. The Gear Sport and Icon X 2018 will follow in time for the holidays, no word on pricing yet. This is the first video of IFA 2017 and the show proper is still days away. Follow The Mr. Mobile on the socials for up to the minute updates and subscribe on YouTube so you don't miss what's next from Berlin. Until next time, thanks for watching and stay mobile, my friends.",
    "transcript_keywords": [
        "annual technology convention",
        "Gear Sport",
        "Gear Sport casing",
        "gear",
        "Samsung",
        "Sport",
        "annual technology",
        "technology convention",
        "Gear Fit",
        "Germany",
        "year",
        "Sport casing",
        "MIL standard",
        "kicking things",
        "Icon",
        "watch",
        "hours",
        "battery",
        "fit",
        "year Samsung"
    ],
    "transcript_entities": [
        [
            "The Gear Sport",
            "ORG"
        ],
        [
            "2017",
            "DATE"
        ],
        [
            "August 31",
            "DATE"
        ],
        [
            "The Gear Sport",
            "EVENT"
        ],
        [
            "last year's",
            "DATE"
        ],
        [
            "September 15",
            "DATE"
        ],
        [
            "Bixby",
            "GPE"
        ],
        [
            "Gear Fit 2 Pro",
            "LAW"
        ],
        [
            "810",
            "CARDINAL"
        ],
        [
            "Samsung",
            "ORG"
        ],
        [
            "Berlin",
            "GPE"
        ],
        [
            "Spotify",
            "ORG"
        ],
        [
            "20 millimeter",
            "QUANTITY"
        ],
        [
            "up to six hours",
            "TIME"
        ],
        [
            "MIL",
            "NORP"
        ],
        [
            "2018",
            "DATE"
        ],
        [
            "four hours",
            "TIME"
        ],
        [
            "MIL",
            "CARDINAL"
        ],
        [
            "YouTube",
            "ORG"
        ],
        [
            "four",
            "CARDINAL"
        ],
        [
            "S3",
            "ORG"
        ],
        [
            "Mobile",
            "PERSON"
        ],
        [
            "380",
            "CARDINAL"
        ],
        [
            "this year",
            "DATE"
        ],
        [
            "annual",
            "DATE"
        ],
        [
            "199 dollars",
            "MONEY"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "five",
            "CARDINAL"
        ],
        [
            "MapMyRun",
            "ORG"
        ],
        [
            "GPS",
            "PRODUCT"
        ],
        [
            "IFA",
            "ORG"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "five hours",
            "TIME"
        ],
        [
            "later this year",
            "DATE"
        ],
        [
            "up to the minute",
            "TIME"
        ],
        [
            "the Gear S3 Frontier",
            "ORG"
        ],
        [
            "Speedo",
            "ORG"
        ],
        [
            "NFC",
            "ORG"
        ],
        [
            "This year",
            "DATE"
        ],
        [
            "300 milliamp hours",
            "QUANTITY"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "Germany",
            "GPE"
        ]
    ]
}