{
    "video_id": "DWpDh12rcCU",
    "title": "Black Friday Tech Deals 2016",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-11-23T19:11:57Z",
    "video_url": "https://www.youtube.com/watch?v=DWpDh12rcCU",
    "category": "People & Blogs",
    "tags": [
        "black friday 2016",
        "black friday tech",
        "black friday 2016 deals",
        "black friday 2016 haul",
        "iphone 7",
        "galaxy s7",
        "gear s3",
        "moto z",
        "smartphone deals",
        "surface book",
        "surface pro 4",
        "microsoft deals",
        "samsung deals",
        "apple watch",
        "mrmobile",
        "michael fisher",
        "cyber monday tech deals",
        "cyber monday 2016",
        "cyber monday tech"
    ],
    "views": 216830,
    "likes": 4734,
    "comments_count": 274,
    "description": "In 2016, Black Friday and Cyber Monday have blended into a four-day span of deals that might mean big saving for tech fans – at least those with quick \"Buy Now\" fingers. Whether you're looking to snag a smartphone on the cheap or shave a couple hundo off the latest Surface, MrMobile's got you covered with the guide to the best Black Friday Tech Deals of 2016! \n\nBecause these deals are constantly shifting, be sure to follow up-to-the-minute developments on the Black Friday 2016 Best Deals Guide: http://www.windowscentral.com/black-friday-2016-deals\n\n\n[SUBSCRIBE]\n\nhttps://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1\n\n\n[PRODUCTS IN THIS VIDEO]\n\n\n*Wearables*\n\nSamsung Gear S3 Classic:\nhttp://mrmobile.tech/5k\n\nSamsung Gear S3 Frontier:\nhttp://mrmobile.tech/5l\n\nHuawei Watch:\nhttp://mrmobile.tech/5j\n\n\n*Smartphones*\n\niPhone 7 at Best Buy:\nhttp://mrmobile.tech/5m\n\nGalaxy S7 at Best Buy:\nhttp://mrmobile.tech/5n\n\nIDOL 4S $50 off at Amazon:\nhttp://mrmobile.tech/5p\n\nAXON 7 $50 off at zteusa (Nov 28 - Dec 4):\nhttps://www.zteusa.com/\n\nHonor 8 for $289 at Amazon:\nhttp://mrmobile.tech/5q\n\nHTC 10 $200 off:\nhttp://mrmobile.tech/y\n\n\n*Convertibles*\n\nSurface Pro 4 Core i5:\nhttp://mrmobile.tech/5s\n\nSurface Book Core i5:\nhttp://mrmobile.tech/5r\n\n\n*Accessories*\n\nVINCI Hearable Super-Early-Bird Special:\nhttp://mrmobile.tech/5t\n\nRAVPower 22000mAh power pack:\nhttp://mrmobile.tech/5u\n(If BF availability has passed, use discount code: \"MrMobile\" for $3 off) \n\nScottevest:\nhttp://mrmobile.tech/5w\nDiscount Code CYBER16\n\n\n*Additional Sites*\n\nApple Black Friday 2016 Deals page:\nhttp://www.apple.com/shop/gifts/one-day-shopping-event\n\nMotorola Black Friday 2016 Deals page:\nhttps://www.motorola.com/us/specials\n\nT-Mobile Black Friday 2016 Deals page:\nhttps://www.t-mobile.com/offers/deals-hub.html\n\nVerizon Wireless Black Friday 2016 Deals page:\nhttps://www.verizonwireless.com/black-friday/\n\n\n[MUSIC]\n\n\"The Ballad of MrMobile.\" Mobile Nations, 2016\n\n\"Microchip\" and \"Move Ya,\" available in the YouTube Media Library\n\n\n[SOCIALIZE]\n\nhttp://facebook.com/themrmobile\nhttp://instagram.com/themrmobile\nhttp://twitter.com/themrmobile\nhttps://www.snapchat.com/add/mrmobilesnaps\nhttp://mrmobile.tech\n\n\n[DISCLOSURE]\n\nThis post may contain affiliate links. See Mobile Nations' disclosure policy for more details: http://www.mobilenations.com/external-links",
    "description_links": [
        "http://www.windowscentral.com/black-friday-2016-deals",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/5k",
        "http://mrmobile.tech/5l",
        "http://mrmobile.tech/5j",
        "http://mrmobile.tech/5m",
        "http://mrmobile.tech/5n",
        "http://mrmobile.tech/5p",
        "https://www.zteusa.com/",
        "http://mrmobile.tech/5q",
        "http://mrmobile.tech/y",
        "http://mrmobile.tech/5s",
        "http://mrmobile.tech/5r",
        "http://mrmobile.tech/5t",
        "http://mrmobile.tech/5u",
        "http://mrmobile.tech/5w",
        "http://www.apple.com/shop/gifts/one-day-shopping-event",
        "https://www.motorola.com/us/specials",
        "https://www.t-mobile.com/offers/deals-hub.html",
        "https://www.verizonwireless.com/black-friday/",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] I've never, ever gone shopping on Black Friday, and that's a record I hope to keep up till my last holiday season. But it's still one of the biggest shopping days of the year, and there are some great deals out there on some of the hottest gadgets I've covered as MrMobile. So these are my Black Friday picks for 2016. (upbeat music) Let's start with smartwatches and work our way up. The Samsung Gear S3 is probably the most talked about Black Friday deal in wearables because the watch is so new, it just launched a few days ago, and it'll eventually be compatible with iPhones as well as Android. But despite the $50 savings and excellent feature set, $299 is still up there. If you're looking to save some more dough, Huawei is the way to go. The Huawei Watch has seen a price cut of a 100 bucks to make it $199. My personal favorite Android wear watch is the Moto 360, but it's already sold out in its discounted trims. Same with this excellent deal on the Pebble 2 at Best Buy. So don't dawdle on smartwatch deals just because you may have heard they're not selling well. And Apple might announce a discount on the new Apple Watch series too, but those price cuts are usually pretty thin. Pro tip, go for the Series 1 to save some money in exchange for not too many lost features versus Series 2. In the smartphone category, the more exciting stuff comes at a cost, even on Black Friday. You'll get a $250 gift card if you buy the iPhone 7 at Best Buy or Target on an installment plan. You can find the same $250 savings on the Moto Z family at motorola.com but only if you bundle the phone with one of the more expensive Moto Mods. Sure, it's cool to get a Projector Mod or a camera attachment for almost nothing, but frankly, these phones are still pricey if you're shopping unlocked. Then you've Samsung's Galaxy S7 due for replacement in the spring, but still one of the best Android phones around. Several retailers are offering it in conjunction with, you guessed it, a $250 gift card, and Best Buy will give you more if you trade in a working phone. But, surprisingly, it's Target that really goes the extra mile. Activate a Galaxy S7 on Verizon, AT&T, or Sprint at a Target Mobile location and you'll get the $250 gift card, plus a free Gear VR headset, and $50 in Oculus VR software for that headset. That's a lot a swag. For me, though, things are much more exciting in that $400 smartphone segment I covered a few weeks back. Phones like the IDOL 4S and AXON 7 will be $50 off on either Black Friday or Cyber Monday, which is cool, but I prefer the Honor 8 to both of those, and it's getting a price drop to $300, which is a great price for a phone that capable. Personally, though, I'm more drawn to the discount on the HTC 10. While it's as old as the Galaxy S7 and missing several of that phone's features, I called the 10 the best Android phone you're not buying a few months back, and the price tag was a significant factor. At $499 it's an easier sell, specially since you're not messing with gift cards or activations when you buy it unlocked at htc.com. Remember that I tend to prefer unlocked phones. If you buy your phones from your carrier, you should absolutely check with them, specially if you're on Verizon or T-Mobile. That Moto Z I talked about before can be had for under $300 with Verizon service, and the Google Pixel, a really wonderful, but usually expensive phone, can be had for $240 after a bill credit. Meanwhile, T-Mobile is offering a free iPhone 7 or Galaxy S7 when you trade in your phone and pick up one of their new unlimited plans. Of course there's a ton of fine print with each offer, so make sure to read that before you pull the trigger. I haven't looked at many standalone tablets this year, so there isn't one I can straight up recommend. But convertibles are another story. I lump the smaller iPad Pro into this category because when you add a keyboard dock, it's a very capable road warrior, and iMore was able to find it for $50 off. As usual, discounts on Apple products are pretty anemic. To save more on computers that do more, you need to go over to Microsoft. The mid-range configuration of the Surface Pro 4, which I used back in the summer, is on sale for $799 through Microsoft, Newegg, and Staples. That's a solid deal if you're a Windows user, specially since it comes bundled with the Type Cover. If you're looking for more of a laptop, there's the Surface Book. Again, it's the mid-range version, not the cutting edge one with the Performance Base that I recently reviewed, but it's still a very beautiful, very capable machine with a unique pen experience, and it's $300 off. Of course the Surface line is the premium brand, so you don't have to look far to find much cheaper PCs from the likes of HP, Dell, and Lenovo. Windows Central has the scoop on those. Wrapping it up with accessories, I'm still waiting for Bose to drop its price on the QC35, my favorite pair of headphones ever. In the meantime, the far more elaborate and far less finished VINCI is going for 50% off on its Kickstarter page. As usual, there are plenty of Amazon deals to be found in the world of portable power, including RAVPower's 22000 milliamp hour battery pack for $39.99. And to carry all this stuff, you're gonna need a lot of pockets. Most of the SCOTTeVEST clothing catalog is on sale in an early Cyber Monday promotion. Use offer code CYBER16 at scottevest.com. With this guide I mainly stuck with products I reviewed, or at least handled. There's a lot more savings where this stuff came from, and it's all at the 2016 Black Friday Deals Guide at Mobile Nations. That link, along with the link to every product in this video, is in the description below. And, hey, share the deals you found with me and everyone else watching this, or leave a comment down below. Until next time. Stay safe and sane if you venture out on Black Friday this year. Thanks for watching. And stay mobile, my friends. (upbeat tune)",
    "transcript_keywords": [
        "Black Friday",
        "Black Friday deal",
        "Black",
        "Friday",
        "Black Friday picks",
        "holiday season",
        "record I hope",
        "phone",
        "Buy",
        "Apple Watch series",
        "Friday Deals Guide",
        "phones",
        "Android",
        "price",
        "deals",
        "Moto",
        "watch",
        "Friday deal",
        "Galaxy",
        "biggest shopping days"
    ],
    "transcript_entities": [
        [
            "Lenovo",
            "ORG"
        ],
        [
            "Dell",
            "ORG"
        ],
        [
            "Black Friday",
            "ORG"
        ],
        [
            "799",
            "MONEY"
        ],
        [
            "a few months back",
            "DATE"
        ],
        [
            "Microsoft",
            "ORG"
        ],
        [
            "199",
            "MONEY"
        ],
        [
            "a Projector Mod",
            "WORK_OF_ART"
        ],
        [
            "this year",
            "DATE"
        ],
        [
            "Best Buy",
            "ORG"
        ],
        [
            "Michael",
            "PERSON"
        ],
        [
            "Galaxy S7",
            "PRODUCT"
        ],
        [
            "Target",
            "PERSON"
        ],
        [
            "The Samsung Gear S3",
            "ORG"
        ],
        [
            "MrMobile",
            "PERSON"
        ],
        [
            "Windows",
            "PRODUCT"
        ],
        [
            "RAVPower",
            "ORG"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "Android",
            "ORG"
        ],
        [
            "8",
            "CARDINAL"
        ],
        [
            "22000",
            "CARDINAL"
        ],
        [
            "a few days ago",
            "DATE"
        ],
        [
            "Newegg",
            "ORG"
        ],
        [
            "Samsung",
            "ORG"
        ],
        [
            "iMore",
            "ORG"
        ],
        [
            "the 2016 Black Friday Deals Guide at Mobile Nations",
            "ORG"
        ],
        [
            "Apple Watch",
            "ORG"
        ],
        [
            "10",
            "CARDINAL"
        ],
        [
            "the Google Pixel",
            "ORG"
        ],
        [
            "Moto Z",
            "ORG"
        ],
        [
            "Windows Central",
            "ORG"
        ],
        [
            "2",
            "CARDINAL"
        ],
        [
            "Kickstarter",
            "ORG"
        ],
        [
            "Moto Mods",
            "ORG"
        ],
        [
            "250",
            "MONEY"
        ],
        [
            "HTC",
            "ORG"
        ],
        [
            "IDOL",
            "ORG"
        ],
        [
            "the Surface Book",
            "WORK_OF_ART"
        ],
        [
            "300",
            "MONEY"
        ],
        [
            "iPhone 7",
            "ORG"
        ],
        [
            "Sprint",
            "ORG"
        ],
        [
            "100 bucks",
            "MONEY"
        ],
        [
            "Huawei",
            "ORG"
        ],
        [
            "4S",
            "CARDINAL"
        ],
        [
            "Bose",
            "ORG"
        ],
        [
            "T-Mobile",
            "ORG"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "AT&T",
            "ORG"
        ],
        [
            "Monday",
            "DATE"
        ],
        [
            "Target Mobile",
            "ORG"
        ],
        [
            "the Performance Base",
            "ORG"
        ],
        [
            "the Series",
            "EVENT"
        ],
        [
            "the Pebble 2",
            "EVENT"
        ],
        [
            "Cyber",
            "ORG"
        ],
        [
            "499",
            "MONEY"
        ],
        [
            "the Galaxy S7",
            "ORG"
        ],
        [
            "39.99",
            "MONEY"
        ],
        [
            "50",
            "MONEY"
        ],
        [
            "the summer",
            "DATE"
        ],
        [
            "a ton",
            "QUANTITY"
        ],
        [
            "iPhones",
            "NORP"
        ],
        [
            "the iPhone 7",
            "EVENT"
        ],
        [
            "The Huawei Watch",
            "ORG"
        ],
        [
            "240",
            "MONEY"
        ],
        [
            "Verizon",
            "ORG"
        ],
        [
            "Black Friday",
            "EVENT"
        ],
        [
            "HP",
            "ORG"
        ],
        [
            "a few weeks",
            "DATE"
        ],
        [
            "299",
            "MONEY"
        ],
        [
            "Gear VR",
            "ORG"
        ],
        [
            "2016",
            "DATE"
        ],
        [
            "400",
            "MONEY"
        ],
        [
            "iPad Pro",
            "PRODUCT"
        ],
        [
            "under $300",
            "MONEY"
        ],
        [
            "50%",
            "PERCENT"
        ],
        [
            "Surface",
            "ORG"
        ],
        [
            "VINCI",
            "ORG"
        ],
        [
            "the spring",
            "DATE"
        ],
        [
            "the Surface Pro 4",
            "ORG"
        ],
        [
            "Oculus VR",
            "ORG"
        ],
        [
            "Amazon",
            "ORG"
        ]
    ]
}