{
    "video_id": "TnmIJjuw_kQ",
    "title": "SPACES: MrMobile Tries Co-Working",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-03-21T21:35:35Z",
    "video_url": "https://www.youtube.com/watch?v=TnmIJjuw_kQ",
    "category": "People & Blogs",
    "tags": [
        "co-working",
        "coworking space",
        "co-working space",
        "space coworking",
        "regus",
        "mrmobile",
        "michael fisher",
        "spaces coworking",
        "spaces co-working",
        "spacesworks",
        "spaces works",
        "shared office review",
        "boston",
        "wework",
        "workbar"
    ],
    "views": 75529,
    "likes": 3631,
    "comments_count": 171,
    "description": "[SPONSOR] This video brought to you by MintSIM, the new choice for high-speed LTE in the US. Head to http://mintsim.com and use discount code MRMOBILE20 for 20% off on a 6- or 12-month plan! \n\n\nWorking from home is fantastic. No co-workers messing up your flow. Unlimited coffee breaks. And best of all: Business up top, PJs on the bottom. But some folks need a workplace with more human contact, or a conference room that’s not also their kitchen. Others just need more … Space. I’m Michael Fisher and I spent a week at Spaces on Newbury, the newest co-working office in Boston. What's co-working, you ask? Why should you pay for the privilege of sharing an office with strangers? Watch MrMobile's first co-working video for the answers to those questions and more. This is a look at Spaces – a different way to work! \n\nMore info on Spaces here: http://bit.ly/SBoston\n\n\n[SUBSCRIBE]\n\nhttps://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1\n\n\n[ABOUT THE SPACES VIDEO]\n\nMrMobile's Spaces Co-Working video was produced following six days working from the Spaces office on Newbury Street in Boston, MA. MrMobile was not charged for access, nor was he paid or otherwise compensated for this coverage. \n\n\n[LINKS]\n\nLearn more about Spaces Co-Working here:\nhttp://bit.ly/SBoston\n\n\n[MUSIC]\n\n\"The Ballad of MrMobile.\" Mobile Nations, 2016\n\n“E-Business” by Olive Musique, available at Premium Beat: https://www.premiumbeat.com/royalty_free_music/songs/e-business\n\n\"Cutting Edge Technology\" by Olive Musique, available at Premium Beat: https://www.premiumbeat.com/royalty_free_music/songs/cutting-edge-technology\n\n\n[SOCIALIZE]\n\nhttp://facebook.com/themrmobile\nhttp://instagram.com/themrmobile\nhttp://twitter.com/themrmobile\nhttps://www.snapchat.com/add/mrmobilesnaps\nhttp://mrmobile.tech\n\n\n[THUMBNAIL]\n\nCustom thumbnail by Jose Negron, Mobile Nations\n\n\n[DISCLOSURE]\n\nThis post may contain affiliate links. See Mobile Nations' disclosure policy for more details: http://www.mobilenations.com/external-links",
    "description_links": [
        "http://mintsim.com",
        "http://bit.ly/SBoston",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://bit.ly/SBoston",
        "https://www.premiumbeat.com/royalty_free_music/songs/e-business",
        "https://www.premiumbeat.com/royalty_free_music/songs/cutting-edge-technology",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- Working from home sounds really cool, and well, it is. No coworkers messing with your flow, unlimited coffee breaks, and best of all, business up top, PJs on the bottom. But some folks need a workplace with more human contact or a conference room that's not also their kitchen. Others just need more space. I'm Michael Fisher and I spent a week at the newest co-working office in Boston. This is a look at Spaces, brought to you by Mint SIM. (light music) Spaces is a contemporary take on co-working, the use of an office by people who are self-employed or working for different employers to share equipment, ideas and knowledge. So, it's a kind of corporate commune, but, like, way cooler than that makes it sound. Practically speaking, the equipment sharing is handy. I mean, I don't wanna buy or maintain my own copy machines and it's nice to have someone else making the coffee and buying the hummus. But the fun part for me is the people. At a typical office, most everyone you see is working for the same company. At a place like Spaces, everyone does something different. In my week there, I met software developers, advertising people, lawyers, direct mailing folks, and at least one artist. Now, I was visiting this location right at the start of its life, so, while I wasn't able to capture as much of the community feel as I'd like, it was already starting to come together by the time I wrapped up. While Spaces has a lot of locations across the US, this particular one spans three stories of an office building on Boston's capital of window shopping, Newbury Street. And you know, that address turns out to be surprisingly important. When I talked to some of the early tenants about why they chose co-working instead of a more conventional office, a little over half of them mentioned the location as a central factor. Apparently even in our Internet-dominated modern world, street addresses on business cards still mean something. For more traditional businesses, it's preferable to invite someone to a meeting in a place like this, rather than a coffee shop. And if the tchotchke-stocked faux living room spaces just won't do for you, conference rooms are available in a variety of styles, and they come equipped with the usual accoutrement like widescreens and whiteboards. And of course, people will always need their own spaces, so in addition to the communal nooks and lobbies, the location I visited offers 90 private offices with locking doors and 390 dedicated desks for rent across its three floors. Now, private is somewhat generous in that the walls are glass, and while the sound insulation is good, it's not great. If you're more into the open workplace kind of thing, you can save some scratch by opting for a desk only. You get one workstation, one locker, and access to the public areas too. Spaces calls this area the Business Club. If you follow me on Twitter or Periscope, you may recall my hunt for studio space when I was launching Mr. Mobile last year, and at one point, I was tempted by another co-working company called WeWork. I liked its atmosphere, and I loved the restored factory it was built in. Spaces on Newbury is decorated very nicely, as well. I shot the AT&T Push to Talk video in here and I'm really pleased with the end result. But ultimately, Mr. Mobile ended up in a more traditional commercial building, and the main reason for that was floor area. I needed a lot of it, and co-working outfits aren't exactly competitive at first glance. At Spaces on Newbury, desks start at $525 a month, while office rentals start at $750 a month, and conference rooms go for $10 per person per hour. There are a ton of packages available. Now, keep in mind, those prices reflect things like the desirable address, and also perks like unlimited high-speed Internet, 5,000 square feet of Business Club, and free bikes. When you combine that with 24/7 access, a flexible contract term, and exposure to all kinds of people across different fields, it's easy to see why some folks prefer co-working. Get back to work. There are many co-working spaces across the cities of the U.S., but since Spaces was my host for a week, Spaces is the only one I'm linking to in the description. Check 'em out if you want. No promotional consideration has been paid for this video. Unless you count the free hummus. Today's actual sponsor is Mint SIM, the new way to get high-speed LTE in the U.S. Head over to MintSIM.com and use the discount codes in the description for premium quality service on a premium quality network for a fraction of the price. Until next time, thanks for watching, and stay mobile, my friends. Tons of fun.",
    "transcript_keywords": [
        "Spaces",
        "coworking",
        "office",
        "people",
        "Business Club",
        "Mint SIM",
        "business",
        "home sounds",
        "Newbury",
        "Michael Fisher",
        "coworking spaces",
        "space",
        "Mobile",
        "room spaces",
        "Working",
        "location",
        "coffee",
        "folks",
        "week",
        "Boston"
    ],
    "transcript_entities": [
        [
            "Today",
            "DATE"
        ],
        [
            "a ton",
            "QUANTITY"
        ],
        [
            "10",
            "MONEY"
        ],
        [
            "LTE",
            "ORG"
        ],
        [
            "24/7",
            "CARDINAL"
        ],
        [
            "Michael Fisher",
            "PERSON"
        ],
        [
            "at least one",
            "CARDINAL"
        ],
        [
            "750",
            "MONEY"
        ],
        [
            "390",
            "CARDINAL"
        ],
        [
            "5,000 square feet",
            "QUANTITY"
        ],
        [
            "a week",
            "DATE"
        ],
        [
            "last year",
            "DATE"
        ],
        [
            "90",
            "CARDINAL"
        ],
        [
            "my week",
            "DATE"
        ],
        [
            "the Business Club",
            "ORG"
        ],
        [
            "Mobile",
            "PERSON"
        ],
        [
            "a little over half",
            "CARDINAL"
        ],
        [
            "525",
            "MONEY"
        ],
        [
            "US",
            "GPE"
        ],
        [
            "Boston",
            "GPE"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "Newbury",
            "GPE"
        ],
        [
            "U.S.",
            "GPE"
        ],
        [
            "Newbury Street",
            "FAC"
        ],
        [
            "Spaces",
            "FAC"
        ],
        [
            "WeWork",
            "ORG"
        ],
        [
            "Mint",
            "ORG"
        ],
        [
            "Business Club",
            "ORG"
        ],
        [
            "MintSIM.com",
            "ORG"
        ],
        [
            "Spaces",
            "ORG"
        ],
        [
            "Twitter",
            "ORG"
        ],
        [
            "three",
            "CARDINAL"
        ],
        [
            "one",
            "CARDINAL"
        ]
    ]
}