{
    "video_id": "unxjZGhg9dY",
    "title": "This Laptop's Best Feature Is From 2011 (And It's Awesome)",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-04-27T19:04:01Z",
    "video_url": "https://www.youtube.com/watch?v=unxjZGhg9dY",
    "category": "Science & Technology",
    "tags": [
        "huawei share 3.0",
        "huawei matebook x pro 2019",
        "huawei matebook x pro",
        "huawei onehop",
        "apple airdrop",
        "airdrop windows",
        "touch to share",
        "tap to share",
        "mrmobile",
        "michael fisher",
        "windows central"
    ],
    "views": 182039,
    "likes": 7359,
    "comments_count": 488,
    "description": "Sponsored by dbrand. Get custom skins for the MateBook X Pro 2019 [and many other devices] here: https://dbrand.com/huawei-skins\n\n\n[HUAWEI SHARE 3.0 ON THE MATEBOOK X PRO 2019]\n\nThe Huawei MateBook X Pro 2019 is such an iterative sequel to its 2018 forerunner that I almost passed up the review sample when Huawei offered it. But then I remembered how enchanted I'd been, at the PC's unveiling event, by all the possibilities unlocked by the innocuous-looking \"Huawei Share\" sticker on the chassis. A few weeks with the MateBook X Pro 2019 has convinced me that Huawei has built the best interface for sharing content across mobile and laptop devices – an interface I think every PC maker should emulate going forward.\n\n\n[SUBSCRIBE TO MRMOBILE]\n\nhttps://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1\n\n\n[ABOUT THIS VIDEO]\n\nMrMobile's Huawei Share 3.0 video was produced following two weeks with a Huawei MateBook X Pro 2019 review device on loan from Huawei. Huawei Share 3.0 was tested with a Huawei P30 Pro, Huawei Mate 20 Pro, and (unsuccessfully) with a BlackBerry KEY2. In keeping with MrMobile standard review policies, no compensation was offered or accepted and no copy approval was granted.\n\n\n[LINKS]\n\nHuawei MateBook X Pro 2019 Review [Windows Central]:\nhttps://www.windowscentral.com/huawei-matebook-x-pro-2019\n\nHow to use Android Beam [TheUnlockr]:\nhttps://www.youtube.com/watch?v=cwU4TvQEq0g\n\nKirk gives advice to Picard [Movieclips]:\nhttps://www.youtube.com/watch?v=VrJiU9BOEBI\n\nHP TouchPad commercials [Isaac Jacobs]:\nhttps://www.youtube.com/watch?v=KGbeakalXa4\n\nHuawei Responds to ... Security Flaw [Tom's Hardware]:\nhttps://www.tomshardware.com/news/microsoft-backdoor-huawei-matebook-driver,38924.html\n\n\n[PRODUCTS IN THIS VIDEO]\n\nMrMobile's Star Trek Discovery sciences jacket provided by Volante Design: http://bit.ly/2W8swBA \n\nSanDisk 256GB USB OTG:\nhttp://mrmobile.tech/50m\n\n\n[MUSIC]\n\n“Sun Shine” by Cymatix, available at Premium Beat:\nhttps://www.premiumbeat.com/royalty-free-tracks/sun-shine\n\n“E-Business” by Olive Musique, available at Premium Beat:\nhttps://www.premiumbeat.com/royalty_free_music/songs/e-business\n\n\n[SOCIALIZE]\n\nhttp://facebook.com/themrmobile\nhttp://instagram.com/themrmobile\nhttp://twitter.com/themrmobile\nhttp://mrmobile.tech\n\n\n[DISCLOSURE]\n\nThis post may contain affiliate links. See Mobile Nations' disclosure policy for more details: http://www.mobilenations.com/external-links\n\n#huaweimatebookxpro2019 #huaweimatebook #matebook #matebookxpro #matebookxpro2019 #huaweishare #airdrop",
    "description_links": [
        "https://dbrand.com/huawei-skins",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.windowscentral.com/huawei-matebook-x-pro-2019",
        "https://www.youtube.com/watch?v=cwU4TvQEq0g",
        "https://www.youtube.com/watch?v=VrJiU9BOEBI",
        "https://www.youtube.com/watch?v=KGbeakalXa4",
        "https://www.tomshardware.com/news/microsoft-backdoor-huawei-matebook-driver,38924.html",
        "http://bit.ly/2W8swBA",
        "http://mrmobile.tech/50m",
        "https://www.premiumbeat.com/royalty-free-tracks/sun-shine",
        "https://www.premiumbeat.com/royalty_free_music/songs/e-business",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "Get this. I wanted to take a break from phones for just a second to talk about a laptop, the one I'm using to record this intro. But wouldn't you know it, my favorite part about this laptop turned out to be how well it talks to phones. (smooth electronic music) Okay, so this is the Huawei MateBook X Pro 2019 and if you stuck with me through that name, you are not only a good sport but you probably noticed that it sounds familiar. You're right, it's just a refresh of last year's MateBook X Pro, from the small bezels to the hideaway webcam. While there are material improvements to things like the processor options and the Thunderbolt port, the epicenter of my excitement is this little sticker. No, not that one, this one. Sharing files directly between devices might seem like an antiquated or quant concept in our cloud-connected world. Every time I talk about an OTG thumb drive that works with phones or I complain about how hard it is to move files from an Android phone to an Apple computer, the comments section rises up to tell me that I should just be using the cloud for that. And if you're tempted to say that right now, - Let me tell you something, don't. - [Michael] Look, I love the cloud. I use it all the time. But sometimes, there's no substitute for just moving files directly. Like when you're on a train out of cellular range or on an airplane with the slowest WiFi imaginable and you don't want to get up to get your USB cable out of the overhead bin. You Apple users already know how awesome direct sharing is. Apple's AirDrop is one of the company's best innovations ever. It lets you move files from Mac to Mac and iPhone to Mac wirelessly with almost no setup. Now, Huawei Share, which has been around for a couple generations, is basically a clone of that and the new MateBook takes it a step further with a service called OneHop. Here's how it works: If you want to move a photo or a video from your phone to the MateBook, you bring up the file on your screen, tap the phone to the PC, and that's it. You're done. It instantly appears on your computer so you can edit, drop it into a presentation, whatever. If you want to move a photo in the other direction, you just reverse the process. Open it up on the computer, tap the phone, boom. If you don't hae a photo open on either device, the tap will take a screenshot on the PC and then sent it to the phone. It's kind of an edge case, but I could see it coming in handy once or twice. Maybe the craziest part of this to me is I first saw this kind of tap-to-share-feature promised eight years ago when HP announced its WebOS-powered TouchPad tablet and Pre 3 smartphone. RIP. And to be fair, we've seen versions of this since for sharing between phones. Samsung Bump and Android Beam, et cetera. But, as is often the case, the execution is what seals it. Huawei's implementation is so smooth, so fast, with just the right about of chrome to the interface that it genuinely delights me. That's not something I get to say often about Huawei software. I want this on every laptop. There's more than just OneHop included in Huawei Share 3.0. When the phone is connected to the machine using PC Manager, you get this persistent notification on the phone and it lets you do things like remotely record your PC's screen if you want. You can also do a few things without tapping, like remotely turn on your phone's HotSpot or browse the gallery. You're also supposed to be able to share clipboard contents between phone and PC, though that feature didn't seen enabled yet in the software I was running. So, what's the catch? Well, for me, it's not the much publicized security flaw found in Huawei's PC Manager. That was patched back in January. Rather, it's the exclusivity Huawei has built into the service. Right now, it only works between the MateBook X Pro, which you can buy in the USA, and a Huawei smartphone running EMUI 9 or above, which you can't buy in the USA. You need to import it. If you tap another phone to the tag, it'll just dump you to Huawei's website. Look, it makes all the sense in the world for Huawei to want to build its own ecosystem similar to Apple's. Just take one look at the MateBook's industrial design to see that the Chinese company has no problem taking inspiration from the Cupertino one. But we've recently seen companies like Microsoft pushing a lot harder for PC to Android phone integration. So to me, the next logical step is to start putting NFC SharePoints on all Windows PCs and make them compatible with most Android phones. Turnabout being fair play and all, it's about time other companies started taking pages from Huawei's book, especially when the features are this good. Folks, if you do own a Matebook X Pro or almost any modern smartphone, you can change the look of either with the help of today's sponsor. Dbrand makes custom-fitted vinyl skins to help your tech stand out and keep it scratch free. Hit the link in the description to dbrand your own device and thanks to dbrand for sponsoring this video. If you want to know what it's like to use the rest of the Huawei Matebook X Pro, folks, Daniel Rubino has a great review that covers everything from the big trackpad all the way down to the nitty gritty of PCIE lanes. Find that at Windows Central, also linked below. Please subscribe to theMrMobile if you'd like to see more videos like this and, as usual, Huawei was not granted copy approval. They saw this the same time you did, but I did take the opportunity to ask if they were ever gonna bring OneHop to other, non-Huawei branded smartphones. The company had no comment. Until next time, thanks for watching and stay mobile, my friends.",
    "transcript_keywords": [
        "Huawei",
        "phone",
        "MateBook X Pro",
        "Huawei MateBook",
        "MateBook",
        "Huawei Share",
        "Android phone",
        "phones",
        "Pro",
        "Apple",
        "Android",
        "time",
        "files",
        "Mac",
        "laptop",
        "move",
        "move files",
        "Android phone integration",
        "tap",
        "Huawei smartphone"
    ],
    "transcript_entities": [
        [
            "MateBook X Pro",
            "PRODUCT"
        ],
        [
            "Huawei",
            "ORG"
        ],
        [
            "MateBook",
            "ORG"
        ],
        [
            "Cupertino",
            "GPE"
        ],
        [
            "PCIE",
            "ORG"
        ],
        [
            "Daniel Rubino",
            "PERSON"
        ],
        [
            "last year's",
            "DATE"
        ],
        [
            "Thunderbolt",
            "FAC"
        ],
        [
            "Samsung Bump",
            "ORG"
        ],
        [
            "January",
            "DATE"
        ],
        [
            "Michael]",
            "PERSON"
        ],
        [
            "OneHop",
            "ORG"
        ],
        [
            "HP",
            "ORG"
        ],
        [
            "Microsoft",
            "ORG"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "eight years ago",
            "DATE"
        ],
        [
            "TouchPad",
            "ORG"
        ],
        [
            "Huawei Share",
            "PERSON"
        ],
        [
            "AirDrop",
            "PRODUCT"
        ],
        [
            "Mac",
            "ORG"
        ],
        [
            "USB",
            "ORG"
        ],
        [
            "Huawei Share 3.0",
            "PRODUCT"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "Windows Central",
            "ORG"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "non-Huawei",
            "ORG"
        ],
        [
            "the Huawei Matebook X Pro",
            "ORG"
        ],
        [
            "MateBook X Pro",
            "FAC"
        ],
        [
            "second",
            "ORDINAL"
        ],
        [
            "Mac to Mac",
            "ORG"
        ],
        [
            "the Huawei MateBook X Pro 2019",
            "FAC"
        ],
        [
            "NFC",
            "ORG"
        ],
        [
            "EMUI",
            "ORG"
        ],
        [
            "USA",
            "GPE"
        ],
        [
            "Chinese",
            "NORP"
        ],
        [
            "Android",
            "ORG"
        ]
    ]
}