{
    "video_id": "v1ovuLOr9Uk",
    "title": "PRIME DAY 2018: How To Do It – And What To Buy!",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-07-16T13:57:09Z",
    "video_url": "https://www.youtube.com/watch?v=v1ovuLOr9Uk",
    "category": "Science & Technology",
    "tags": [
        "prime day",
        "amazon prime day",
        "priem day 2018",
        "prime day deals",
        "prime day tech deals",
        "michael fisher",
        "mrmobile"
    ],
    "views": 111150,
    "likes": 3429,
    "comments_count": 206,
    "description": "Prime Day live deal tracker at https://www.androidcentral.com/best-amazon-prime-day-deals or visit https://www.thrifter.com\n\n___\nWhen the folks at Thrifter asked me to make a video explaining Amazon Prime Day, I was like “Prime Day?” Isn’t that the overhyped garage sale where Amazon tries to move unsold junk? That’s been my experience - but it turns out that’s just because I haven’t been doing Prime Day right. Well this year I’m gonna do it better - and I’ve collected a few tips so you can, too.\n\n\n[LIVE DEAL TRACKING]\n\nBrought to you by Thrifter. Get the latest on great deals, including up-to-the-minute buying advice on Amazon Prime Day, at https://www.androidcentral.com/best-amazon-prime-day-deals\n\n\n[LINKS]\n\nTry Amazon Prime Free:\nhttps://www.amazon.com/tryprimefree?tag=mbnx4-20\n\nAmazon Echo Dot:\nhttp://mrmobile.tech/4s0\n\nAmazon Echo Spot:\nhttp://mrmobile.tech/4rj\n\nAmazon Echo Show:\nhttp://mrmobile.tech/4rk\n\nKindle Paperwhite:\nhttp://mrmobile.tech/4rl\n\nKindle Oasis:\nhttp://mrmobile.tech/4rm\n\nKindle Unlimited:\nhttp://mrmobile.tech/4rn\n\nPrime Exclusive Phones:\nhttp://mrmobile.tech/4ro\n\nMate 10 Pro:\nhttp://mrmobile.tech/4rp\n\nFitbit Ionic:\nhttp://mrmobile.tech/4rq\n\nTicwatch Pro:\nhttp://mrmobile.tech/4rr\n\nAnker PowerCore:\nhttp://mrmobile.tech/4rs\n\nBose QC35:\nhttp://mrmobile.tech/4rt\n\nDJI Mavic Air (Fly More Combo):\nhttp://mrmobile.tech/4ru\n\nDJI Spark (Fly More Combo):\nhttp://mrmobile.tech/4rv\n\n\n[SOCIALIZE]\n\nhttp://facebook.com/themrmobile\nhttp://instagram.com/themrmobile\nhttp://twitter.com/themrmobile\nhttp://mrmobile.tech\n\n\n[DISCLOSURE]\n\nThis post may contain affiliate links. See Mobile Nations' disclosure policy for more details: http://www.mobilenations.com/external-links",
    "description_links": [
        "https://www.androidcentral.com/best-amazon-prime-day-deals",
        "https://www.thrifter.com",
        "https://www.androidcentral.com/best-amazon-prime-day-deals",
        "https://www.amazon.com/tryprimefree?tag=mbnx4-20",
        "http://mrmobile.tech/4s0",
        "http://mrmobile.tech/4rj",
        "http://mrmobile.tech/4rk",
        "http://mrmobile.tech/4rl",
        "http://mrmobile.tech/4rm",
        "http://mrmobile.tech/4rn",
        "http://mrmobile.tech/4ro",
        "http://mrmobile.tech/4rp",
        "http://mrmobile.tech/4rq",
        "http://mrmobile.tech/4rr",
        "http://mrmobile.tech/4rs",
        "http://mrmobile.tech/4rt",
        "http://mrmobile.tech/4ru",
        "http://mrmobile.tech/4rv",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- When my friends over at Thrifter asked me to make a video explaining Amazon Prime Day, I was like, Prime Day? Isn't that the overhyped garage sale where Amazon tries to move unsold junk? Well, yeah, that's been my experience. But it turns out that's just because I haven't been doing Prime Day right. Well, this year I'm gonna do it better and I've collected a few tips so you can too. (upbeat electronic music) Prime Day is basically a day-long festival of discounts on Amazon, kinda like Black Friday, except online. Wait, no, that's Cyber Monday, so it's kinda like Cyber Monday but in July. If there's one huge difference, it's this: with Prime Day, you never know what's gonna get discounted or how much until the day arrives. Now, sites like Thrifter do get tips that they sometimes leak early, but the discounts change often, so here's tip number one: you gotta be there the instant the deals go live. This year, Prime Day starts at 3:00 p.m. Eastern on July 16th, and Amazon will be refreshing its discounts, they're called Lightning Deals, every six hours. So set a calendar reminder for 3:00 p.m., 9:00 p.m., and if you're a real crazy, 3:00 a.m. If you think that sounds excessive for savings, well, it depends on how bad you wanna save money. Some of the Lightning Deals really do sell out within minutes. That'll probably be even more true this year, as Amazon is making it more expensive for sellers to run Lightning Deals, which should keep some of the lower quality stuff away while also making competition a lot fiercer the minute the deal hits. Oh, and this might sound obvious, but for first-timers, you need to be an Amazon Prime member to get the savings on Prime Day. If you're watching this before 3:00 p.m. on Prime Day, now is a good time to do that. The link is in the description. So what kind of stuff can we expect to go on sale this year? Well, one of the best ways to figure that out is to look at what sold the most on last year's Prime Day, and unsurprisingly, Amazon's own products tend to get pushed the most. Last year the runaway hit was the Amazon Echo Dot, Alexa's little hockey puck home. It's got none of the personality of a social robot like Jibo, but it's also about 94% less expensive and a lot more useful. If you like a screen with your assistant, the Echo Show has been discounted the whole week leading up to Prime Day, so keep an eye out for additional details on that or its rounder sibling, the Echo Spot. Oh, and bonus tip, if you already own an Alexa powered device, that's actually another way to save money on Prime Day. Last year, some of the discounts were voice exclusive, meaning you needed to buy by talking to Alexa in order to secure them. And some of them showed up hours earlier than Prime Day's official start. If you've got an Alexa device, try it again this year. Just ask, Alexa, what are your deals? And she'll tell you. Remember that Amazon also owns Kindle, so look for a $40 discount on the Kindle Paperwhite and on the subscription service that powers it. That's called Kindle Unlimited, and the company has cut the price by 40%. That gives you access to 1.4 million titles in the Kindle Library plus whatever audiobook versions are available. And remember, if you don't wanna spring for a Kindle device, you can read through the Kindle app on your phone or tablet. Amazon is offering a three-month trial of Kindle Unlimited for $1. If it's still live on Prime Day, I'll link it, you know where, down in the description. Thank you for your patience, fellow phone nerds, I know a lot of you are mainly here for the smartphones, so how about them? Well, I do expect to see Amazon shine a light on its Prime exclusive phone lineup, which is much larger than it was last year, and bonus, no longer requires you to agree to those dorky lockscreen ads. Also, I got a heads-up from Huawei that it's marking down the Mate 10 Pro for Prime Day. You remember that phone, it's the one I took to the Grand Canyon on a photo excursion back at CES, the one I mainly criticized for being too expensive. Well, Prime Day knocks it from $799 down to $499, which turns it from a tough sell to a legitimate steal. Huawei is also slashing prices on its smartwatches, but in my view not enough to justify buying one of these older devices. If you are shopping for a smartwatch, the folks at Wearable pointed out in a recent piece that there might be some Fitbit action on Prime Day. Not the Fitbit Versa, that'll probably be too new to see much of a price drop. I'd watch for possible savings on the higher-end Ionic, instead. That fitness tracker has gotten a few big software updates since I reviewed it, and it's a much better product now. And closing out the subject of wearables, the brand new TicWatch Pro, that I just reviewed, is available exclusively to Amazon Prime members. And no word on discounts but it is brand new. Finally, there's everything else in mobile tech. Anker is a brand I talk about a lot because its giant power core battery bank is a big part of my everyday carry. It's been discounted in the week leading up to Prime Day, and I'd expect some specials on the day itself too. Same goes for noise-canceling headphones. The QC25s from Bose came down to 169 last week, and I'm hoping for discounts on the QC35s today. Hey, remember those DJI drones that I'm fond of crashing or losing? The Mavic Pro is $200 off for the drone itself, and $300 off if you want the Fly More Combo, which you do. Also, the smaller DJI Spark is $50 off. RIP, Mr. Sparky. Toss in all the rando stuff that I haven't managed to predict in this video and you could end up with quite the Prime Day haul, if you stick to your six-hour schedule. Do try to get some sleep, though, folks. Despite its name, Prime Day actually goes on until 2:59 a.m. on July 18th, so you've got some time. And don't try to be a hero and sift through it all yourself. Stick with today's sponsor, my friends and yours, the fine folks at thrifter.com, who will be holding your hand as you bushwhack your way through the Amazon this Prime Day. Until next time. Thanks for watching. Happy savings, and stay mobile, my friends.",
    "transcript_keywords": [
        "Prime Day",
        "Amazon Prime Day",
        "Prime",
        "Day",
        "explaining Amazon Prime",
        "Amazon Prime",
        "year Prime Day",
        "Amazon",
        "Prime Day starts",
        "Prime Day official",
        "Prime Day knocks",
        "Prime Day haul",
        "Amazon Prime member",
        "Kindle",
        "Lightning Deals",
        "year",
        "Amazon Echo Dot",
        "video explaining Amazon",
        "explaining Amazon",
        "Alexa"
    ],
    "transcript_entities": [
        [
            "Huawei",
            "ORG"
        ],
        [
            "200",
            "MONEY"
        ],
        [
            "day-long",
            "DATE"
        ],
        [
            "3:00 a.m.",
            "TIME"
        ],
        [
            "DJI Spark",
            "ORG"
        ],
        [
            "about 94%",
            "PERCENT"
        ],
        [
            "this before 3:00 p.m.",
            "TIME"
        ],
        [
            "9:00 p.m.",
            "TIME"
        ],
        [
            "Prime Day",
            "DATE"
        ],
        [
            "Bose",
            "PRODUCT"
        ],
        [
            "the Echo Spot",
            "ORG"
        ],
        [
            "Alexa",
            "FAC"
        ],
        [
            "2:59 a.m.",
            "TIME"
        ],
        [
            "every six hours",
            "TIME"
        ],
        [
            "Anker",
            "ORG"
        ],
        [
            "The Mavic Pro",
            "ORG"
        ],
        [
            "the whole week",
            "DATE"
        ],
        [
            "three-month",
            "DATE"
        ],
        [
            "799",
            "MONEY"
        ],
        [
            "Sparky",
            "PERSON"
        ],
        [
            "Fitbit",
            "PRODUCT"
        ],
        [
            "40%",
            "PERCENT"
        ],
        [
            "Black Friday",
            "EVENT"
        ],
        [
            "Alexa",
            "ORG"
        ],
        [
            "July 18th",
            "DATE"
        ],
        [
            "hours",
            "TIME"
        ],
        [
            "Kindle Unlimited",
            "ORG"
        ],
        [
            "the Grand Canyon",
            "LOC"
        ],
        [
            "last year",
            "DATE"
        ],
        [
            "the Echo Show",
            "EVENT"
        ],
        [
            "10",
            "CARDINAL"
        ],
        [
            "Monday",
            "DATE"
        ],
        [
            "Kindle",
            "ORG"
        ],
        [
            "last week",
            "DATE"
        ],
        [
            "six-hour",
            "TIME"
        ],
        [
            "Alexa",
            "PERSON"
        ],
        [
            "the Kindle Library",
            "ORG"
        ],
        [
            "Kindle",
            "LOC"
        ],
        [
            "3:00 p.m.",
            "TIME"
        ],
        [
            "this year",
            "DATE"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "DJI",
            "ORG"
        ],
        [
            "Kindle Unlimited",
            "PERSON"
        ],
        [
            "minutes",
            "TIME"
        ],
        [
            "Last year",
            "DATE"
        ],
        [
            "Amazon Prime Day",
            "ORG"
        ],
        [
            "Thrifter",
            "ORG"
        ],
        [
            "the day",
            "DATE"
        ],
        [
            "3:00 p.m. Eastern",
            "TIME"
        ],
        [
            "the Lightning Deals",
            "WORK_OF_ART"
        ],
        [
            "Jibo",
            "FAC"
        ],
        [
            "Kindle",
            "PERSON"
        ],
        [
            "July 16th",
            "DATE"
        ],
        [
            "40",
            "MONEY"
        ],
        [
            "50",
            "MONEY"
        ],
        [
            "last year's Prime Day",
            "DATE"
        ],
        [
            "TicWatch Pro",
            "ORG"
        ],
        [
            "CES",
            "ORG"
        ],
        [
            "Ionic",
            "ORG"
        ],
        [
            "the Fly More Combo",
            "ORG"
        ],
        [
            "499",
            "MONEY"
        ],
        [
            "1",
            "MONEY"
        ],
        [
            "this Prime Day",
            "DATE"
        ],
        [
            "Thrifter",
            "PERSON"
        ],
        [
            "1.4 million",
            "CARDINAL"
        ],
        [
            "July",
            "DATE"
        ],
        [
            "Lightning Deals",
            "PRODUCT"
        ],
        [
            "This year",
            "DATE"
        ],
        [
            "the Kindle Paperwhite",
            "ORG"
        ],
        [
            "169",
            "CARDINAL"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "Amazon",
            "ORG"
        ],
        [
            "300",
            "MONEY"
        ]
    ]
}