{
    "video_id": "34AmKPJNfCg",
    "title": "Robot Linus Reviews a Keyboard - Deepfake - Cleave Truly Ergonomic",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-07-08T16:13:42Z",
    "video_url": "https://www.youtube.com/watch?v=34AmKPJNfCg",
    "category": "Science & Technology",
    "tags": [
        "Deepfake",
        "Linus",
        "Voice",
        "Look",
        "Face",
        "Digital",
        "Fake",
        "Cleave",
        "Keyboard",
        "Egronomic",
        "Typing",
        "Comfortable",
        "Health",
        "Split",
        "Half",
        "Unboxing"
    ],
    "views": 1199677,
    "likes": 55198,
    "comments_count": 7851,
    "description": "Linus checks out an ergonomic keyboard....... but something doesn't look right... he shaved!\n\nCheck out the Cleave Truly Ergonomic Keyboard at https://lmg.gg/fgemj\n\nBuy Ergonomic Keyboards \nOn Amazon (PAID LINK): https://geni.us/e4zsDT \nOn NewEgg (PAID LINK): https://geni.us/Mm4PY \nOn BHPhoto (PAID LINK): https://geni.us/jOToC\n\nPurchases made through some store links may provide some compensation to Linus Media Group.\n\nGET MERCH: http://www.LTTStore.com/\nSUPPORT US ON FLOATPLANE: https://www.floatplane.com/  \nLTX EXPO: https://www.ltxexpo.com/   \n\nAFFILIATES & REFERRALS\n---------------------------------------------------\nAffiliates, Sponsors & Referrals: https://lmg.gg/sponsors\nGet Private Internet Access VPN at https://lmg.gg/pialinus2\nGet a Displate Metal Print at https://lmg.gg/displateltt\nNEEDforSEAT Gaming Chairs: https://geni.us/needforseat\nSupport a Creator code LINUSMEDIAGROUP on Epic Games Store: https://lmg.gg/kRTpY\nGet a 30-day free trial of Amazon Prime at https://lmg.gg/8KV1v\nOur Test Benches on Amazon: https://lmg.gg/HOx0z\nOur Production Gear: https://lmg.gg/4oPzt\n \nFOLLOW US ELSEWHERE\n---------------------------------------------------  \nTwitter: https://twitter.com/ShrtCrctYT\nInstagram: https://www.instagram.com/shortcircuityt\nFacebook: https://www.facebook.com/ShortCircuitYT  \n\nFOLLOW OUR OTHER CHANNELS\n---------------------------------------------------  \nLinus Tech Tips: https://lmg.gg/linustechtipsyt\nTechLinked: https://lmg.gg/techlinkedyt\nTechquickie: https://lmg.gg/techquickieyt  \n\nLMG Clips: https://lmg.gg/lmgclipsyt\nChannel Super Fun: https://lmg.gg/channelsuperfunyt\nCarpool Critics: https://lmg.gg/carpoolcriticsyt",
    "description_links": [
        "https://lmg.gg/fgemj",
        "https://geni.us/e4zsDT",
        "https://geni.us/Mm4PY",
        "https://geni.us/jOToC",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Just when you think you've reviewed every ergonomic keyboard on the planet, a new company with the name like \"Truly Ergonomic\" launches something like this, \"the Cleave Keyboard.\" Apparently the \"World's Most Comfortable Keyboard.\" But honestly, there's lots of comfortable keyboards out there. For me, it's about meeting that minimum ergonomic threshold while also having a decent layout that doesn't suck to use. Looking at the box, it says it uses optical switches and the word new here to me, implies that they might be proprietary. (soft music) Comes with a combined keycap puller and full switch puller. (soft music) (paper rustles) Board itself is pretty low profile with very little deck flex thanks to the aluminim faceplate. Although I would have liked to have seen a braided cable. It's got an integrated palm rest that's firm yet comfortable and doesn't act like a fuzz magnet. Really nice actually. The best thing about this board though is the layout. I like ergonomic keyboards that use nav clusters because then your strongest digits can do most of the work instead of using your weak pinky finger for things like Backspace which frankly doesn't make a lot of sense. By default on these large buttons, you've got two Space bars, Backspace, delete and enter. But you can reprogram all the keys to your liking, you know, in case you don't see yourself ever getting used to these dedicated copy, paste and undo keys. In some ways the layout is similar to the ErgoDox, which we reviewed on LTT. But unlike that board, this one has the full suite of F keys, all the bracket and slash keys over here and the arrow keys are all in one place which in my opinion is way more usable than splitting them up. You can type on this thing pretty normally except... oh my god, they made the caps lock key into another control key. Who is asking for this? So where's Caps Lock? It's up here now. That's way too far for how often I use it. And now instead, I have two control keys right next to each other. How is that helpful? The switches themselves feel okay, key stability is average at best which is surprising given the stem has a box design because usually switches like that are more stable. The switch itself does say \"Truly Ergonomic\" on it and apparently these optical switches are removable if you can manage to pull it out. (soft music) (keys clack) Look, I bent the keycap. Practically speaking, you're not likely to swap the keys out anyway because regular mechanical key switches aren't compatible with this board. It is available with their version of blues, browns and reds though. Though in theory, you could mix and match or replace a switch if one dies except they don't give you any extras in the box. The LED backlight can be adjusted through 10 brightness levels and a profiles which basically changes which keys are lit up and which are not. And each of these profiles can be customized. On top of that, you've also got several effects you can cycle through and adjust the speed up. So overall then this is a pretty awesome ergonomic keyboard. It's got a split design and compact layout to reduce overall deviation and shoulder pain without losing so many keys that your productivity suffers and it's priced at 300 US dollars which well being a lot for keyboard, is actually about normal for as ergonomic keyboards go even if the optical switches aren't going to win any award. So thanks for watching \"ShortCircuit\" today. Make sure you subscribe so you don't miss any of these cool and wacky tech products. Be sure to check out our video on \"Linus Tech Tips\" where we explain how we made this video.",
    "transcript_keywords": [
        "Cleave Keyboard",
        "keys",
        "ergonomic",
        "keyboard",
        "Cleave",
        "ergonomic keyboard",
        "switches",
        "Comfortable",
        "Comfortable Keyboard",
        "keyboards",
        "key",
        "Board",
        "layout",
        "optical switches",
        "caps lock",
        "World Most Comfortable",
        "awesome ergonomic keyboard",
        "Backspace",
        "pretty",
        "optical"
    ],
    "transcript_entities": [
        [
            "300 US dollars",
            "MONEY"
        ],
        [
            "F",
            "PRODUCT"
        ],
        [
            "Linus Tech Tips",
            "WORK_OF_ART"
        ],
        [
            "World's Most Comfortable Keyboard",
            "WORK_OF_ART"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "ShortCircuit",
            "WORK_OF_ART"
        ],
        [
            "ErgoDox",
            "PERSON"
        ],
        [
            "10",
            "CARDINAL"
        ],
        [
            "Caps Lock",
            "WORK_OF_ART"
        ],
        [
            "Backspace",
            "ORG"
        ],
        [
            "LTT",
            "ORG"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "the Cleave Keyboard",
            "WORK_OF_ART"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "Truly Ergonomic",
            "WORK_OF_ART"
        ]
    ]
}