{
    "video_id": "DCN4vaeHwEo",
    "title": "Did Apple already kill the new iMac?",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-08-25T20:40:18Z",
    "video_url": "https://www.youtube.com/watch?v=DCN4vaeHwEo",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "iMac",
        "Intel",
        "AMD",
        "Radeon",
        "videocard",
        "5700 Xt",
        "Power",
        "Temperature",
        "Nano Display",
        "Retina",
        "5K",
        "Resolution"
    ],
    "views": 569683,
    "likes": 26993,
    "comments_count": 1808,
    "description": "Use code SC64 and get over 64% off the Kove Commuter 2 here: http://koveaudio.com/sc64\n(Discount subject/free US shipping to change after Sept 10th)\n\nApple ARM processors are coming, but should you wait for those or pick this one that is powered by Intel?\n\nCheck out the iMac 27\" on Apple's website at https://lmg.gg/AQ1q5\n\nBuy Apple iMac\nOn Amazon (Paid Link): https://geni.us/5CDBf \nOn BHPhoto (Paid Link): https://geni.us/0u6sCP\nOn NewEgg (Paid Link): https://geni.us/TCaX\nOn BestBuy (Paid Link): https://geni.us/PfbtK9\n\nPurchases made through some store links may provide some compensation to Linus Media Group.\n\n►GET MERCH: http://www.LTTStore.com/\n►SUPPORT US ON FLOATPLANE: https://www.floatplane.com/  \n►LTX EXPO: https://www.ltxexpo.com/   \n\nAFFILIATES & REFERRALS\n---------------------------------------------------\n►Affiliates, Sponsors & Referrals: https://lmg.gg/sponsors\n►Private Internet Access VPN: https://lmg.gg/pialinus2\n►MK Keyboards: https://lmg.gg/LyLtl\n►Nerd or Die Stream Overlays: https://lmg.gg/avLlO\n►NEEDforSEAT Gaming Chairs: https://lmg.gg/DJQYb\n►Displate Metal Prints: https://lmg.gg/displateltt\n►Epic Games Store (LINUSMEDIAGROUP): https://lmg.gg/kRTpY\n►Amazon Prime: https://lmg.gg/8KV1v\n►Audible Free Trial: https://lmg.gg/8242J\n►Our Gear on Amazon: https://geni.us/OhmF\n \nFOLLOW US ELSEWHERE\n---------------------------------------------------  \nTwitter: https://twitter.com/ShrtCrctYT\nInstagram: https://www.instagram.com/shortcircuityt\nFacebook: https://www.facebook.com/ShortCircuitYT  \n\nFOLLOW OUR OTHER CHANNELS\n---------------------------------------------------  \nLinus Tech Tips: https://lmg.gg/linustechtipsyt\nTechLinked: https://lmg.gg/techlinkedyt\nTechquickie: https://lmg.gg/techquickieyt  \n\nLMG Clips: https://lmg.gg/lmgclipsyt\nChannel Super Fun: https://lmg.gg/channelsuperfunyt\nCarpool Critics: https://lmg.gg/carpoolcriticsyt",
    "description_links": [
        "http://koveaudio.com/sc64",
        "https://lmg.gg/AQ1q5",
        "https://geni.us/5CDBf",
        "https://geni.us/0u6sCP",
        "https://geni.us/TCaX",
        "https://geni.us/PfbtK9",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- So you may know that I use a Mac at home, not a desktop mind you a laptop, I've got a MacBook. Which until recently really hasn't had any competition from Apple as far as a decent MacBook goes, but that's not why we're here today. Today, we're looking at this, the brand new 27 inch iMac. This is still Intel base, which is gonna put a few people off. I know I'm not entirely sure if I would buy one right now. You know, maybe it'll grow on me, who knows? The box is basically unchanged from the past 10 years. It's got this kind of trapezoidal design here with a nice little handle, the box already been opened up by our warehouse staff. We are going to review this on Linus Tech Tips. So without further ado, let's pop it open. (soft music) Yeah, it's not too much fanfare. Okay, so we've got these a little and then I'll kind of like wheel chocks. In this one actually is the nice flush sitting Apple branded power cable. And in this one, we got our accessories box inside of which we have magic mouse and a magic keyboard. And not much else, there is a little, this is a cleaning cloth. Let's see here, yeah nice, actually really nice microfiber cleaning cloth. Single charging cable for both the magic keyboard and the magic mouse, which of course still goes into the bottom, one day maybe they'll do wireless charging. That'd be nice. And there probably are some stickers in here if Apple is a creature of habit and sure enough, here they are. So that's the accessories, let's move on to the main event here. Got this nice fabric key, I'm not sure what this is to be honest, it doesn't feel like paper it's like cotton maybe. It helps prevent any kind of scuffs or other damage during shipping, which is nice to see. And we also have this, well, it would have been a lot tighter but I actually took it off earlier cause I wanted to see what was underneath. And I think you will too. When we had our Pro Display XDR review, we ended up not opting for the nano-texture glass because that would have delayed it by quite a lot. But in this case, for the first time an iMac is getting that treatment and it wouldn't have delayed our shipment based on the other specs that we had. So why not, right? Good a time as any to take a look at it. There we go, yeah, look at that. It's kind of a weird mix between glossy and matte cause like from this angle I can see reflections but if I, yeah, like from this angle I cannot. - [Andy] I have a reflection but its got like matte film. - Yeah, except it's not a matte film, it's actually laser etched into the glass. So it's at a nano level, I'm not entirely sure what Apple means by that, but basically you cannot see the individual little markings, which I think is actually a better effect just because you don't get that sparkle so much. At least I don't think you will, plan to turn it on to find out. Round back though, we've got the usual suspects. We've got headphone jack, so it's not a very courageous product, I'm sorry. SD card slot, four USB I believe 3.1 ports, two Thunderbolt ports, 10 gigabit Ethernet Port. This is upgraded to the 10 gigabit model, just get a nice 10 Gigabit Ethernet and yeah, you're pretty much cool. Even if you just use WiFi for internet and 10 gig for your NET, it's still a lot better than the alternatives. And this here is the final peel. One thing I've always liked about the iMac cause they have these removable Ram Bay covers. So you don't have to take anything else apart, You just press a little button in there and this panel just pops right off. And underneath, we can see that we have, I think that's four slots with two sticks installed. So that's really it for the outside. Again like the box, hasn't really been changed since I don't know, 2011. Let's get it plugged in and fired up. But first our sponsor, the Kove Commuter to Bluetooth speaker. It's a water resistant portable speaker with seven hours of battery life and up to 30 feet of range. The star of the show features its ability to split into two separate speakers. And when combined they create a 360 degree sound, but when separated, each speaker creates a left and right stereo sound. Use code SC64, 64% off the Kove Commuter at the link below. One thing Apple does really well is the fact that you just really only need one cable and it just fits flush right in here like this. That's nothing new, but I still think it's deep. The magic mouse one had an indicator whenever you turned it on, this didn't have it. How unfortunate, magic keyboard is on, also doesn't have an LED, just the little green bit here. I guess that saves battery. Hey, okay, I raise the bomb. - [Robot] To use English as the main language, press the Return key. - Cool, thank you for a matte finish, like there's no fringing or anything. Like it's a little bit of a frosted effect, but it's not that distracting. I usually find like a heavy matte to be really distracting, so like I kinda actually preferred the glossy. One weird thing though is that the webcam cutout obviously doesn't have the nano texture. So it just kinda like sticks out like a sore thumb up here. - [Robot] Press the Escape key. - I thought I'd had my fill with that Cortana, but apparently not. I mean, it's an assistive thing. So like if you can't see very well, if you have vision issues, then having the talk back is good. It's just really annoying when you're just trying to set up the computer. Touch a sign in here, a bit of WiFi there, verifying GarageBand, come on Apple, who cares? I mean, I'm setting the system up. True tone, yeah. Can't really turn it off from here, I don't know why. I'm just like, hey look at this feature that we have. It's something we complain about every time, but it's still annoying that they haven't fixed that. Let's put a more vibrant wallpaper on here and see how the screen looks. Yeah, that's pretty good, I don't use iMacs too often, so I'm not entirely up to speed on how bright they get. I feel like the MacBooks get a little bit brighter, I am off access though. So I've got a couple of little benchmarks download, first let's take a look at the system itself. This is the Retina 5K 27 inch 2020, we knew that. We've got a 3.6 gigahertz, 10-Core Intel Core i9, that's the Core i9, 10, nine, 10, I think. 16 gigabytes of 2667 megahertz DDR4. And the AMD Radeon Pro 5700 XT 16 gig, one terabyte of storage. One of the new features of the 27 inch for this year is the addition of Bluetooth 5.0. I don't think Apple has any 5.0 devices aside from the iPhone, maybe the iPad. Alright, let's throw up Intel power gadget. Yep, 3.6 looks to be about the frequency that it would be a baseline at, currently below that. Temperature is 37 degrees, I think it's like 21 or 22 in here right now. Okay, Power Drum went way up above, was like 150 almost, 145 ish, yeah, 155 actually. Temperatures at 85.9, 86.9, 88, oh, temperature is at 96. Apple please, you are doing so well, 98 who runs over that's what Apple's banking on. The CPU is just not gonna have to get that hot for very long. Yeah, I don't like it, alright, let's hit it with a more sustained load and see what the temperatures look like. I don't expect that it's gonna be very happy. Prime 95 can't be opened because Apple cannot check it for malicious software, who cares, let me do it. Alright, we're at 160 Watts, okay? I dropped out of hyper-turbo and now it's just double-turbo 145 Watts. Fan is not at maximum speed hovering around 97 and 98 degrees right now. Oh no, it just dropped down 94, 93, huh? Maybe Apple's learned something, still not perfect, but I'll take that over cooking it. So that's better than I expected it would be, but at the same time, I'm still very concerned about the longevity of this machine cause this is a brand new machine and it hasn't sucked any dust into its fans. You're not getting any kind of cleaning solution in there without taking the whole thing apart. Hopefully Arm fixes this problem, Arm is a much more efficient architecture. But if they can get this kind of performance level ish in like I don't know, 70 or 80 degrees. That could market it as the quietest Mac ever, like the fans are running right now and you can hear them. At 70 or 80 degrees, the fans wouldn't have it running like this. Finally, I wanna see how this Radeon Pro 5700 XT works in the iMac's enclosure. Just throw key punch out at this kinda like the Mac benchmark. Okay, so a 16 inch MacBook Pro actually got a score that is a fair bit lower than ours with an external 3700 XT. So I would call that pretty good. And this performance does come at a cost, a pretty significant one. This thing starts at 1799 U.S. and that's with a six core processor with eight gigs of Ram, a 256 gigabyte SSD and a Radeon Pro 5,300. This configuration with the nano textured glass is $500, the 10 core processor is another $400. 16 gig of DDR for that's another $200, Radeon Pro 5,700 XT with 16 gigs of Ram another $500 and another $200 for the one terabyte SSD and another a $100 for the 10 gig Ethernet, brings us to a brand total of 4,199 U.S. dollars. I can't recommend that, but I can recommend you check out the full review on LTT. So get subscribed over there and subscribe here if you'd like to see more videos like this one on short circuit.",
    "transcript_keywords": [
        "Apple",
        "Radeon Pro",
        "Yeah",
        "kind",
        "nice",
        "desktop mind",
        "Pro",
        "magic",
        "thing",
        "AMD Radeon Pro",
        "Radeon",
        "matte",
        "magic mouse",
        "magic keyboard",
        "Linus Tech Tips",
        "bit",
        "gigabit Ethernet",
        "Pro Display XDR",
        "box",
        "Core"
    ],
    "transcript_entities": [
        [
            "Linus Tech Tips",
            "WORK_OF_ART"
        ],
        [
            "37 degrees",
            "QUANTITY"
        ],
        [
            "Ram",
            "ORG"
        ],
        [
            "U.S.",
            "GPE"
        ],
        [
            "2667 megahertz",
            "QUANTITY"
        ],
        [
            "this year",
            "DATE"
        ],
        [
            "160",
            "CARDINAL"
        ],
        [
            "MacBook",
            "ORG"
        ],
        [
            "4,199 U.S. dollars",
            "MONEY"
        ],
        [
            "150",
            "CARDINAL"
        ],
        [
            "2020",
            "DATE"
        ],
        [
            "Pro Display XDR",
            "ORG"
        ],
        [
            "10",
            "CARDINAL"
        ],
        [
            "145 Watts",
            "PRODUCT"
        ],
        [
            "DDR",
            "ORG"
        ],
        [
            "86.9",
            "CARDINAL"
        ],
        [
            "256 gigabyte",
            "MONEY"
        ],
        [
            "27 inch",
            "QUANTITY"
        ],
        [
            "95",
            "CARDINAL"
        ],
        [
            "97",
            "CARDINAL"
        ],
        [
            "MacBook",
            "FAC"
        ],
        [
            "the Kove Commuter",
            "ORG"
        ],
        [
            "85.9",
            "CARDINAL"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "16 gigabytes",
            "QUANTITY"
        ],
        [
            "Radeon Pro",
            "ORG"
        ],
        [
            "Ethernet Port",
            "FAC"
        ],
        [
            "3.6",
            "CARDINAL"
        ],
        [
            "Ram",
            "PRODUCT"
        ],
        [
            "70",
            "CARDINAL"
        ],
        [
            "Andy",
            "PERSON"
        ],
        [
            "Today",
            "DATE"
        ],
        [
            "Watts",
            "LOC"
        ],
        [
            "LTT",
            "ORG"
        ],
        [
            "the past 10 years",
            "DATE"
        ],
        [
            "100",
            "MONEY"
        ],
        [
            "93",
            "CARDINAL"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "16 inch",
            "QUANTITY"
        ],
        [
            "98",
            "CARDINAL"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "200",
            "MONEY"
        ],
        [
            "Cortana",
            "PERSON"
        ],
        [
            "21",
            "DATE"
        ],
        [
            "2011",
            "DATE"
        ],
        [
            "CPU",
            "ORG"
        ],
        [
            "eight",
            "CARDINAL"
        ],
        [
            "MacBooks",
            "ORG"
        ],
        [
            "SSD",
            "ORG"
        ],
        [
            "400",
            "MONEY"
        ],
        [
            "22",
            "CARDINAL"
        ],
        [
            "Core",
            "ORG"
        ],
        [
            "iPad",
            "PRODUCT"
        ],
        [
            "Thunderbolt",
            "ORG"
        ],
        [
            "80 degrees",
            "QUANTITY"
        ],
        [
            "3700 XT",
            "PRODUCT"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "iMac",
            "ORG"
        ],
        [
            "Mac",
            "PERSON"
        ],
        [
            "GarageBand",
            "ORG"
        ],
        [
            "145 ish",
            "QUANTITY"
        ],
        [
            "96",
            "CARDINAL"
        ],
        [
            "1799",
            "CARDINAL"
        ],
        [
            "Ram Bay",
            "PERSON"
        ],
        [
            "3.1",
            "CARDINAL"
        ],
        [
            "155",
            "CARDINAL"
        ],
        [
            "XT",
            "ORG"
        ],
        [
            "iMacs",
            "ORG"
        ],
        [
            "MacBook Pro",
            "ORG"
        ],
        [
            "six",
            "CARDINAL"
        ],
        [
            "jack",
            "PERSON"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "webcam",
            "DATE"
        ],
        [
            "English",
            "LANGUAGE"
        ],
        [
            "94",
            "CARDINAL"
        ],
        [
            "500",
            "MONEY"
        ],
        [
            "up to 30 feet",
            "QUANTITY"
        ],
        [
            "seven hours",
            "TIME"
        ],
        [
            "98 degrees",
            "QUANTITY"
        ],
        [
            "Intel",
            "ORG"
        ],
        [
            "one terabyte",
            "QUANTITY"
        ],
        [
            "One",
            "CARDINAL"
        ],
        [
            "5.0",
            "CARDINAL"
        ],
        [
            "3.6 gigahertz",
            "QUANTITY"
        ],
        [
            "the Kove Commuter",
            "LOC"
        ],
        [
            "nine",
            "DATE"
        ],
        [
            "88",
            "DATE"
        ],
        [
            "16",
            "CARDINAL"
        ],
        [
            "four",
            "CARDINAL"
        ],
        [
            "64%",
            "PERCENT"
        ],
        [
            "Mac",
            "ORG"
        ]
    ]
}