{
    "video_id": "fIA_UQM5fSo",
    "title": "Airpods clones that sound GOOD?? - Soundcore Liberty Air 2 Earbuds",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-05-06T00:23:33Z",
    "video_url": "https://www.youtube.com/watch?v=fIA_UQM5fSo",
    "category": "People & Blogs",
    "tags": [
        "Soundcore",
        "Anker",
        "Apple",
        "Airpods",
        "Liberty Air 2",
        "Audio",
        "Bluetooth",
        "Wireless",
        "Charging",
        "True Wireless",
        "Quality",
        "Performance",
        "Equalizer",
        "HearID",
        "Microphone",
        "Isolation",
        "Noise",
        "Comfortable",
        "USB-C",
        "Cable",
        "Audiophile"
    ],
    "views": 727681,
    "likes": 23512,
    "comments_count": 1503,
    "description": "Thanks to Soundcore for sponsoring this video! Check out the Soundcore Liberty Air 2 earbuds at https://bit.ly/LibertyAir2LTT\n\nWhich true wireless earbuds are the best for you? You somewhat need to go wireless due to the headphone jack no longer available and for under $100, you should check these out.\n\nBuy Apple Airpods Pro\nOn Amazon (Paid Link): https://geni.us/t8LB    \nOn BHPhoto (Paid Link): https://geni.us/4DDyFQ\nOn NewEgg (Paid Link): https://geni.us/vut5    \n\nBuy Apple Airpods\nOn Amazon (Paid Link): https://geni.us/xQAfI\nOn Staples (Paid Link): https://shop-links.co/1725432008071987179\nOn StockX (Paid Link): https://shop-links.co/1725432009132929370\nOn BHPhoto (Paid Link): https://geni.us/z3Op\nOn NewEgg (Paid Link): https://geni.us/uqgx\n\nBuy Pixel Smartphone\nOn Best Buy (Paid Link): https://shop-links.co/1725432009696955000\n\nPurchases made through some store links may provide some compensation to Linus Media Group.\n\nGET MERCH: http://www.LTTStore.com/\nSUPPORT US ON FLOATPLANE: https://www.floatplane.com/  \nLTX EXPO: https://www.ltxexpo.com/   \n\nAFFILIATES & REFERRALS\n---------------------------------------------------\nAffiliates, Sponsors & Referrals: https://lmg.gg/sponsors\nGet Private Internet Access VPN at https://lmg.gg/pialinus2\nGet a Displate Metal Print at https://lmg.gg/displateltt\nSupport a Creator code LINUSMEDIAGROUP on Epic Games Store: https://lmg.gg/kRTpY\nGet a 30-day free trial of Amazon Prime at https://lmg.gg/8KV1v\nOur Test Benches on Amazon: https://lmg.gg/HOx0z\nOur Production Gear: https://lmg.gg/4oPzt\n \nFOLLOW US ELSEWHERE\n---------------------------------------------------  \nTwitter: https://twitter.com/ShrtCrctYT\nInstagram: https://www.instagram.com/shortcircuityt\nFacebook: https://www.facebook.com/ShortCircuitYT  \n\nFOLLOW OUR OTHER CHANNELS\n---------------------------------------------------  \nLinus Tech Tips: https://lmg.gg/linustechtipsyt\nTechLinked: https://lmg.gg/techlinkedyt\nTechquickie: https://lmg.gg/techquickieyt  \n\nLMG Clips: https://lmg.gg/lmgclipsyt\nChannel Super Fun: https://lmg.gg/channelsuperfunyt\nCarpool Critics: https://lmg.gg/carpoolcriticsyt",
    "description_links": [
        "https://bit.ly/LibertyAir2LTT",
        "https://geni.us/t8LB",
        "https://geni.us/4DDyFQ",
        "https://geni.us/vut5",
        "https://geni.us/xQAfI",
        "https://shop-links.co/1725432008071987179",
        "https://shop-links.co/1725432009132929370",
        "https://geni.us/z3Op",
        "https://geni.us/uqgx",
        "https://shop-links.co/1725432009696955000",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- We're checking out the Liberty 2 Air's from Soundcore. This video was sponsored by Soundcore, so you can check them out at the link in the video description. They build these as kind of AirPods competitors, but at a lower price. And the lower price part checks out. I've fired these up on Amazon and they were marked $20 down from an MSRP of $100, making them about $80, and as far as the tech built into them goes, that's looking pretty good for the price. So they've got Diamond Coated Drivers, whatever that means. They've got two microphones per earbud, so for uplink noise cancellation, they've got IPX five water resistance, so you should be able to sweat with them in. And they feature seven hours of playtime in the earbuds themselves with a total of 28 hours with the charging case. And this is a really nice feature to have now, they've got wireless charging in the case as well. I really didn't think it was going to bother me that much. And then I went to a pair of wireless earphones that did not have wireless charging built into the case and I was like, \"oh yeah, this really isn't as good\". Right, I'm going to fire these in here, so they're supposed to get about two hours of playback time off of just a 10 minute charge. So if they're not charged out of the box, then that should give me enough to do the video here. And they're preloaded with the medium ear tips, actually that means I'm probably going to have to swap them out right away, I have kind of small ear canals. All right, let's see what the fit feels like. Okay, small it is. Last thing in here is a charging cable just in case you, still plugging in to charge. Type C, really nice to see, get it, really nice to see. (laughs) Got them, on the bottom we've got a pairing button and then that's like pretty much it there about as, AirPods like as you could expect them to be, without being like a, you know, a cheap knockoff, right? For size comparison, I brought along my regular AirPods as well as a pair of AirPods Pros. So you can see there about the width of the AirPods Pros, but they are a little bit thicker and they're actually a little bit taller as well. Of course the most important thing for me is not necessarily the raw size, but whether they fit in the useless pocket. Ooh, it's a little tight, does get in there though. That's a good finish they've got on the top. It's kind of matte feeling, but it's not so grippy that it's a real challenge to slide in and out of the pocket there, especially out. Cause I find the way that I generally get it out is I kind of squeeze it out like a tube of toothpaste. So nothing quite matches the AirPods in this regard, you can see they really pop out quite easily, but that's also respectable. Now, let's look at the earbuds themselves. So we've got our Liberty Air 2's, AirPods Pros and regular AirPods. So they're definitely gonna hang out of your ear canals kinda like, the regular AirPods do. They're a little bit on the thicker side. T-H-I-C-C, that size difference is a disadvantage compared to AirPods. But what helps with the snugness of the fit is the fact that they've at least got, different sizes of silicone tips that you can use to make sure that it fits in, all right. So I find that neither of them are gonna come flying out even with a head shake test. One other thing that's really noticeable is of course the difference in sound isolation. So the AirPods because they don't, seal in your ear offer almost none. You've got to move up to the Pros for that, which of course means you're spending quite a lot more. It's got a bit of a hollower snap, closed sound, but nice magnetic mechanism. Not bad, not bad. Give it, I'll give it a B plus. Okay, Update firmware, you know, when I was a kid, we didn't have firmware updates. When you bought something, gosh darn it, you were stuck with whatever broken piece of garbage they sent you. All right, can we do it? - Yeah. - So that's our battery life here in the app, here's our equalizer settings and this actually tests your hearing and then adjusts the EQ according to your hearing. Okay, so you hold the button when you can hear the sound and release it when you stop hearing the sound. (upbeat music) Okay, so try it with and without this thing. - I like it better like this. - Interesting. Why? - I don't know. - Really, that's it, that's all you got for me? No noise cancellation, so by default, hold is voice assistant or I guess you can change it to whatever you want it here. But I will say the noise isolation is quite strong, there are closed back IM's and they seal pretty well with the ears. So hearing what's around me is pretty difficult with them in. Now I'm going to turn off your personalization here and I'm going to just put it on a flat EQ. I want to hear what they sound like out of the box. Wow! These things are frigging loud. I would listen to them at the very, very bottom, if you like shaking your skull with in ears. These are going to be right up your alley. Well, the flat sound signature is true to its word. Very flat, not too sparkly in the highs, not overdone with the bass. The default sound signature pumps the bass a little bit, but really not a ton. Oh wow, you can pick different professional ones. This is really cool my Note9 has a feature where, I can actually have two Bluetooth Sound Devices, active at once, so this allows me to fairly easily, listen to both at the same time. Definitely less isolation than active noise cancellation, but I would expect that, but compared to just a regular Airpod. I mean it's night and day. You're like a ghost in my mind. - Oh, that's something that changes in the default Soundcore signature. Instead of being quite as flat, it pulls vocals up a little bit. Kind of like what the AirPods will do out of the box. Some more Apples to Apple comparison for sure, I think out of the box, it's fair to say they have comparable sound quality to something like AirPods or even AirPods Pros, but what's really nice is that if you get into the custom EQ, unlike those Sennheisers that I checked out recently, they've got this just very intuitive interface. It's super easy to use to create your own custom EQ. Clearly my kids need me to go pay attention to them now, so thanks for checking out this look at the Liberty Air 2, again this was sponsored by Soundcore and you can check them out at the link in the video description. That that doesn't go in there. (children laughing) Give me those. (children laughing)",
    "transcript_keywords": [
        "AirPods",
        "AirPods Pros",
        "sound",
        "Pros",
        "regular AirPods",
        "Diamond Coated Drivers",
        "kind",
        "Liberty Air",
        "bit",
        "Soundcore",
        "nice",
        "case",
        "ear",
        "charging",
        "Liberty",
        "video",
        "Air",
        "lower price",
        "thing",
        "box"
    ],
    "transcript_entities": [
        [
            "AirPods",
            "PRODUCT"
        ],
        [
            "seven hours",
            "TIME"
        ],
        [
            "the AirPods Pros",
            "PRODUCT"
        ],
        [
            "One",
            "CARDINAL"
        ],
        [
            "20",
            "MONEY"
        ],
        [
            "Apples",
            "PERSON"
        ],
        [
            "about $80",
            "MONEY"
        ],
        [
            "Liberty 2 Air's",
            "ORG"
        ],
        [
            "Amazon",
            "ORG"
        ],
        [
            "Diamond Coated Drivers",
            "ORG"
        ],
        [
            "28 hours",
            "TIME"
        ],
        [
            "10 minute",
            "TIME"
        ],
        [
            "Sennheisers",
            "PRODUCT"
        ],
        [
            "100",
            "MONEY"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "Pros",
            "PERSON"
        ],
        [
            "Soundcore",
            "ORG"
        ],
        [
            "AirPods Pros",
            "PRODUCT"
        ],
        [
            "Liberty Air 2's",
            "ORG"
        ],
        [
            "IM",
            "GPE"
        ],
        [
            "EQ",
            "ORG"
        ],
        [
            "about two hours",
            "TIME"
        ],
        [
            "five",
            "CARDINAL"
        ],
        [
            "Airpod",
            "ORG"
        ],
        [
            "Apple",
            "ORG"
        ]
    ]
}