{
    "video_id": "2ea1FrrEJD0",
    "title": "Razer wins CES AGAIN",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-01-06T01:36:29Z",
    "video_url": "https://www.youtube.com/watch?v=2ea1FrrEJD0",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "CES",
        "CES 2022",
        "Consumer Electronics Show",
        "2022",
        "Razer",
        "Zephyr Pro",
        "Project Sophia",
        "Razer Sophia",
        "gaming desk",
        "Enki Pro Hypersense",
        "Sony",
        "Sony CES 2022",
        "Razer CES 2022",
        "PSVR2",
        "Sony car",
        "Samsung",
        "Samsung CES 2022",
        "Samsung Freestyle",
        "Samsung Odyssey Ark",
        "monitor",
        "vertical monitor",
        "curved ultrawide"
    ],
    "views": 1075820,
    "likes": 49370,
    "comments_count": 1420,
    "description": "Thanks to Seasonic for sponsoring our coverage of CES 2022! Learn more about their full lineup of power supplies at https://lmg.gg/seasonic2022\n\nBuy a Seasonic Ultra Titanium PSU\nOn Amazon: https://geni.us/q4lnefC\nOn NewEgg: https://lmg.gg/8KV3S\n\n► LISTEN TO THE TECH NEWS: https://lmg.gg/TechLinkedPodcast\n►GET MERCH: http://www.LTTStore.com/\n►SUPPORT US ON FLOATPLANE: https://www.floatplane.com/  \n►LTX EXPO: https://www.ltxexpo.com/   \n\nNEWS SOURCES: https://lmg.gg/KaTzn\n---------------------------------------------------\nTimestamps:\n0:00 too many tech tips\n0:09 Razer - Zephyr Pro, Project Sophia\n1:23 Sony - PSVR2, Vision S EV\n2:13 Samsung - Freestyle, Odyssey Ark\n3:29 Seasonic\n4:01 QUICK BITS\n4:09 ASUS + Lenovo wacky laptops\n4:49 Wi-Fi 6 Release 2\n5:46 Microsoft disabling Xbox dev accounts\n6:22 Kosovo bans crypto mining\n6:55 CyberPowerPC Kinetic Series PC\n\nAFFILIATES & REFERRALS\n---------------------------------------------------\n►Affiliates, Sponsors & Referrals: https://lmg.gg/sponsors\n►Private Internet Access VPN: https://lmg.gg/pialinus2\n►MK Keyboards: https://lmg.gg/LyLtl\n►Nerd or Die Stream Overlays: https://lmg.gg/avLlO\n►Official Game Store: https://www.nexus.gg/ltt\n►Amazon Prime: https://lmg.gg/8KV1v\n►Audible Free Trial: https://lmg.gg/8242J\n►Our Gear on Amazon: https://geni.us/OhmF\n \nFOLLOW US ELSEWHERE\n---------------------------------------------------  \nTwitter: http://twitter.com/TechLinkedYT\nInstagram: http://instagram.com/TechLinkedYT\nFacebook: http://facebook.com/TechLinked  \n\nFOLLOW OUR OTHER CHANNELS\n---------------------------------------------------  \nLinus Tech Tips: https://lmg.gg/linustechtipsyt\nMac Address: https://lmg.gg/macaddress\nTechquickie: https://lmg.gg/techquickieyt\nShortCircuit: https://lmg.gg/shortcircuityt\nLMG Clips: https://lmg.gg/lmgclipsyt\nChannel Super Fun: https://lmg.gg/channelsuperfunyt\nThey're Just Movies podcast: https://lmg.gg/TheyreJustMovies",
    "description_links": [
        "https://lmg.gg/seasonic2022",
        "https://geni.us/q4lnefC",
        "https://lmg.gg/8KV3S",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/KaTzn",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/TheyreJustMovies"
    ],
    "transcript": "- [Riley] Hello? Are you... Are you okay? - I have a bad case of tech shock. Tech has overloaded my system. - [Riley] Oh, that's... I hate when that happens. - Every year, Razer shows up to CES with some wacky concept that never actually comes to market. Except for last year's Project Hazel RGB face mask, which did eventually launch as the Razer Zephyr, minus the cool voice amplification feature. Well, guess what? Razer has now added that in and relaunched the mask as the Zephyr Pro. And while I personally would've predicted low demand for such a thing, the original apparently sold out, so people must be wearing them to raves? - [Riley] Yeah, I see them all the time. - You see them at raves, Riley? Now, Razer's wacky concept this year is Project Sophia, a modular gaming desk that would not only house swappable PC component modules but also numerous built-in programmable displays. There is no way. Calling your bluff, Razer. This ain't happenin'. - It could. - But the Razer x Fossil Gen 6 Smartwatch is, and the Enki Pro HyperSense chair with haptic feedback synced with your games and your movies, and maybe even the RGB Chroma integration with your smart home devices- - That's what I want. - Those seem real. But Sophia's gonna join Christine on the girls' trip off the canyon or- - They are partying so hard. - Yeah. True to form, Sony's CES conference was a bit more down-to-earth, although the company did confirm some details about their next-gen PS VR2 headset. It will feature eye tracking and haptic feedback, so when it launches by the end of 2022, PlayStation 5 owners can look forward to feeling some... Good vibrations - [Riley] Copyright! - On their head. - Oh. Well, that's... - In before VR head massage simulators flood the PlayStation Store. - [Riley] I already have a headache. - Sony also unveiled an electric SUV concept, the Vision SEV, which joins their Vision EV sedan from last year, along with whatever other vehicles Sony's cooking up with its new automotive focus subsidiary, Sony Mobility Inc. In their imaginary future garage. It's- - [Riley] Huh. - The cars are in the metaverse somewhere. - [Riley] We've been there. We wear the masks. - And Samsung is too good to announce all of its products on one day at CES, because they are the number chaebol, after all. - [Riley] Number one! Whoo! - So today we got a look at the Samsung Home Hub, a giant tablet to control your smart home that I'm sure someone asked for? But one expected and welcome announcement was the Samsung Freestyle, a battery-powered compact projector with a built-in speaker and a light fixture attachment so that you can hang it or mount it upside down. - [Riley] The kids like! - It's even got a cap that turns it into an RGB smart speaker when it's not being used for projecting. Probably not gonna cut it for my home theater setup, but look how fun it might be for the teens. - Yeah! - Think of the teens, Riley. - [Riley] They like that stuff. - Last but not least, Samsung's Odyssey Ark is a massive 55-inch ultrawide curved monitor that you can load all the animals into two by two... (Riley chuckles) Sorry, that you can rotate vertically to become three virtual 24-inch displays that curve above your head. - [Riley] Yeah, where they belong. - You might think it's weird. - [Riley] And that's it. - Get in the holiday spirit! It's CES holiday! - [Riley] What? You skipped a joke! - Now it's time for the Butt Cracks, brought to you by the power supply building experts at Seasonic. If you're under 40, then they've been making power supplies since before you were born. And if you're over 40? Sorry to hear that. But you should still use Seasonic in your next build or upgrade, because they've got models with 80 Plus Titanium efficiency, hybrid fan control to reduce fan noise, and a whopping 12-year warranty. (Riley whistles) That's right: you won't have to buy another one until you're 52! - Oh, wow. - Sorry to bring that up. Check them out at seasonic.com or at the link down below. Now, butt cracks aren't technically legal, but the health benefits are amazing, and I feel great. - [Riley] Aw, man. I'm trippin'. - CES is as much about fighting back an overwhelming tide of laptops as it is about all the other wacky stuff, so of course there were brand-new Zenbooks from ASUS and ThinkPads from Lenovo. But the two companies also brought some weird stuff with them, like the new ASUS Zenbook 17 Fold, which looks like a more refined OLED version of Lenovo's X1 Fold from last year. Lenovo returned the favor and took a page from the Zenbook Duo playbook to make the ThinkBook Plus Gen 3, a 17-inch ultrawide laptop with an 8-inch display to the right of the keyboard and trackpad. Man, this thing is gonna be great when someone competent like Apple copies it. - [Riley] Hey, whoa! - Hey! What? - Goodness! - Now, there's a disease spreading among the tech standard organizations, and it looks like the Wi-Fi Alliance has apparently caught the bug. Oh no, are you serious? - So sorry. - That's the only explanation we can come up with for why they just announced Wi-Fi Certified 6 Release 2. (Riley giggles) - Why? - Which brings support for uplink multi-user MIMO and better power consumption. Both of which are fine, it's just that the Wi-Fi naming scheme just got simplified. It just got simplified! You got the Wi-Fi 4, the Wi-Fi 5, the Wi-Fi 6, but then the screwed it up with Wi-Fi 6E, and now we're getting Wi-Fi 6 Release 2, which won't supersede the other two, but will exist alongside them. Hey! Look at the consoles! See what they do with the numbers? Just do that! - You tell 'em! - But not what Microsoft does! What Sony does! - [Riley] The more Wi-Fis, the better! - Speaking of consoles, Microsoft has been caught disabling developer accounts that haven't published games on the Xbox store, presumably because many emulation enthusiasts were using them to run PlayStation and Nintendo games on Xbox consoles using Homebrew software. It's weird to see Microsoft clamp down on this when they enthusiastically support backwards compatibility for the Xbox. I mean, I knew Phil Spencer had an icy heart deep below his soft teddy bear exterior. - [Riley] Yeah. You can see it in the eyes. - The truth is, I'm never hugging him again. - [Riley] Me neither. - We probably could've seen this coming. - [Riley] Have you hugged him? - Cryptocurrency mining remains the target of European governments tackling an energy crisis, and now Kosovo has banned the practice after enforcing rolling blackouts in an attempt to save power. Cryptomining became very popular in the country thanks to formerly really cheap electricity, and it's still unclear just how big of an impact cryptomining has on energy consumption worldwide. But it for sure has an impact on the supply of GPUs, and I need a few of those to run my giant vertical curved monitors, so thanks, Kosovo. - I need a few of 'em. - Yeah. Like three. - Battle station. - And hey, we got time for a classically wacky CES product. CyberPower's Kinetic series PC has 18 automated triangular ports on the front of the case that open and close depending on your airflow needs. - [Riley] Have you seen this? - I am not sure who, if anyone, was asking for the ability to turn down their airflow, but that doesn't matter. What matters is that this thing looks like a mechanical eldritch horror that will eat your hand if you stick it in there. And that, my friends, is what the CES season is all about. - [Riley] It's Cthulhu's PC. - There's so much tech news it's crazy, guys, so come back tomorrow to stay caught up. I mean, can you imagine a company announcing something and you not knowing about it? - Oh! - It's terrible! - [Riley] What? - Can't have it. - What do you mean?",
    "transcript_keywords": [
        "CES",
        "Razer",
        "WiFi",
        "Project Hazel RGB",
        "Sony",
        "year Project Hazel",
        "year",
        "Yeah",
        "Razer Zephyr",
        "Razer wacky concept",
        "Samsung",
        "Sony CES",
        "Sony CES conference",
        "Samsung Home Hub",
        "home",
        "RGB",
        "Razer wacky",
        "wacky",
        "Hey",
        "tech"
    ],
    "transcript_entities": [
        [
            "Wi-Fi 6E",
            "LOC"
        ],
        [
            "PS VR2",
            "ORG"
        ],
        [
            "Razer",
            "PERSON"
        ],
        [
            "last year",
            "DATE"
        ],
        [
            "CES",
            "NORP"
        ],
        [
            "Riley",
            "PERSON"
        ],
        [
            "the Butt Cracks",
            "WORK_OF_ART"
        ],
        [
            "this year",
            "DATE"
        ],
        [
            "Sophia",
            "PERSON"
        ],
        [
            "18",
            "CARDINAL"
        ],
        [
            "Samsung",
            "ORG"
        ],
        [
            "12-year",
            "DATE"
        ],
        [
            "Wi-Fis",
            "LOC"
        ],
        [
            "Phil Spencer",
            "PERSON"
        ],
        [
            "Project Hazel RGB",
            "FAC"
        ],
        [
            "2",
            "CARDINAL"
        ],
        [
            "PlayStation",
            "PRODUCT"
        ],
        [
            "under 40",
            "DATE"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "Wi-Fi",
            "ORG"
        ],
        [
            "the Samsung Home Hub",
            "ORG"
        ],
        [
            "Odyssey Ark",
            "FAC"
        ],
        [
            "ThinkPads",
            "ORG"
        ],
        [
            "Lenovo",
            "ORG"
        ],
        [
            "Zenbooks",
            "PERSON"
        ],
        [
            "X1 Fold",
            "PRODUCT"
        ],
        [
            "Seasonic",
            "PERSON"
        ],
        [
            "the Vision SEV",
            "ORG"
        ],
        [
            "Wi-Fi 6 Release 2",
            "ORG"
        ],
        [
            "the end of 2022",
            "DATE"
        ],
        [
            "the Zephyr Pro",
            "ORG"
        ],
        [
            "Homebrew",
            "ORG"
        ],
        [
            "Sony",
            "ORG"
        ],
        [
            "ASUS Zenbook 17 Fold",
            "PRODUCT"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "Kinetic",
            "NORP"
        ],
        [
            "Xbox",
            "ORG"
        ],
        [
            "Sony Mobility Inc.",
            "ORG"
        ],
        [
            "ASUS",
            "ORG"
        ],
        [
            "52",
            "DATE"
        ],
        [
            "last year's",
            "DATE"
        ],
        [
            "season",
            "DATE"
        ],
        [
            "Vision EV",
            "ORG"
        ],
        [
            "Nintendo",
            "ORG"
        ],
        [
            "Christine",
            "PERSON"
        ],
        [
            "80",
            "CARDINAL"
        ],
        [
            "the PlayStation Store",
            "FAC"
        ],
        [
            "Microsoft",
            "ORG"
        ],
        [
            "MIMO",
            "ORG"
        ],
        [
            "European",
            "NORP"
        ],
        [
            "CyberPower",
            "ORG"
        ],
        [
            "Razer",
            "ORG"
        ],
        [
            "the Wi-Fi Alliance",
            "ORG"
        ],
        [
            "17-inch",
            "QUANTITY"
        ],
        [
            "Kosovo",
            "GPE"
        ],
        [
            "8-inch",
            "QUANTITY"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "CES",
            "ORG"
        ],
        [
            "PlayStation 5",
            "PRODUCT"
        ],
        [
            "Cthulhu",
            "PERSON"
        ],
        [
            "three",
            "CARDINAL"
        ],
        [
            "the Wi-Fi 4",
            "FAC"
        ],
        [
            "the Wi-Fi 6",
            "ORG"
        ],
        [
            "24-inch",
            "QUANTITY"
        ],
        [
            "Project Sophia",
            "ORG"
        ],
        [
            "55-inch",
            "QUANTITY"
        ],
        [
            "the Razer Zephyr",
            "ORG"
        ],
        [
            "Xbox",
            "FAC"
        ],
        [
            "Zenbook Duo",
            "ORG"
        ],
        [
            "the Wi-Fi 5",
            "ORG"
        ],
        [
            "RGB Chroma",
            "ORG"
        ],
        [
            "the Samsung Freestyle",
            "ORG"
        ],
        [
            "one day",
            "DATE"
        ],
        [
            "Seasonic",
            "ORG"
        ],
        [
            "Tech",
            "ORG"
        ],
        [
            "RGB",
            "ORG"
        ],
        [
            "VR",
            "ORG"
        ]
    ]
}