{
    "video_id": "Ayn-gUuN3c4",
    "title": "Making old GPUs NEW again!",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-11-16T01:25:00Z",
    "video_url": "https://www.youtube.com/watch?v=Ayn-gUuN3c4",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "chip shortage",
        "supply shortage",
        "stock shortage",
        "shortage",
        "supply chain",
        "rtx 2060 12GB",
        "GPU",
        "graphics card",
        "RTX 3080",
        "GPU shortage",
        "PC gaming",
        "PC",
        "DIY PC",
        "PC building",
        "build",
        "build a PC",
        "budget",
        "gaming",
        "Nvidia",
        "geforce",
        "RTX"
    ],
    "views": 521997,
    "likes": 30468,
    "comments_count": 841,
    "description": "Buy a Seasonic Ultra Titanium PSU\nOn Amazon: https://geni.us/q4lnefC\nOn NewEgg: https://lmg.gg/8KV3S\n\n► LISTEN TO THE TECH NEWS: https://lmg.gg/TechLinkedPodcast\n►GET MERCH: http://www.LTTStore.com/\n►SUPPORT US ON FLOATPLANE: https://www.floatplane.com/  \n►LTX EXPO: https://www.ltxexpo.com/   \n\nNEWS SOURCES: https://lmg.gg/B7pGa\n---------------------------------------------------\nTimestamps:\n0:00 do not go on the internet\n0:08 RTX 2060 12GB + GTX 1650\n1:13 12th gen Alder Lake mobile leaks\n2:01 Halo Infinite multiplayer + more\n3:10 Seasonic Prime power supplies\n3:41 QUICK BITS\n3:47 Russia blows up satellite\n4:15 Some A320 mobos support Ryzen 5000\n4:39 FBI email server hacked\n5:09 GTA Trilogy back on PC\n5:33 IBM Eagle Quantum Processor\n\nAFFILIATES & REFERRALS\n---------------------------------------------------\n►Affiliates, Sponsors & Referrals: https://lmg.gg/sponsors\n►Private Internet Access VPN: https://lmg.gg/pialinus2\n►MK Keyboards: https://lmg.gg/LyLtl\n►Nerd or Die Stream Overlays: https://lmg.gg/avLlO\n►Official Game Store: https://www.nexus.gg/ltt\n►Amazon Prime: https://lmg.gg/8KV1v\n►Audible Free Trial: https://lmg.gg/8242J\n►Our Gear on Amazon: https://geni.us/OhmF\n \nFOLLOW US ELSEWHERE\n---------------------------------------------------  \nTwitter: http://twitter.com/TechLinkedYT\nInstagram: http://instagram.com/TechLinkedYT\nFacebook: http://facebook.com/TechLinked  \n\nFOLLOW OUR OTHER CHANNELS\n---------------------------------------------------  \nLinus Tech Tips: https://lmg.gg/linustechtipsyt\nMac Address: https://lmg.gg/macaddress\nTechquickie: https://lmg.gg/techquickieyt\nShortCircuit: https://lmg.gg/shortcircuityt\nLMG Clips: https://lmg.gg/lmgclipsyt\nChannel Super Fun: https://lmg.gg/channelsuperfunyt\nThey're Just Movies podcast: https://lmg.gg/TheyreJustMovies",
    "description_links": [
        "https://geni.us/q4lnefC",
        "https://lmg.gg/8KV3S",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/B7pGa",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/TheyreJustMovies"
    ],
    "transcript": "- Wow. Brave of you to go on the internet to watch this. I was on there this morning and it is, it's rough out there. Okay. As supply shortages continue to ravage the globe. It seems like tech companies are scraping the bottom of the barrel. Gamers Nexus is reporting their sources claiming, Nvidia plans to rerelease a version of the nearly three year old RTX 2060 with an upgraded 12 gigabytes of V Ram. A move that has been rumored many times over the past year. As tech Jesus notes, it's unclear why and now low tier card would get so much RAM but the move makes about as much sense as anything else going on out there in the world these days. British Columbia is being flooded months after our towns, caught fire from the heat dome. Dennis is an emotional wreck. He is barely standing up behind the camera desk. It's gonna be fine. ASUS is also releasing new creator focused Vivo book OLED laptops with the GTX 1650 as an option. Although that GPU is equipped with GDDR6 instead of GDDR5, but the point is, we may be getting to the point where your only options for hardware upgrades are parts from two years ago. Back when they made things to last. (nostalgic piano music) Those were the days. But if you are hell-bent on acquiring new hardware, a cascade of leaks concerning Intel's upcoming mobile versions of their 12th Gen Alder Lake processors has hit the web. A Geekbench result has the Core i7 12700H performing worse than the 11800H in single core performance, but slightly better in multi-core. And we've got the 12800H beating the Ryzen 5800H by 25%. Specs for various SKUs in the lineup have also leaked, and there's even some unreleased desktop processors being peddled on E-bay. Although they appear to largely be engineering samples. So, if you're just a gamer looking for a few extra frames, I'd probably leave those alone. Let the Linuses of the world overpay for the privilege of wasting days, trying to get a sketchy chip to work. It's what he's good at. We make YouTube videos. And today Microsoft is celebrating 20 years since the introduction of the first X-Box console with the surprise release of Halo Infinite, free to play multiplayer mode on console and PC. I already downloaded it. Wanna play Dennis? Big Halo guy. - [Dennis] No. - What's your gun of choice. Say the needler. - [Dennis] I don't play that. - We also got a teaser for the Halo TV series coming to Paramount plus of all places. Apparently starring the Master chief and Cortana. Whoa, that is not going to be good probably. Phil Spencer gave an interview that pretty much confirmed Elder Scrolls 6 as an Xbox slash game pass exclusive. But again, that might be better news than it originally seemed. Given that trying to buy a PS5 right now is like trying to hit somebody with a spartan laser. Why did they make that so hard? Microsoft also added 70 backwards compatible titles with support for auto HDR and FBS boost. And I hope Nintendo is watching. Meanwhile, Ubisoft comes in here with a tweet about it being the 10-year anniversary of Assassin's creed revelations. Like, come on, read the room. [Explosion] This isn't about you. Ubisoft. It's about the pew pew. Now, it's time for quick bits brought to you by Seasonic and their prime TX 1000 watt power supply for high performance systems. It's got an 80 plus titanium rating. Meaning less power gets wasted during power conversion, and more gets funneled towards your awesome other PC components that you won't be upgrading any time soon. The prime TX is fully modular with hybrid fan control and fluid dynamic fan bearings, to reduce overall fan noise. And it comes with a 12 year, 12 year warranty. Learn more at seasonic.com or the link below. Quick bits are the way we connect to the universe around us. They, oh my God, here they come. Russia appears to have blown up its own satellite with a ground-based missile as part of a weapons test resulting in at least, 1500 pieces of debris that may have buzzed the International space station multiple times. The US state department is condemning Russia's actions because what the. But apparently, space capable countries do this all the time and worry about consequences later which is why we need Elon in charge of all this. He'll sort things out. Maybe tweet about the debris and it will crash. I don't know. ASUS has joined gigabyte in releasing official firmware updates for old A320 motherboards that will allow them to use current gen Ryzen 5000 processors. It's another move that will let users hold on to old tech as long as they're okay missing out on some cutting-edge features. It's like choosing to eat a two week old sandwich for lunch, like I did today. Yeah, it doesn't taste great, but I'm doing fine. Hackers were able to send official looking emails from a compromised FBI server late last week, in an apparent attempt to frame Vinny Troia, who's not a member of the mafia, but the leader of some web security firms for data breaches. Why am I not surprised by the fact the FBI's emails got hacked? It's because I imagine them as old guys in baggy suits, probably still running windows XP at home. Yes. My entire mental image of them is based of Miss congeniality. Did you see that Dennis, Sandra Bullock great performance. Rockstar has finally brought the remastered GTA trilogy definitive edition back to a playable state on PC. Although not all the games performance issues have been addressed. Modders are working on that though. Fixing key problems like the games rain system. For a game about incorrigible criminals. There's sure a lot of altruism going on there. You can grand theft my auto, anytime. In a video game not in. And IBM has unveiled Eagle, a new 127 qubit quantum processor that the company claims cannot be simulated by a classical computer. They're not claiming quantum supremacy, like Google did in 2019 in which almost everyone disputes. And they're also not stating the processor's quantum volume, which is a general measure of its capability. It's just, it's just a quantum processor. Okay. Maybe it's pretty good. But hey that's quantum computing where everything's made up and the qubits don't matter. Time for me to make up a reason to end this episode. Come back on Wednesday for more tech news. Maybe you'll catch us in superposition or not, or both. Woo.",
    "transcript_keywords": [
        "year",
        "quantum",
        "time",
        "Halo",
        "quantum processor",
        "tech",
        "performance",
        "Dennis",
        "Alder Lake processors",
        "move",
        "processors",
        "processor",
        "days",
        "game",
        "make",
        "Wow",
        "Gen Alder Lake",
        "play",
        "good",
        "years"
    ],
    "transcript_entities": [
        [
            "Sandra Bullock",
            "PERSON"
        ],
        [
            "12800H",
            "CARDINAL"
        ],
        [
            "Core",
            "ORG"
        ],
        [
            "12 year",
            "DATE"
        ],
        [
            "11800H",
            "CARDINAL"
        ],
        [
            "the nearly three year old",
            "DATE"
        ],
        [
            "Intel",
            "ORG"
        ],
        [
            "late last week",
            "DATE"
        ],
        [
            "FBI",
            "ORG"
        ],
        [
            "127",
            "CARDINAL"
        ],
        [
            "TX",
            "GPE"
        ],
        [
            "GTA",
            "ORG"
        ],
        [
            "Elon",
            "PRODUCT"
        ],
        [
            "British Columbia",
            "GPE"
        ],
        [
            "Ubisoft",
            "PERSON"
        ],
        [
            "US",
            "GPE"
        ],
        [
            "1000 watt",
            "QUANTITY"
        ],
        [
            "IBM",
            "ORG"
        ],
        [
            "70",
            "CARDINAL"
        ],
        [
            "Seasonic",
            "PERSON"
        ],
        [
            "Google",
            "ORG"
        ],
        [
            "the days",
            "DATE"
        ],
        [
            "Big Halo",
            "PERSON"
        ],
        [
            "2019",
            "DATE"
        ],
        [
            "Halo TV",
            "ORG"
        ],
        [
            "10-year",
            "DATE"
        ],
        [
            "months",
            "DATE"
        ],
        [
            "YouTube",
            "PERSON"
        ],
        [
            "12 gigabytes",
            "QUANTITY"
        ],
        [
            "FBS",
            "ORG"
        ],
        [
            "2060",
            "CARDINAL"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "Dennis",
            "PERSON"
        ],
        [
            "80",
            "CARDINAL"
        ],
        [
            "Jesus",
            "PERSON"
        ],
        [
            "V Ram",
            "ORG"
        ],
        [
            "Geekbench",
            "PRODUCT"
        ],
        [
            "Microsoft",
            "ORG"
        ],
        [
            "Halo Infinite",
            "ORG"
        ],
        [
            "Paramount",
            "ORG"
        ],
        [
            "Nintendo",
            "PERSON"
        ],
        [
            "A320",
            "PRODUCT"
        ],
        [
            "PS5",
            "ORG"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "these days",
            "DATE"
        ],
        [
            "Nvidia",
            "ORG"
        ],
        [
            "two years ago",
            "DATE"
        ],
        [
            "Ubisoft",
            "ORG"
        ],
        [
            "25%",
            "PERCENT"
        ],
        [
            "20 years",
            "DATE"
        ],
        [
            "Wednesday",
            "DATE"
        ],
        [
            "12th",
            "ORDINAL"
        ],
        [
            "Vinny Troia",
            "PERSON"
        ],
        [
            "GPU",
            "ORG"
        ],
        [
            "Phil Spencer",
            "PERSON"
        ],
        [
            "Cortana",
            "PERSON"
        ],
        [
            "Russia",
            "GPE"
        ],
        [
            "two week old",
            "DATE"
        ],
        [
            "Eagle",
            "ORG"
        ],
        [
            "quantum",
            "ORG"
        ],
        [
            "5800H",
            "DATE"
        ],
        [
            "this morning",
            "TIME"
        ],
        [
            "GDDR5",
            "PRODUCT"
        ],
        [
            "windows XP",
            "PRODUCT"
        ],
        [
            "Xbox",
            "ORG"
        ],
        [
            "Rockstar",
            "ORG"
        ],
        [
            "Assassin",
            "PERSON"
        ],
        [
            "ASUS",
            "ORG"
        ],
        [
            "the past year",
            "DATE"
        ],
        [
            "Linuses",
            "PERSON"
        ],
        [
            "1500",
            "CARDINAL"
        ],
        [
            "GDDR6",
            "PERSON"
        ],
        [
            "Gen Alder Lake",
            "FAC"
        ]
    ]
}