{
    "video_id": "bnyujlc_vMU",
    "title": "Is there any hope for OnlyFans?",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-08-21T02:23:28Z",
    "video_url": "https://www.youtube.com/watch?v=bnyujlc_vMU",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "OnlyFans",
        "Mastercard",
        "Onlyfans bans porn",
        "Onlyfans rules",
        "terms of conduct",
        "OnlyFans alternatives",
        "OnlyFans payment",
        "OnlyFans Mastercard"
    ],
    "views": 455531,
    "likes": 32099,
    "comments_count": 1032,
    "description": "The first 100 people to go to https://blinkist.com/techlinked are going to get unlimited access for 1 week to try it out. You’ll also get 25% off if you want the full membership.\n\n► LISTEN TO THE TECH NEWS: https://lmg.gg/TechLinkedPodcast\n►GET MERCH: http://www.LTTStore.com/\n►SUPPORT US ON FLOATPLANE: https://www.floatplane.com/  \n►LTX EXPO: https://www.ltxexpo.com/   \n\nNEWS SOURCES: https://lmg.gg/cxaEA\n---------------------------------------------------\n\nTimestamps:\n0:00 IT'S SO OBVIOUS\n0:17 OnlyFans to ban its main content\n1:34 Intel Architecture Day stuff\n2:36 Tesla Bot\n3:35 Blinkist\n4:29 QUICK BITS\n4:35 Windows 11 default browser shenanigans\n5:04 Facebook metaverse for work\n5:33 Amazon department store \n5:55 No co-op in Halo Infinite??\n6:17 Laser Fusion!! \n\nAFFILIATES & REFERRALS\n---------------------------------------------------\n►Affiliates, Sponsors & Referrals: https://lmg.gg/sponsors\n►Private Internet Access VPN: https://lmg.gg/pialinus2\n►MK Keyboards: https://lmg.gg/LyLtl\n►Nerd or Die Stream Overlays: https://lmg.gg/avLlO\n►Official Game Store: https://www.nexus.gg/ltt\n►Amazon Prime: https://lmg.gg/8KV1v\n►Audible Free Trial: https://lmg.gg/8242J\n►Our Gear on Amazon: https://geni.us/OhmF\n \nFOLLOW US ELSEWHERE\n---------------------------------------------------  \nTwitter: http://twitter.com/TechLinkedYT\nInstagram: http://instagram.com/TechLinkedYT\nFacebook: http://facebook.com/TechLinked  \n\nFOLLOW OUR OTHER CHANNELS\n---------------------------------------------------  \nLinus Tech Tips: https://lmg.gg/linustechtipsyt\nMac Address: https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw\nTechquickie: https://lmg.gg/techquickieyt\nShortCircuit: https://lmg.gg/shortcircuityt\nLMG Clips: https://lmg.gg/lmgclipsyt\nChannel Super Fun: https://lmg.gg/channelsuperfunyt\nCarpool Critics: https://lmg.gg/carpoolcriticsyt",
    "description_links": [
        "https://blinkist.com/techlinked",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/cxaEA",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- So someone who's funnier than all of us here pointed out that we missed a joke on Wednesday about putting exploding gigabyte power supplies around servers for protection, and naturally you would call that a firewall! - [Riley] Aye! Okay, there he goes. - See my self outside. OnlyFans has announced they'll be banning content with sexually explicit conduct from their platform. OnlyFans, not a service anymore. That's your business. What else is on there? Turns out nudity will still be allowed, but OnlyFans says they're making the move to comply with the requests of their banking partners and payout providers, which was the same excuse Patreon gave when they banned adult content in 2018. Many are pointing to MasterCard as the main villain here also known as masterhard. - [Riley] What? - Which in April, toughened its rules requiring platforms to report illegal content like that involving minors or trafficking victims. To be fair, OnlyFans has struggled to identify and take down illegal content. A new BBC investigation found that the platform gave additional warnings to successful creators who published illegal content. And the BBC reporters found many videos on the platform showing the exploitation of homeless people and child abuse. They even created accounts, advertising themselves as teenagers with photos for sale, and OnlyFans didn't catch them until the BBC pointed them out. OnlyFans may have screwed over the adult content creators who popularized it, but alternative platforms like JustForFans are welcoming them in. So don't worry. There'll be plenty of ways to buy feet picks. - [Riley] Thank goodness. - After Intel announced its gaming GPU brand would be called Arc with a C earlier this week, team blue has revealed its competitor to Nvidia and AMD super sampling technologies. Intel Z super sampling, or ZSS. - [Riley] Nope. - XESS. - [Riley] Yes. - XeSS, XeSS has a lowercase E for some reason uses a combination of spatial and temporal AI image up scaling techniques, similar to NVIDIA's DLSS 2.0. And sure, the demo looks good, but demos always look good! Otherwise they wouldn't be a demo. You know? - That's what demos are for. - The demo looks bad, you just keep it to yourself. You never sold the ShamWow before? (laughs) Intel also release some new details as well as all their late CPUs which will feature a hybrid design with powerful Golden Cove cores and power efficient Gracemont cores, which will show up in laptops this fall. I'm going to wait and see how they turn out though, because you never know with hybrids. You could get ninja turtles, or you could get the fly. - [Riley] You just put it in the machine. - And Tesla is about two years behind on making its cars fully autonomous, but Elon Musk apparently thinks they're ready for the next step: an autonomous humanoid robot. Yesterday, Elon unveiled the Tesla bot at the company's AI day event. Except it wasn't so much in an unveiling as an announcement that they're working on a prototype of the bot, which will be completed sometime next year, which is Elon speak for you'll be dead. - [Riley] Sometime. - Yeah, just some time. Details about the robot's capabilities were scarce. But Musk did say you'll be able to outrun it. Unlike those things at Boston dynamics. - [Riley] What are they? - I love how this is a feature. It'll be slow. - [Riley] Yeah, you can overpower it! - Critics were quick to point out this announcement is coming right as the government investigates a series of incidents involving Teslas crashing into emergency vehicles while others legitimately asked whether this is just Elon's idea of a funny, funny joke. Funny, man. - Hilarious. - I mean, they had a guy dance on the stage in spandex. He was pretty good though. Hey Riley, tell me something. - [Riley] Okay. - Now it's time for Quick Bits, brought to you by Blinkist, the app that takes the best insights and important info from thousands of non-fiction books and condenses them into about 15 minute chunks because yeah, it would be nice to have the time and energy to sit down and read full books and if you do, I'm genuinely happy for you. For everyone else, Blinkist summaries can be read or listened to on the go with thousands of titles in 27 categories like philosophy, parenting, history and personal growth. Learn about how to be a Jack of all trades with micro mastery or how the CEO of YouTube's mom raised three genius daughters without even using alchemy. Blinkist also has shortened podcasts and full length audio books for up to 65% off retail price. 14 million active users can't be wrong. So check out Blinkist and the first 100 people to go to our link, blinkist.com/techlinked, will also get 25% off a full membership. - Quick Bits, if you leave them outside in a rainstorm they'll soften up real nice. - [Riley] Get a little chewy. - They get big, they get swell. Users running Windows 11 Developer Preview have noticed that Microsoft is making it much harder to switch the default browser to something other than Edge. If you don't click the 'use this app by default' box the first time you open up a web link, it will never show up again and you'll have to manually set a default program for every file type in settings. - [Riley] That's like 12. - The last time Microsoft pulled a stunt like this, they got convicted of anti-competitive behavior. So here's hoping Redmond remembers it's past transgressions. Facebook has announced hor, I thought that said a horizontal workrooms. Horizon work rooms! Horizontal. Facebook has announced Horizon Workrooms, a VR coworking space that the company hopes to kickstart it's metaverse for work. No one wants a metaverse for work, Mark. But they better not try too hard to monopolize the business VR industry because they're already getting sued for the second time by the FTC who wants them to sell off Instagram. Get rid of it, cut it off. - [Riley] Destroy it. - According to insiders, Amazon is planning to open department stores in the US offering clothing, household items, electronics, you know, the works like a Walmart, which is ironic, given that Amazon has played a role in killing in-store retail to a large extent, it's like slaying a dragon and they're using its corpse to terrorize the villagers yourself. Total Jeff move. - [Riley] That's capitalism. - (laughs) Halo Infinite will not launch with a co-op campaign or a forge map building mode. Two features that have become major attractions for the franchise. Become, Riley? Co-op is a main stay. They'll apparently arrive in later updates. But you know what else came in an update? This. - [Riley] Oh, there it is. There he is. - This. This. - No, James! - And researchers of the national ignition facility in California have taken a huge step towards sustainable fusion reactors. They fired lasers out a hydrogen isotope triggering an explosion with 70% of the energy contained in the laser pulse, which has many more times than the 3% return of energy such experiments have produced previously. The properly ignited fusion reaction, like the ones powering the sun would produce more energy than they receive. It's the most selfless altruistic of all reactions. - [Riley] That's so nice of it, that reaction. - And it's really nice of you to watch all the way to the end of this episode. Come back on Monday for more Tech News. And don't forget to put more energy into the world than you take from it. - [Riley] I think that you would die. - That's a Beatles quote, I think. It's on the tombstone of John Lennon. Eleanor Rigby",
    "transcript_keywords": [
        "putting exploding gigabyte",
        "Wednesday about putting",
        "exploding gigabyte power",
        "gigabyte power supplies",
        "servers for protection",
        "putting exploding",
        "exploding gigabyte",
        "supplies around servers",
        "OnlyFans",
        "content",
        "illegal content",
        "Wednesday",
        "time",
        "joke on Wednesday",
        "Elon",
        "Blinkist",
        "energy",
        "BBC",
        "adult content",
        "gigabyte power"
    ],
    "transcript_entities": [
        [
            "- Quick Bits",
            "ORG"
        ],
        [
            "Arc",
            "PERSON"
        ],
        [
            "sometime next year",
            "DATE"
        ],
        [
            "Patreon",
            "PERSON"
        ],
        [
            "Boston",
            "GPE"
        ],
        [
            "Intel",
            "ORG"
        ],
        [
            "three",
            "CARDINAL"
        ],
        [
            "earlier this week",
            "DATE"
        ],
        [
            "Elon",
            "ORG"
        ],
        [
            "about two years",
            "DATE"
        ],
        [
            "Tesla",
            "ORG"
        ],
        [
            "Riley",
            "PERSON"
        ],
        [
            "Horizontal",
            "PRODUCT"
        ],
        [
            "US",
            "GPE"
        ],
        [
            "NVIDIA",
            "ORG"
        ],
        [
            "April",
            "DATE"
        ],
        [
            "Mark",
            "PERSON"
        ],
        [
            "2018",
            "DATE"
        ],
        [
            "3%",
            "PERCENT"
        ],
        [
            "John Lennon",
            "PERSON"
        ],
        [
            "Jack",
            "PERSON"
        ],
        [
            "Horizon Workrooms",
            "ORG"
        ],
        [
            "100",
            "CARDINAL"
        ],
        [
            "Amazon",
            "ORG"
        ],
        [
            "FTC",
            "ORG"
        ],
        [
            "second",
            "ORDINAL"
        ],
        [
            "XeSS",
            "ORG"
        ],
        [
            "Blinkist",
            "ORG"
        ],
        [
            "Teslas",
            "PRODUCT"
        ],
        [
            "about 15 minute",
            "TIME"
        ],
        [
            "Walmart",
            "ORG"
        ],
        [
            "up to 65%",
            "PERCENT"
        ],
        [
            "Instagram",
            "ORG"
        ],
        [
            "Microsoft",
            "ORG"
        ],
        [
            "Edge",
            "ORG"
        ],
        [
            "Quick Bits",
            "PRODUCT"
        ],
        [
            "Halo Infinite",
            "ORG"
        ],
        [
            "Eleanor Rigby",
            "PERSON"
        ],
        [
            "Blinkist",
            "NORP"
        ],
        [
            "Golden Cove",
            "FAC"
        ],
        [
            "Horizon",
            "PERSON"
        ],
        [
            "MasterCard",
            "ORG"
        ],
        [
            "AMD",
            "ORG"
        ],
        [
            "ZSS",
            "FAC"
        ],
        [
            "thousands",
            "CARDINAL"
        ],
        [
            "Nvidia",
            "ORG"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "14 million",
            "CARDINAL"
        ],
        [
            "Facebook",
            "ORG"
        ],
        [
            "Gracemont",
            "ORG"
        ],
        [
            "Tech News",
            "ORG"
        ],
        [
            "25%",
            "PERCENT"
        ],
        [
            "Elon Musk",
            "PERSON"
        ],
        [
            "Wednesday",
            "DATE"
        ],
        [
            "Monday",
            "DATE"
        ],
        [
            "GPU",
            "ORG"
        ],
        [
            "California",
            "GPE"
        ],
        [
            "27",
            "CARDINAL"
        ],
        [
            "Beatles",
            "PERSON"
        ],
        [
            "Two",
            "CARDINAL"
        ],
        [
            "BBC",
            "ORG"
        ],
        [
            "12",
            "CARDINAL"
        ],
        [
            "Windows 11",
            "PRODUCT"
        ],
        [
            "Redmond",
            "PERSON"
        ],
        [
            "Yesterday",
            "DATE"
        ],
        [
            "YouTube",
            "ORG"
        ],
        [
            "James",
            "PERSON"
        ],
        [
            "70%",
            "PERCENT"
        ],
        [
            "this fall",
            "DATE"
        ]
    ]
}