{
    "video_id": "EaRhaLhhakw",
    "title": "Apple Calls This 'Pro'?",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-06-28T01:38:03Z",
    "video_url": "https://www.youtube.com/watch?v=EaRhaLhhakw",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Apple",
        "M2",
        "Macbook Pro",
        "13 inch Macbook pro",
        "M2 SSD",
        "M1 SSD",
        "M2 SSD slow",
        "speed",
        "performance",
        "review",
        "benchmarks",
        "Apple M2"
    ],
    "views": 511732,
    "likes": 28700,
    "comments_count": 686,
    "description": "Thanks to Secret Lab for sponsoring today's video! Check them out at https://lmg.gg/SecretLabTL\n\n► LISTEN TO THE TECH NEWS: https://lmg.gg/TechLinkedPodcast\n►GET MERCH: http://www.LTTStore.com/\n►SUPPORT US ON FLOATPLANE: https://www.floatplane.com/\n►LTX EXPO: https://www.ltxexpo.com/\n\nNEWS SOURCES: https://lmg.gg/tSobE\n---------------------------------------------------\nTimestamps:\n0:00 heeeey\n0:09 M2 SSD half as fast as M1's\n1:28 Please Don't Mod Steam Deck(?)\n2:23 Cyberpunk 2077 whistleblower\n3:14 Secret Lab\n3:46 QUICK BITS\n3:52 Ryzen 7000X3D\n4:36 Valorant monitoring voice chats\n5:07 Juul ban put on hold\n5:36 Google Hangouts shutting down in Nov.\n6:00 OpenAi Minecraft AI\n\n\nFOLLOW US ELSEWHERE\n---------------------------------------------------  \nTwitter: http://twitter.com/TechLinkedYT\nInstagram: http://instagram.com/TechLinkedYT\nFacebook: http://facebook.com/TechLinked",
    "description_links": [
        "https://lmg.gg/SecretLabTL",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/tSobE",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- Oh, you would love to hear some tech news right now, wouldn't you? You're all about tech... You're weird, you're such a wacky and fun person, I love that. Apple shocked the world with their first M1 MacBooks. I mean, they were ARM-powered laptops that outperformed nearly anything in their weight class. But Apple doesn't seem too worried about what people think of the new M2-powered 13\" inch MacBook Pro. It's the sequel curse, it's everywhere. YouTubers Max Tech and Created Tech, no relation, have found that the SSD in the base-level M2 MacBook Pro performs as much as 50% slower than it's M1 predecessor. But, hey, playing devil's advocate here, the number next to the M went up by a 100%, so trade offs. At least part of the explanation seems to involve Apple using a single NAND chip instead of multiple chips, potentially as a result of the global chip shortage. The other possibility is that Apple is just trying to make people ask themselves why they're buying the base model of the fancy pro laptops. So you can tell people it's a pro? It makes about as much sense as paying $50 for a burger, it's a burger. Yeah, come at me foodies. If you really wanna spend your money on an M2 chip ASAP, might as well just wait for January when Apple's AR headset is expected to arrive. Shout your feelings from the rooftops in Apple's private metaverse. Everything is made of brushed metal, white plastic, pristine. Valve would once again like to reiterate the message from its initial Steam Deck tear-down video, which simultaneously showed owners of the gaming handheld how to take it apart and told them they should not do this. Because it's 2022 and mixed messages are in, try to keep up. See, last week, a modder replaced their deck's stock-2230-size SSD with a larger 2242 drive. PC Gamer wrote an article about it, which was \"tweeted\" by one of the Steam Deck designers, Lawrence Yang, who warned that such a mod could draw more power and shorten the life of the deck. The modder, who goes by Belly Jelly on Twitter, nice one, actually agreed with Yang. Although they just went on to say their thermals look just fine. So the moral of the story is the same one from Valve's tear-down video, don't mess with your Steam Deck, and then you do a big wink. What does it mean? Open to interpretation. And Cyberpunk 2077 shocked the gaming world when it turned out one of the most hyped PC games of all time was launching as a buggy, barely playable mess. But now, a whistleblower has shed light on just what the (beep) might have happened. YouTuber, Upper Echelon Gamers was sent a trove of documents from Quantic Labs, the quality assurance company working with CD Projekt Red to test the game, which indicate the QA process was plagued by mismanagement and straight up lies about the number and experience level of the testers working on the project. The information may go some way towards explaining how the studio behind the incredibly highly-acclaimed \"Witcher 3\" managed to put out the game equivalent of \"The Thing\" from John Carpenter's 1982 horror classic, which we're doing on They're Just Movies this week, with Nick Plooff, so subscribe to our movie podcast. Now it's time for quick bits, brought to you by Secret Lab, maker of chairs engineered to keep you incredibly comfortable for long hours, at work and play or both at the same time, if you're an eSports player. Their new TITAN Evo 2022 chair will make you forget all about the question of whether playing video games is actually work or not because of their amazing four-way lumbar support, ultra-comfortable line of different seat materials, and up to a five-year extended warranty and 49-day of return policy. You could almost use it for your whole eSports career, and then return it after. Head to the link of the description and check out Secret Lab today. Quick bits! Yes, please. (chomping noise) AMD's special 3D V-Cache equipped Ryzen 7 5800X3D arrived a while after the rest of the 5,000-series lineup, but a couple leaks are making it look like team Red may launch a Vcash Ryzen 7,000 CPU pretty shortly after it's lower-powered brethren drop later this year. The processor reportedly codenamed RaphaelX, he's the one with the sais, is already in mass production according to prominent leaker Greymon55, indicating it could very well launch before the end of the year to take on Intel's 13th-gen Raptor Lake chips. So PCs are about to get some brand new CPUs. The catch is, they'll make your SSD go half as fast, that's just how things are now, Apple said. Overwatch SCS go-shooter Valorant will begin recording players' voice chats on July 13th, according to a blog post from Riot Games. But don't worry it's not that creepy. Riot says they'll initially only be using the recorded data to train AI language models which will then be used to detect violations of community guidelines when the system launches later this year. So I meant to say yet, it's not that creepy yet. Hey, try not to use sarcasm in game and then the bot won't be able to detect it. Was I being sarcastic? An appeals court has paused the FDA's ban on sales of Juul's e-cigarettes after the company filed an emergency motion last week. Since the ban would effectively put Juul outta business, the company was considering filing for bankruptcy. Hopefully this mess gets sorted out before all the kids completely move on to other vape brands, such as Puff Bar, Vuse and SMOK, smoke without an E. I wouldn't wanna be seen at school with a SMOK. Google has announced it will finally be shutting down its Google Hangouts chat service in November which I thought it had already done a while back. Anyways, users are being encouraged to migrate to Google Chat, which is different, where they are to await further instructions on where to move after Chat is inevitably shut down. Don't go to Google Meet, 'cause that's merging with Duo and becoming Meet. And OpenAI, the makers of the meme generator, DALL.E that's what we're calling, that's all it is now, have trained an AI to play Minecraft by making it watch 70,000 hours of Minecraft gameplay videos. The bot can apparently craft diamond tools, a task that takes humans around 20 minutes. Next step, training an AI to generate DALL.E memes by placing blocks in Minecraft. That's like next level and then we will die. That'll be just the end of us, I think. Just like it's the end of this episode. Come back on Wednesday for more tech news just for you, you silly tech news goose. Honk if you love tech news. (honking) That's you. Oh, you're so great.",
    "transcript_keywords": [
        "Apple",
        "tech",
        "Steam Deck",
        "Deck",
        "MacBook Pro",
        "YouTubers Max Tech",
        "love tech",
        "Pro",
        "Steam Deck teardown",
        "Secret Lab",
        "Google",
        "Max Tech",
        "Created Tech",
        "love",
        "Google Hangouts chat",
        "initial Steam Deck",
        "Steam Deck designers",
        "inch MacBook Pro",
        "Steam",
        "SSD"
    ],
    "transcript_entities": [
        [
            "eSports",
            "ORG"
        ],
        [
            "70,000 hours",
            "TIME"
        ],
        [
            "M2 MacBook Pro",
            "ORG"
        ],
        [
            "Raptor Lake",
            "PRODUCT"
        ],
        [
            "long hours",
            "TIME"
        ],
        [
            "Belly Jelly",
            "PERSON"
        ],
        [
            "M2",
            "PRODUCT"
        ],
        [
            "Google Hangouts",
            "ORG"
        ],
        [
            "Google",
            "ORG"
        ],
        [
            "Secret Lab",
            "PERSON"
        ],
        [
            "Twitter",
            "ORG"
        ],
        [
            "Duo",
            "ORG"
        ],
        [
            "Upper Echelon Gamers",
            "ORG"
        ],
        [
            "the end of the year",
            "DATE"
        ],
        [
            "January",
            "DATE"
        ],
        [
            "AMD",
            "ORG"
        ],
        [
            "Witcher 3",
            "WORK_OF_ART"
        ],
        [
            "NAND",
            "PRODUCT"
        ],
        [
            "YouTubers Max Tech",
            "ORG"
        ],
        [
            "stock-2230",
            "DATE"
        ],
        [
            "1982",
            "DATE"
        ],
        [
            "Vcash Ryzen",
            "ORG"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "FDA",
            "ORG"
        ],
        [
            "Cyberpunk 2077",
            "PRODUCT"
        ],
        [
            "Valorant",
            "ORG"
        ],
        [
            "Created Tech",
            "ORG"
        ],
        [
            "as much as 50%",
            "PERCENT"
        ],
        [
            "Projekt Red",
            "ORG"
        ],
        [
            "The Thing",
            "WORK_OF_ART"
        ],
        [
            "13th-gen",
            "DATE"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "M1",
            "PRODUCT"
        ],
        [
            "five-year",
            "DATE"
        ],
        [
            "Yang",
            "PERSON"
        ],
        [
            "Chat",
            "GPE"
        ],
        [
            "John Carpenter's",
            "PERSON"
        ],
        [
            "Lawrence Yang",
            "PERSON"
        ],
        [
            "this week",
            "DATE"
        ],
        [
            "CPU",
            "ORG"
        ],
        [
            "SSD",
            "ORG"
        ],
        [
            "Riot Games",
            "ORG"
        ],
        [
            "M2-powered",
            "QUANTITY"
        ],
        [
            "49-day",
            "DATE"
        ],
        [
            "Google Chat",
            "ORG"
        ],
        [
            "July 13th",
            "DATE"
        ],
        [
            "Valve",
            "ORG"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "YouTuber",
            "PERSON"
        ],
        [
            "later this year",
            "DATE"
        ],
        [
            "2242",
            "CARDINAL"
        ],
        [
            "Minecraft",
            "PRODUCT"
        ],
        [
            "last week",
            "DATE"
        ],
        [
            "November",
            "DATE"
        ],
        [
            "Google Meet",
            "ORG"
        ],
        [
            "Wednesday",
            "DATE"
        ],
        [
            "Minecraft",
            "GPE"
        ],
        [
            "Juul's",
            "ORG"
        ],
        [
            "Greymon55",
            "PERSON"
        ],
        [
            "MacBook Pro",
            "ORG"
        ],
        [
            "Steam Deck",
            "ORG"
        ],
        [
            "Quantic Labs",
            "PERSON"
        ],
        [
            "Vuse",
            "ORG"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "Nick Plooff",
            "PERSON"
        ],
        [
            "half",
            "CARDINAL"
        ],
        [
            "Riot",
            "PERSON"
        ],
        [
            "100%",
            "PERCENT"
        ],
        [
            "Intel",
            "ORG"
        ],
        [
            "13\" inch",
            "QUANTITY"
        ],
        [
            "AI",
            "ORG"
        ],
        [
            "Evo 2022",
            "PRODUCT"
        ],
        [
            "2022",
            "CARDINAL"
        ],
        [
            "5800X3D",
            "CARDINAL"
        ],
        [
            "four",
            "CARDINAL"
        ],
        [
            "around 20 minutes",
            "TIME"
        ],
        [
            "Puff Bar",
            "ORG"
        ],
        [
            "50",
            "MONEY"
        ],
        [
            "5,000",
            "CARDINAL"
        ]
    ]
}