{
    "video_id": "ecBxqIFRf-o",
    "title": "Intel just pulled an Apple",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-10-28T00:53:24Z",
    "video_url": "https://www.youtube.com/watch?v=ecBxqIFRf-o",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Intel",
        "Alder Lake",
        "12th gen",
        "Intel 12th gen",
        "Intel Alder Lake",
        "CPU",
        "benchmarks",
        "specs",
        "performance",
        "Core i9 12900K",
        "Core i5 12600K",
        "overclocking",
        "processor",
        "pc gaming",
        "custom PC",
        "PC build",
        "DIY PC",
        "PC building",
        "hybrid",
        "hybrid CPU",
        "Apple",
        "M1",
        "M1 Pro",
        "M1 Max"
    ],
    "views": 620300,
    "likes": 30660,
    "comments_count": 868,
    "description": "Learn more about Storyblocks Video at https://www.storyblocks.com/techlinked\n\n► LISTEN TO THE TECH NEWS: https://lmg.gg/TechLinkedPodcast\n►GET MERCH: http://www.LTTStore.com/\n►SUPPORT US ON FLOATPLANE: https://www.floatplane.com/  \n►LTX EXPO: https://www.ltxexpo.com/   \n\nNEWS SOURCES: https://lmg.gg/vOONI\n---------------------------------------------------\nTimestamps:\n0:00 Colton hasn't even seen the movie\n0:07 Intel Alder Lake 12th Gen CPUs\n1:33 N64 on Switch sucks\n2:35 Adobe MAX\n3:22 Storyblocks\n3:58 QUICK BITS\n4:03 Win11 SE on cheap Surface Laptop\n4:34 'low-quality' kids content demonetized\n5:02 Right to Repair stuff\n5:38 Samsung Cloud Game Platform\n6:00 Pimax 12K QLED VR headset\n\nAFFILIATES & REFERRALS\n---------------------------------------------------\n►Affiliates, Sponsors & Referrals: https://lmg.gg/sponsors\n►Private Internet Access VPN: https://lmg.gg/pialinus2\n►MK Keyboards: https://lmg.gg/LyLtl\n►Nerd or Die Stream Overlays: https://lmg.gg/avLlO\n►Official Game Store: https://www.nexus.gg/ltt\n►Amazon Prime: https://lmg.gg/8KV1v\n►Audible Free Trial: https://lmg.gg/8242J\n►Our Gear on Amazon: https://geni.us/OhmF\n \nFOLLOW US ELSEWHERE\n---------------------------------------------------  \nTwitter: http://twitter.com/TechLinkedYT\nInstagram: http://instagram.com/TechLinkedYT\nFacebook: http://facebook.com/TechLinked  \n\nFOLLOW OUR OTHER CHANNELS\n---------------------------------------------------  \nLinus Tech Tips: https://lmg.gg/linustechtipsyt\nMac Address: https://lmg.gg/macaddress\nTechquickie: https://lmg.gg/techquickieyt\nShortCircuit: https://lmg.gg/shortcircuityt\nLMG Clips: https://lmg.gg/lmgclipsyt\nChannel Super Fun: https://lmg.gg/channelsuperfunyt\nThey're Just Movies podcast: https://lmg.gg/TheyreJustMovies",
    "description_links": [
        "https://www.storyblocks.com/techlinked",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/vOONI",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/TheyreJustMovies"
    ],
    "transcript": "- Have you ever heard the wolf cry to the blue corn moon? Me neither, more of a tech news guy. After months of leaks, Intel has finally officially unveiled the first desktop CPUs in its 12th gen Alder Lake lineup. And as Anthony and Linus pointed out on Short circuit and LTT, their kind of a big deal. Okay. The CPU is not the host. I mean, they are a big deal, Love you guys, You're great. But you know. Alder Lake is Intel's first desktop CPU architecture with a hybrid design combining high performance or P-cores, with high efficiency E-cores. Intel has also split the chips TDP wattage rating into processor based power and a Maximum Turbo Power. Which will allow consumers to purchase an appropriate cooler for their setup, instead of going ahead and strapping an air conditioner to their motherboard. Because well, at least then you have it. - [Guy Behind Camera] Might as well - There have been some reports about early cooler compatibility issues with older AIO coolers, despite many companies releasing upgrade kits. So you'll still want to do some Googling, regardless. Both Intel's internal numbers and the leaks are pointing towards Team Blue's 12th gen giving AMD's Ryzen a run for its money. Why do I say leak like that? Holly (bleep) What? Alright, but as usual you should probably wait for full reviews to launch in November 4th, before you go run it out, splaying your arms across store shelves just had the chips sitting on me just a second ago. I swear I saw them. - [Guy Behind Camera] They disappeared! - Where did they go? - [Guy Behind Camera] It's spooky! - Nintendo has launched its expansion pack for Nintendo switch online. Giving switch owners a legitimate way to play nine whole games from the N64 console. That is much worse than any number of other illegitimate ways. Yeah, as if the pack costing an extra $30 a year to retain access to the N64 library wasn't bad enough. Nintendo's method of emulating these games is somehow worse than many third-party emulators that already exist. And in some cases, may even be worse than the emulation seen on Switch's predecessor, the Wii U. - [Guy Behind Camera] I liked it. - Graphics can look jaggy and pixelated compared to existing emulation, and many games have noticeably higher input latency. The default button mapping also kind of sucks. Although that's understandable given that the N64 controller had no business existing. Yet it existed anyway, and that's inspiring. - [Guy Behind Camera] Such courage. Hopefully Nintendo gets their heads out of their ass and figures out that suing their fans for not using Nintendo's janky methods of preserving retro games isn't what Toad would have wanted. - [Guy Behind Camera] He died for nothing! - And Adobe announced a bunch of stuff at their max conference, including updated apps for Apple Silicon Max, Raw Format Support for Photoshop on iPad and extremely paired-down, web-based versions of Photoshop and Illustrator for people who find the full versions a little too intimidating. But Adobe also took the opportunity to fully hop on board the NFT hype train, choo choo, announcing an upcoming \"prepare as NFT\" option in Photoshop. Chief product officer Scott Belsky told the verge that he believes in the power of NFT's to allow artists to do things like, not only get paid for their art, but get a percentage of every secondary sale after that. Which is cool, as long as it doesn't mean the internet is flooded with even more of these digital Funko pops. Collect them all, load them on a flash drive and take them with you, when you're lowered into the ground to decompose. It's cool new tech. Now it's Riley time! - Now it's time for quick bits, brought to you by Storyblocks. In it's massive library of stock footage, images, audio, and After effects templates. which can help you bring your stories to life without forcing you to never see your family again, because you're so busy filming B-roll. That'd be nice. Storyblocks recently launched the \"Restock Initiative\" to make content that more accurately reflects our world. And their latest round of collections, features authentic stock content made by indigenous creators to better depict underrepresented communities. They've got affordable subscriptions with unlimited video and audio downloads. So check out Storyblocks today at storyblocks.com/techlinked. - Quick bits, collect them all, stuff your synapses with information until they burst! - [Guy Behind Camera] Gross! - Microsoft is continuing its unending struggle against Chromebooks with Windows Central reporting, the company is working on a low-cost Surface Laptop, even cheaper than the $549 Surface Laptop Go announced a year ago. The device is codenamed \"Tenjin\", And would run a new additional Windows, called Windows 11 SE. Which probably stands for Student Edition, and most likely would only run on apps from the Microsoft Store. That's not so bad anymore. It's got Android apps now, just like Chromebook. Wait, it's a trap. - [Guy Behind Camera] They got you. - Got them! YouTube has announced, it will begin demonetizing channels that consistently upload content for children that is low quality. Oh yeah, according to who Google! Google's definition of low quality means videos that are overly promotional in nature, deceptive and promote bad behaviors, or use children's characters in questionable ways. That seems pretty reasonable, although I'm gonna have to re-work my concept for a SpongeBob nice fights channel. That was gonna be so good! [Guy Behind Camera] I could take SpongeBob. The US copyright office has helped the right to repair movement with new modifications to section 1201 of the Digital Millennium Copyright Act, AKA the DMCA. You may have heard of it! - [Guy Behind Camera] You guys just got hit with it. - You down, your video down! It's gone! The act now contains broad legal protections for users that repair consumer devices running software. Although they're weirdly specific at times, like you can only repair a game console's optical drive and nothing else. The new rules aren't perfect, but they're progress. And I'll tell you, I can't wait to get home, jab a screwdriver into the front of my X-Box, that's freedom. - [Guy Behind Camera] It deserves it. - Samsung is jumping in the Cloud Gaming ring, announcing an upcoming game streaming service, that's coming to the company's ties in base TV's, and it's got a real catchy name, Cloud Gaming Platform. I mean, it doesn't pretend to be anything It isn't. It's not going to change your life. It's not going to do your taxes. It's Cloud Gaming Platform. And it does not apologize! In Pimax, makers of wacky high resolution VR headsets made some far out promises about it's new model releasing next year. The Pimax 12K QLED apparently has, appropriately, a 12K QLED Mini-LED lit display, a 200Hz refresh rate, thanks to Foveated rendering as well as 11 cameras for eye, face and full body tracking. The same Snapdragon XR2 chip in the Quest 2 for standalone VR, wireless PC VR, swappable batteries, and front modules cooling fans, it's a tall order. It costs $2,400 and maybe it'll launch next year, maybe there's gonna be some crazy promises we'll all remember and laugh about someday. Remember that thing, back in the TechLinked and the Pimax? - [Guy Behind Camera] It was not real. - Yep. I hope you all remember to come back on Friday for more tech news. Cause this video is over! - [Guy Behind Camera] End it Colton. - It's done! - [Guy Behind Camera] Shut it down! - Yeah! Wooo!",
    "transcript_keywords": [
        "blue corn moon",
        "corn moon",
        "wolf cry",
        "Cloud Gaming Platform",
        "Alder Lake",
        "Cloud Gaming",
        "Nintendo",
        "Intel",
        "Alder Lake lineup",
        "blue corn",
        "gen Alder Lake",
        "Gaming Platform",
        "Anthony and Linus",
        "games",
        "Maximum Turbo Power",
        "Surface Laptop",
        "big deal",
        "Photoshop",
        "NFT",
        "run"
    ],
    "transcript_entities": [
        [
            "Alder Lake",
            "PERSON"
        ],
        [
            "Photoshop",
            "ORG"
        ],
        [
            "Apple Silicon Max",
            "ORG"
        ],
        [
            "Alder Lake",
            "LOC"
        ],
        [
            "iPad",
            "ORG"
        ],
        [
            "Tenjin",
            "ORG"
        ],
        [
            "a year ago",
            "DATE"
        ],
        [
            "DMCA",
            "ORG"
        ],
        [
            "Storyblocks",
            "PERSON"
        ],
        [
            "Intel",
            "ORG"
        ],
        [
            "Riley",
            "PERSON"
        ],
        [
            "US",
            "GPE"
        ],
        [
            "Switch",
            "ORG"
        ],
        [
            "Pimax",
            "ORG"
        ],
        [
            "an extra $30",
            "MONEY"
        ],
        [
            "Cloud Gaming Platform",
            "WORK_OF_ART"
        ],
        [
            "NFT",
            "ORG"
        ],
        [
            "Google",
            "ORG"
        ],
        [
            "Adobe",
            "ORG"
        ],
        [
            "Windows Central",
            "ORG"
        ],
        [
            "TDP",
            "ORG"
        ],
        [
            "Maximum Turbo Power",
            "ORG"
        ],
        [
            "nine",
            "CARDINAL"
        ],
        [
            "months",
            "DATE"
        ],
        [
            "Windows",
            "PRODUCT"
        ],
        [
            "LTT",
            "ORG"
        ],
        [
            "Nintendo",
            "ORG"
        ],
        [
            "AIO",
            "ORG"
        ],
        [
            "11",
            "CARDINAL"
        ],
        [
            "next year",
            "DATE"
        ],
        [
            "Quest 2",
            "PRODUCT"
        ],
        [
            "section 1201",
            "LAW"
        ],
        [
            "Chromebooks",
            "ORG"
        ],
        [
            "Microsoft",
            "ORG"
        ],
        [
            "Samsung",
            "ORG"
        ],
        [
            "Friday",
            "DATE"
        ],
        [
            "the Microsoft Store",
            "ORG"
        ],
        [
            "Colton",
            "LOC"
        ],
        [
            "SpongeBob",
            "ORG"
        ],
        [
            "third",
            "ORDINAL"
        ],
        [
            "the Digital Millennium Copyright Act",
            "ORG"
        ],
        [
            "Toad",
            "PERSON"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "Anthony",
            "PERSON"
        ],
        [
            "Team Blue's",
            "ORG"
        ],
        [
            "AMD",
            "PRODUCT"
        ],
        [
            "N64",
            "ORG"
        ],
        [
            "Wii U. - [",
            "PERSON"
        ],
        [
            "Holly",
            "PERSON"
        ],
        [
            "Pimax",
            "GPE"
        ],
        [
            "200Hz",
            "CARDINAL"
        ],
        [
            "Surface Laptop",
            "ORG"
        ],
        [
            "Scott Belsky",
            "PERSON"
        ],
        [
            "Android",
            "ORG"
        ],
        [
            "12th",
            "ORDINAL"
        ],
        [
            "2,400",
            "MONEY"
        ],
        [
            "TechLinked",
            "ORG"
        ],
        [
            "Chromebook",
            "FAC"
        ],
        [
            "Storyblocks",
            "NORP"
        ],
        [
            "Funko",
            "ORG"
        ],
        [
            "Love",
            "WORK_OF_ART"
        ],
        [
            "Linus",
            "PERSON"
        ],
        [
            "12",
            "CARDINAL"
        ],
        [
            "Student Edition",
            "WORK_OF_ART"
        ],
        [
            "Windows 11 SE",
            "PRODUCT"
        ],
        [
            "November 4th",
            "DATE"
        ],
        [
            "CPU",
            "ORG"
        ],
        [
            "VR",
            "ORG"
        ],
        [
            "YouTube",
            "ORG"
        ],
        [
            "Ryzen",
            "PERSON"
        ],
        [
            "549",
            "MONEY"
        ],
        [
            "today",
            "DATE"
        ]
    ]
}