{
    "video_id": "lEwZTNQCxYQ",
    "title": "Nvidia, we don't WANT THIS",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-09-14T01:01:03Z",
    "video_url": "https://www.youtube.com/watch?v=lEwZTNQCxYQ",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Nvidia",
        "GPU",
        "GPU shortage",
        "graphics card",
        "stock",
        "GPU stock",
        "graphics cards in stock",
        "buy graphics card",
        "RTX 2060",
        "RTX 2060 12GB",
        "Geforce",
        "litecoin",
        "mining",
        "mining GPU",
        "cryptocurrency",
        "PC gaming",
        "PC gamer",
        "cheap GPU"
    ],
    "views": 559148,
    "likes": 32553,
    "comments_count": 1615,
    "description": "Get $20 off the PC38X Headphones with code DROPTHIS until Sept 29th 2021 at https://dro.ps/tl-0921-pc38x\n\n► LISTEN TO THE TECH NEWS: https://lmg.gg/TechLinkedPodcast\n►GET MERCH: http://www.LTTStore.com/\n►SUPPORT US ON FLOATPLANE: https://www.floatplane.com/  \n►LTX EXPO: https://www.ltxexpo.com/   \n\nNEWS SOURCES: https://lmg.gg/Kp1NE\n---------------------------------------------------\n\nTimestamps:\n0:00 Call me T-Pain\n0:13 RTX 2060 re-release?\n1:04 New Intel stock coolers baby\n1:57 Windows 11 efficiency\n2:39 Drop Sennheiser PC38X Gaming Headset\n3:09 QUICK BITS\n3:17 Mozilla tricks Windows\n3:51 iPhone 13 w/ 1TB option?\n4:18 Android 12 Oct. 4\n4:45 Walmart Litecoin debacle\n5:20 Fusion Magnet!!\n\nAFFILIATES & REFERRALS\n---------------------------------------------------\n►Affiliates, Sponsors & Referrals: https://lmg.gg/sponsors\n►Private Internet Access VPN: https://lmg.gg/pialinus2\n►MK Keyboards: https://lmg.gg/LyLtl\n►Nerd or Die Stream Overlays: https://lmg.gg/avLlO\n►Official Game Store: https://www.nexus.gg/ltt\n►Amazon Prime: https://lmg.gg/8KV1v\n►Audible Free Trial: https://lmg.gg/8242J\n►Our Gear on Amazon: https://geni.us/OhmF\n \nFOLLOW US ELSEWHERE\n---------------------------------------------------  \nTwitter: http://twitter.com/TechLinkedYT\nInstagram: http://instagram.com/TechLinkedYT\nFacebook: http://facebook.com/TechLinked  \n\nFOLLOW OUR OTHER CHANNELS\n---------------------------------------------------  \nLinus Tech Tips: https://lmg.gg/linustechtipsyt\nMac Address: https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw\nTechquickie: https://lmg.gg/techquickieyt\nShortCircuit: https://lmg.gg/shortcircuityt\nLMG Clips: https://lmg.gg/lmgclipsyt\nChannel Super Fun: https://lmg.gg/channelsuperfunyt\nCarpool Critics: https://lmg.gg/carpoolcriticsyt",
    "description_links": [
        "https://dro.ps/tl-0921-pc38x",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/Kp1NE",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Sure, tech news can't solve all our problems, but that doesn't mean we can't talk about computers for a bit as a way to distract ourselves from the constant reminders that life is pain. So come with me and let's go - Woo! have pain. The graphics card shortage hasn't really let up, so GPU manufacturers have turned to re-releasing old cards every now and then, and now in videos, once again, trying to make something old, new again, with a report indicating that a new RTX 2060 is coming our way early next year. But this time, it'll have 12 gigabytes of GDDR6 memory, double the previous amount. Can you imagine a card with that much VRAM? I'm sorry, I'm just trying to squeeze some excitement out of this dry ass chip shortage. Is that allowed Riley? - [Riley] No! - (sighs) - [Riley] Stop it. - I just like RAM. The larger amount of memory will be useful for folks wanting to game at higher resolutions or with better texture quality, but I'm sure gamers will just be happy to get their hands on a mid range card again for a reasonable price, which might not happen because GPU prices are still hella inflated. But come on, we have to hope. - [Riley] Help me, Jake, you're my only... - Sticking with hardware news, let's turn to Intel, who looks like they'll finally be updating the designs of its stock coolers with the upcoming Alder Lake-S CPU lineup. Alder Lake-S we'll be using a new socket, LJA 1700. And while recent Intel sockets have all been compatible with the same cooling solutions, LJA 1700 will be rectangular. - [Riley] Oh. - Rectangles, much sexier than squares. - [Riley] They're longer. - Hi, ooh, you know, I like them long. - [Riley] Stop that, Jake, that's inappropriate. - Due to the new shape, Intel is reportedly changing the stock cooler complete with RGB lighting, ooh. Core i9 models will be getting a taller model with full RGB while the rest of the product stack, all the way down to Core i3, will feature a halo design similar to those you might've seen on a Risen stock cooler. While the new stock coolers may look a bit cooler, - Ha ha! - they will still be very much identifiable as stock coolers, so you may want to check out third party options if you're big on style points. - [Riley] What is this, Tony Hawk's Pro Skater? - There's been plenty of discussion about Windows 11's new look and system requirements, but something that's gotten a little bit lost is talk about performance improvements. And we've just gotten a better look at what to expect. According to a Microsoft executive, Windows 11 will place a particular emphasis on what it calls foreground prioritization, which will put background apps in a sleep state that can slash both memory and CPU usage by about a third. Although this means Windows will wake up faster across platforms, it's going to benefit laptops the most by saving a significant amount of battery life. But I know Google Chrome is just gonna ignore the feature entirely, it's Google Chrome, you know, RAM, what's that. - [Riley] Kick it out of the club. - (scoffs) - So selfish! - So selfish, now it's time for quackity-backity bats, brought to you by Drop and their PC38X gaming headset, built in collaboration with Sennheiser. It's got the same open-back design as the PC37X, but with re-tuned drivers and a lower 28 ohm impedance for use with low power devices like gaming controllers, and a newly designed knit mesh headband for less heat retention and better comfort. It's upgraded, like your brain is now that you've heard about it. So upgrade yourself even more by buying the Drop PC38X today at the link below, and use code DROPTHIS for $20 off until September 29th. I'm almost positive that it's time for quackity bit-bats, boots, or whatever I said, - I don't know. - but I'll wait for the go ahead. - Go! - Okay, go! - If you're one of the many people who don't use Microsoft Edge, like myself, you've probably seen how annoying Windows makes it to change default browsers, but Mozilla has finally found a way around this, and have updated Firefox with a new method that will let users switch browsers in one click. Holy crap. - Oh, thank you. - Just in time for Windows 11 to arrive and break it, probably. - Ugh. Just give up, use Edge. Use Edge, foolish consumer, use Edge. Use it, use it. (laughs) Microsoft, get out of my head. - [Riley] Ignore the voices, Jake. Oh, wait, Apple's here now. The iPhone 13 is set to be officially announced tomorrow, but a last minute leak from a reliable Apple analyst has revealed that we should expect a one terabyte storage option on the upcoming iPhone lineup, doubling the previous maximum of 512. Wow, one terabyte of storage on an iPhone. Still no room for a headphone jack though. - [Riley] No, no, no, no, no. That'd be, no, that's ridiculous, gotta be thin. - (scoffs) Headphones, who needs those? No chargers either. From the other side of the aisle, it looks like we have an official release date for Android 12th, the 4th of October, which is under one month away. As you might expect, Google Pixel users will start getting the upgrade that same day, but other devices are just going to be left in the ditch and just have to wait, forever. - [Riley] Ugh. - I hate ditches. In the meantime, you can, I don't know, cry about how out of date your phone is. You know, iPhones get updates really fast, - [Riley] Jake, stop it. - Apple. - Apple, get out of here. - You might've noticed a huge jump in the value of your Litecoin wallet last week, before the value went right back down. It turns out this was due to a fake press release that claimed Walmart would start accepting the cryptocurrency, yeah, good luck with that. - (chuckles) Maybe? Walmart quickly came out to clarify the release was bogus, but Litecoin's value had already shot up by 20% in the meantime. So the press release may have been faked to pump up Litecoin's value prior to a dump. Yeah, we should definitely make crypto our main currency, I think it would go fine. - [Riley] Yeah, just run it on the computer. - We should just use Bitcoin for everything, right? - Yeah, you want some Bitcoin? - Sure. Speaking of things we should be doing, there's been a breakthrough in the quest for fusion power. A group of scientists have showed off an extremely powerful magnet that can produce a field the strength of 20-tesla, which is very, very strong. - [Riley] Whoa, that's a lot of cars. - That's a... (snorts) cars. The manual will be crucial for an upcoming fusion reactor due to come online in 2025, with the same project aiming to build a fusion power plant by 2033. Though, I hope nobody tells Doc Ock about this. - [Riley] I hope nobody goes into the multi-verse and - Multi-verse. - [Riley] gets all the different versions of Spider-man. - But it's real, we're already in the multi-verse. - [Riley] That's true. - (scoffs) Riley. And I hope this episode is over because there's nothing else left in the script, except for me to say, come back on Wednesday for more tech news. How will you distract yourself from the pain of existence until then? I don't know, I hear Popsicles are pretty nice. - [Riley] Oreos are decent. - Or Tesla robots. Will the Tesla robot feed you a Popsicle? - [Riley] I guess, or I'm not going to buy one.",
    "transcript_keywords": [
        "constant reminders",
        "Windows",
        "stock coolers",
        "Jake",
        "Edge",
        "stock",
        "Google Chrome",
        "pain",
        "Apple",
        "Risen stock cooler",
        "Intel",
        "yeah",
        "card",
        "time",
        "Google",
        "coolers",
        "cooler",
        "hope",
        "Litecoin",
        "release"
    ],
    "transcript_entities": [
        [
            "Alder Lake-S",
            "LOC"
        ],
        [
            "Riley] Jake",
            "PERSON"
        ],
        [
            "one month",
            "DATE"
        ],
        [
            "PC37X",
            "ORG"
        ],
        [
            "Jake",
            "PERSON"
        ],
        [
            "Intel",
            "ORG"
        ],
        [
            "4th",
            "ORDINAL"
        ],
        [
            "Popsicle",
            "ORG"
        ],
        [
            "Riley",
            "PERSON"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "20%",
            "PERCENT"
        ],
        [
            "Drop",
            "PERSON"
        ],
        [
            "Core i3",
            "ORG"
        ],
        [
            "20",
            "MONEY"
        ],
        [
            "last minute",
            "TIME"
        ],
        [
            "Tesla",
            "ORG"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "28",
            "CARDINAL"
        ],
        [
            "Google Pixel",
            "ORG"
        ],
        [
            "20",
            "CARDINAL"
        ],
        [
            "Windows",
            "PRODUCT"
        ],
        [
            "last week",
            "DATE"
        ],
        [
            "12 gigabytes",
            "QUANTITY"
        ],
        [
            "Sennheiser",
            "ORG"
        ],
        [
            "Alder Lake-S",
            "ORG"
        ],
        [
            "DROPTHIS",
            "ORG"
        ],
        [
            "Walmart",
            "ORG"
        ],
        [
            "Google Chrome",
            "ORG"
        ],
        [
            "Microsoft",
            "ORG"
        ],
        [
            "Edge",
            "ORG"
        ],
        [
            "October",
            "DATE"
        ],
        [
            "September 29th",
            "DATE"
        ],
        [
            "third",
            "ORDINAL"
        ],
        [
            "Litecoin",
            "PERSON"
        ],
        [
            "2025",
            "DATE"
        ],
        [
            "early next year",
            "DATE"
        ],
        [
            "Doc Ock",
            "PERSON"
        ],
        [
            "Microsoft Edge",
            "ORG"
        ],
        [
            "2060",
            "DATE"
        ],
        [
            "Litecoin",
            "LOC"
        ],
        [
            "RAM",
            "PERSON"
        ],
        [
            "Android 12th",
            "ORG"
        ],
        [
            "Firefox",
            "ORG"
        ],
        [
            "2033",
            "DATE"
        ],
        [
            "iPhones",
            "NORP"
        ],
        [
            "Wednesday",
            "DATE"
        ],
        [
            "about a third",
            "CARDINAL"
        ],
        [
            "Riley",
            "ORG"
        ],
        [
            "GPU",
            "ORG"
        ],
        [
            "Tony Hawk's",
            "PERSON"
        ],
        [
            "512",
            "CARDINAL"
        ],
        [
            "Bitcoin",
            "NORP"
        ],
        [
            "LJA 1700",
            "ORG"
        ],
        [
            "RGB",
            "ORG"
        ],
        [
            "Windows 11",
            "PRODUCT"
        ],
        [
            "Mozilla",
            "ORG"
        ],
        [
            "CPU",
            "ORG"
        ],
        [
            "jack",
            "PERSON"
        ],
        [
            "tomorrow",
            "DATE"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "today",
            "DATE"
        ]
    ]
}