{
    "video_id": "Q_Y3dTdXQSk",
    "title": "He Actually Did It…",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-04-26T00:41:53Z",
    "video_url": "https://www.youtube.com/watch?v=Q_Y3dTdXQSk",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Twitter",
        "Elon Musk",
        "Elon Musk buys Twitter",
        "Elon",
        "Musk",
        "Twitter board",
        "44 billion",
        "Jack Dorsey",
        "Parag Agrawal",
        "Tesla",
        "SpaceX",
        "Boring Company",
        "Starlink",
        "Musk Twitter",
        "Elon Musk Twitter"
    ],
    "views": 569022,
    "likes": 33804,
    "comments_count": 1264,
    "description": "Get 20% Off Pulseway's IT Management Software at https://lmg.gg/PulsewayTL\n\n► LISTEN TO THE TECH NEWS: https://lmg.gg/TechLinkedPodcast\n►GET MERCH: http://www.LTTStore.com/\n►SUPPORT US ON FLOATPLANE: https://www.floatplane.com/\n►LTX EXPO: https://www.ltxexpo.com/\n\nNEWS SOURCES: https://lmg.gg/wmK2m\n---------------------------------------------------\nTimestamps:\n0:00 goin on a shopping spree\n0:06 Twitter accepts Elon's offer\n1:16 Pixel Watch left at a bar\n2:14 Apple removing outdated apps\n3:08 Pulseway\n3:46 QUICK BITS\n3:54 Meta Store\n4:23 Lapsus hacked T-Mobile\n4:44 Bored Ape hack\n5:15 Electric Corvette\n5:38 Twitter Vibe Check\n\nFOLLOW US ELSEWHERE\n---------------------------------------------------  \nTwitter: http://twitter.com/TechLinkedYT\nInstagram: http://instagram.com/TechLinkedYT\nFacebook: http://facebook.com/TechLinked",
    "description_links": [
        "https://lmg.gg/PulsewayTL",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/wmK2m",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- Oh, I'm so excited for the tech news, I could buy a social media platform. There for the taking. Yep, he actually did it. Twitter has reportedly accepted Elon Musk's offer to buy the company for $44 billion or $54 and 20 cents per share. - [Man] 420! - (chuckles) 54.20, I guess so. Leading to any promises from users to either delete their account or make even more accounts depending on the bubble you're in. The buyout represents a dramatic reversal from just days ago when the Twitter board approved a poison pill to prevent a hostile takeover. The deal is pending approval by regulators and Twitter shareholders. But assuming it goes through, Elon will be taking company private, so you won't be able to buy Twitter stock anymore. Which honestly may just be for the best. - [Man] He's saving you money. - The only profits they ever seem to generate usually come in the form of sassy comments, which can be very cool. I like them. I collect them in my little pouch. Elon seems to have big plans for the social network. As he says, his vision for Twitter is one that emphasizes- - [Man] Free speech! - And ridding the platform of bots. Although he hasn't bothered to get into specifics, like isn't creating a bot to speak for me a form of free speech? They're not just bots to me. They're my free speech bot baby. Remember how years ago an Apple engineer left a top secret iPhone prototype at a bar. This sounds like a walked into a bar joke, but it's not. That actually happened, it was a real event. Well now it's Google scrambling to get their own product back under wraps as someone left a prototype Pixel Watch at a restaurant somewhere. - [Man] And someone else put it in the garbage. - Looks stupid. The gadget was apparently left there for weeks leading to someone finding it and sharing it with Android Central. Very traumatic for the watch. As far as juicy details. Well, it looks like a smart watch with a circular body and a heart rate sensor on the back. The watch reportedly wouldn't load up anything other than a boot screen. Doesn't seem very useful. So we don't have a look yet at what kind of OS it might be running, but the leaker claimed the watch did have a premium feel to it. So expect to pay a handsome sum for the privilege of acquiring a first generation Pixel device that will definitely disappoint you. I mean, I'm excited for it but it's pretty much given. - [Man] So premium it was left there for weeks. (laughing) - And Apple has once again found a way to piss off App Store developers as the company recently sent out a warning entitled App Store improvement notice, telling devs that if an app hasn't been updated within a significant amount of time, the devs had 30 days to submit an update or the app would be pulled from the App Store. Now, many apps are obviously updated regularly but many others simply don't need to be. This is especially true for indie games, many of which have been sitting on the App Store without being updated for a while, which of course to Apple means that they're garbage. That photo of your family's been on the fireplace for years, I'm just gonna throw it out, you know. Smaller devs have cried foul over Apple's policy update, especially as Apple hasn't released any clear guidance on what a significant amount of time means. And why would they? You're just supposed to know. - [Man] Have they updated their terms and conditions and payment processing protocols? That is significant. - Steve knows. Now it's time for quick bits brought to you by Pulseway. The all-in-one platform that lets you manage all your desktops, servers and network devices from one place with desktop and mobile apps. So you'll be the first one to know when things go wrong wherever you might be, just like Superman. With Pulseway, you can run scripts, build automation workflows, remote access, resend passwords, or even set up custom notifications for Windows, macOS or Linux. And with their auto-remediation system and customizable end user portal, you don't even have to fix absolutely everything yourself. What, imagine. So don't wait, try it for free today through our link below, and for a limited time, you can get 20% off. Quick bits can be pretty unruly. You wanna keep the spray bottle within arms reach? Oh no, wait. There's nothing. Meta is the latest tech giant to dive into the world of brick and mortar stores. In two weeks they'll be opening their first one, simply called the Meta Store. - [Man] The Visaverse. (laughing) - It's a store where you buy stores. The store will be located in Burlingame, California, a suburb of San Francisco, and will unsurprisingly have a focus on VR. And I'm sure there'll be some T-shirts there for Meta fans? Is that, can you, can you imagine? I want the water bottle with Meta on it. Represent! Prominent members of the hacking group Lapsus$ were arrested last month and now leaked copies of their private messages show that the group apparently stole some of T-Mobile's source code in March. They just love that stuff. Can't get enough source code. Gobble, gobble, gobble. T-Mobile confirmed that they were attacked but said nothing sensitive was stolen. These guys don't care about source code at all. The NFT community has suffered yet another hack. Oh no. Someone was able to hack the official Bored Ape Yacht Club Instagram account, and used it to post a phishing link that was then clicked by NFT holders allowing the hacker to get away with $1 million worth of NFTs. - [Man] That was like one NFT though. - Good haul. I'm reporting on this because it's about the Apes but these kind of stories happen literally every day. Like we get it. You wanna see a Bored Ape, look at this guy right here. Boo, make something happen. - [Man] Move great ape. - [Riley] Another high performance car is getting an electrified version. Chevy is releasing an electrified Corvette, but we'll actually see a hybrid version first due out next year. A full electric model is also in the works, though Chevy didn't give details as to when we'd see it. Since the Corvette has long been a very iconic gas guzzler- - [Man] I don't know what it says about my penis now. - What am I supposed, what should I buy? Twitter is developing a rather straightforward feature that is codenamed, Vibe, which might sound exciting but it's actually just a way to set a status. The leaked screenshots show several pre-programmed options you can select from, though it's not clear if you can create your own. The feature is a throwback to how Facebook and even AIM used to work. We didn't know it at the time, but we were all doing a little vibe check. That's all for today. So you're gonna wanna come back on Wednesday to check for more tech news and vibes. We got so many vibes coming in- - [Man] Buy us Elon. - There's a fresh... (laughs) Wait, stop!",
    "transcript_keywords": [
        "App Store",
        "Twitter",
        "Store",
        "App",
        "Apple",
        "buy",
        "Elon",
        "Watch",
        "accepted Elon Musk",
        "Elon Musk offer",
        "Free speech",
        "social media platform",
        "Meta",
        "time",
        "Elon Musk",
        "Free",
        "Bored Ape",
        "buy Twitter",
        "media platform",
        "buy Twitter stock"
    ],
    "transcript_entities": [
        [
            "Steve",
            "PERSON"
        ],
        [
            "weeks",
            "DATE"
        ],
        [
            "the Meta Store",
            "ORG"
        ],
        [
            "Burlingame",
            "GPE"
        ],
        [
            "Vibe",
            "ORG"
        ],
        [
            "30 days",
            "DATE"
        ],
        [
            "Elon",
            "ORG"
        ],
        [
            "Bored Ape Yacht Club Instagram",
            "ORG"
        ],
        [
            "420",
            "CARDINAL"
        ],
        [
            "Superman",
            "PRODUCT"
        ],
        [
            "Chevy",
            "ORG"
        ],
        [
            "Elon",
            "PRODUCT"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "20%",
            "PERCENT"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "March",
            "DATE"
        ],
        [
            "NFT",
            "ORG"
        ],
        [
            "Google",
            "ORG"
        ],
        [
            "Corvette",
            "PRODUCT"
        ],
        [
            "T-Mobile",
            "ORG"
        ],
        [
            "the App Store",
            "GPE"
        ],
        [
            "Windows",
            "PRODUCT"
        ],
        [
            "every day",
            "DATE"
        ],
        [
            "last month",
            "DATE"
        ],
        [
            "VR",
            "LOC"
        ],
        [
            "$44 billion",
            "MONEY"
        ],
        [
            "54",
            "MONEY"
        ],
        [
            "next year",
            "DATE"
        ],
        [
            "the App Store",
            "LOC"
        ],
        [
            "Android Central",
            "ORG"
        ],
        [
            "Twitter",
            "ORG"
        ],
        [
            "Linux",
            "GPE"
        ],
        [
            "Pixel Watch",
            "WORK_OF_ART"
        ],
        [
            "App Store",
            "ORG"
        ],
        [
            "$1 million",
            "MONEY"
        ],
        [
            "Pulseway",
            "ORG"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "just days ago",
            "DATE"
        ],
        [
            "San Francisco",
            "GPE"
        ],
        [
            "Facebook",
            "ORG"
        ],
        [
            "Wednesday",
            "DATE"
        ],
        [
            "20 cents",
            "MONEY"
        ],
        [
            "California",
            "GPE"
        ],
        [
            "two weeks",
            "DATE"
        ],
        [
            "Elon Musk's",
            "PERSON"
        ],
        [
            "Visaverse",
            "ORG"
        ],
        [
            "Lapsus$",
            "CARDINAL"
        ],
        [
            "54.20",
            "CARDINAL"
        ],
        [
            "Boo",
            "PERSON"
        ],
        [
            "years ago",
            "DATE"
        ],
        [
            "years",
            "DATE"
        ],
        [
            "T-Mobile's",
            "ORG"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "Meta",
            "ORG"
        ]
    ]
}