{
    "video_id": "TYaVCin4fCY",
    "title": "Intel’s not F***ing around",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-01-13T02:05:59Z",
    "video_url": "https://www.youtube.com/watch?v=TYaVCin4fCY",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Intel",
        "Alder Lake",
        "Intel 12th gen",
        "Intel Alder Lake",
        "12th gen processors",
        "processors",
        "CPU",
        "SKUs",
        "lineup",
        "parts",
        "Intel Celeron",
        "Celeron beats i9",
        "Core i9",
        "10900K",
        "12900K"
    ],
    "views": 655999,
    "likes": 36859,
    "comments_count": 1067,
    "description": "Get 50% off your Zoho CRM annual subscription with code ZCRM50 at: https://lmg.gg/ZohoCRMTL\n\n► LISTEN TO THE TECH NEWS: https://lmg.gg/TechLinkedPodcast\n►GET MERCH: http://www.LTTStore.com/\n►SUPPORT US ON FLOATPLANE: https://www.floatplane.com/\n►LTX EXPO: https://www.ltxexpo.com/\n\nNEWS SOURCES: https://lmg.gg/Va204\n---------------------------------------------------\nTimestamps:\n0:00 Tech News never changes\n0:09 Celeron beats 10900K in single-core\n1:02 Razer Zephyr Pro N95 scandal\n2:04 Wordle clones crisis\n3:11 Zoho CRM\n3:51 QUICK BITS\n3:57 Samsung skips Exynos event\n4:40 Android calls out iMessage\n5:14 Nvidia DLDSR\n5:45 Sony making more PS4s\n6:15 Pig heart transplant! \n\nAFFILIATES & REFERRALS\n---------------------------------------------------\n►Affiliates, Sponsors & Referrals: https://lmg.gg/sponsors\n►Private Internet Access VPN: https://lmg.gg/pialinus2\n►Our Official Charging Partner Anker: https://lmg.gg/AnkerTL\n►Secretlab Chairs: https://lmg.gg/SecretlabTL\n►Green Man Gaming: https://lmg.gg/GMGTL\n►MK Keyboards: https://lmg.gg/LyLtl\n►Amazon Prime: https://lmg.gg/8KV1v\n►Audible Free Trial: https://lmg.gg/8242J\n►Our Gear on Amazon: https://geni.us/OhmF\n \nFOLLOW US ELSEWHERE\n---------------------------------------------------  \nTwitter: http://twitter.com/TechLinkedYT\nInstagram: http://instagram.com/TechLinkedYT\nFacebook: http://facebook.com/TechLinked  \n\nFOLLOW OUR OTHER CHANNELS\n---------------------------------------------------  \nLinus Tech Tips: https://lmg.gg/linustechtipsyt\nMac Address: https://lmg.gg/macaddress\nTechquickie: https://lmg.gg/techquickieyt\nShortCircuit: https://lmg.gg/shortcircuityt\nLMG Clips: https://lmg.gg/lmgclipsyt\nChannel Super Fun: https://lmg.gg/channelsuperfunyt\nThey're Just Movies podcast: https://lmg.gg/TheyreJustMovies",
    "description_links": [
        "https://lmg.gg/ZohoCRMTL",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/Va204",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerTL",
        "https://lmg.gg/SecretlabTL",
        "https://lmg.gg/GMGTL",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/TheyreJustMovies"
    ],
    "transcript": "- Tech news incoming! This is not a drill, whoa. Strap in boys, this is what we trained for. Watch out for \"Half-Life 3\" rumors, whoa. Intel has only released a handful of their new 12th-Gen Alder Lake desktop processors so far, but they've already made quite an impression. The whole school is talking about how they stood up to rise in Chan. - [James] What does that mean? - That's an anime reference. - Okay. - You've never seen it in your life. - [James] I don't like it. - Now a Geekbench listing is being circulated that shows an Alder Lake Celeron G6900. Nice, I didn't even notice that. A dual-core entry-level part Intel announced at CES, beating the single-core performance of an Intel core i9-10900K. Sure, it's a 10th Gen part and the benchmark was running on Linux and the Celeron's MSRP is $42 US, but it almost certainly won't be available for that price. But I still think it's worth taking this moment to celebrate the little guys. You don't need more than two cores to make a difference in the world. Look at Linus, we love a short king. - [James] He's a two-core guy. - You could be a short king. Razer's Zephyr Pro face mask was one of the top products at CES, mostly by virtue of being an actual real product and not a CGI concept. Although those are fun, I'll read about your color changing smart garbage bin all day, great job. But after backlash over Razer's description of the masks filters as N95 grade, the company has now removed all mention of anything N95 related on the Zephyr website. The criticism was spearheaded by YouTuber, Naomi Wu, aka SexyCyborg, who confirmed that the US National Institute for Occupational Safety and Health or NIOSH, never approved the Zephyr Pro for N95 certification, which, by the way, applies to the entire mask, not just the filters. So if you had the Zephyr Pro on your wishlist, just be aware it may be less useful as medical-grade protective equipment than it is as part of your cosplay of a watchdogs character, which I guess you would wanna do for some reason. The games are bad, have you- - [James] Those games suck. - The coolest thing about them was the guy with the mask. And Apple once again made a mockery of their own iOS app review process by allowing the App Store to be flooded with clones of the popular \"Wordle\" word game. You may have seen it on Twitter. - [James] Wordle, Wordle, Wordle. - Wordle, Wordle, Apple has now started taking those clone apps down, but only after widespread backlash against the creator of one of the most popular variants, Zachary Schacht. - [James] More like Zachary Wrecked. - (laughing) That was good, James. You got him. - Hey, got him. - Zach apparently thought he could defend himself on Twitter by pointing out he offered to share revenue with the creator of the real Wordle app, Josh Wordle. (laughing) I didn't even notice his name was like Wordle. What! (James laughing) - Wordle, the creator of Wordle refused the revenue share, probably because he said he wants the app to remain free to use. Then Zach said, \"You all don't understand. See, I did this to make money. Can't you see that's reasonable?\" - [James] Zach attacked. - It didn't help that Zach had already tweeted about how much he hates copycats in the past. Hey, me too, Zach, which is why I sued TalkLinked Daily into the ground. They had no right to this format. - Tech week, maybe. - Damn. - Now it's time for quick bits brought to you by Zoho CRM, the all-in-one solution for managing your businesses' sales, marketing, and customer service. That's like the whole company. Zoho CRM's intuitive UI and simple navigation lets you implement their service quickly and they'll even offer AI predictions to give you important insights into your customer's needs. Who are there? Plus, you can tweak things to your liking with a built-in design studio to help you spot critical info at a glance, like a heads-up display and a cool fighter jet. You're the pilot now. Zoho offers flexible contracts, transparent pricing, and an ever-evolving service that grows to meet your needs without snowballing costs. Learn more at zoho.com/crm. Quick bits, another reason why you don't have to be long to be great, which is why I'm trying to lose height, I don't know what I'm doing wrong. Samsung tweeted out a dramatic teaser last month for an event announcing their latest Exynos CPU, presumably, the one built with AMD Graphics, that was supposed to take place on January 11th, yesterday, but the appointed time came and went with Nary, a peep from the company, who eventually responded to journalists by explaining that the new chip will be introduced alongside the Galaxy S22, which is expected to happen in the next few weeks. Delaying product releases isn't that strange, especially these days, but announcing a big reveal and then whiffing it completely- - [James] It goes to that. - Is a little unusual, I was ghosted by a big tech company. - [James] That's a nop. - That's not unusual either. Thankfully, it was something almost no one cares about. Bam, got him, be on time next time. Android's head honcho, Hiroshi Lockheimer, is turning up the pressure on Apple to support Rich chat services in iMessage, which would allow iPhone and Android users to send SMS text messages to each other, with support for all the cool things you can do in other apps like liking messages without sending five duplicates of the thing you never meant to send them. Lockheimer and the official Android Twitter accused Apple of using peer pressure and bullying as a way to sell product, which isn't likely to change Apple's mind. But hey, maybe Apple can sue them or something, that was very effective (mumbles). Nvidia has seen AMD's announcement of their driver-level radio on Super-Resolution. And a week later, has one-up them by announcing their own driver-level support for their Deep Learning Dynamic Super Resolution. Man, these are long, come up with better names, guys. So now it looks like the super sampling technologies from Team Red and Green can be used in any game, even if it's not officially supported by developers. The big companies fight so we can win, it's like Pokemon. - [James] But they're both in one ball. - But they're both in one ball together- - But we hold the ball. - Get in the ball. An acknowledgment of its inadequate supply of PlayStation 5 Console, Sony has announced it's ramping up production of PlayStation 4s. - Yeah. - Sorry, what? PS4s are a bit easier to produce than the more advanced PS5s, so Sony has apparently told its partners it hopes the Alder Console can continue to serve as a budget-friendly alternative to the PS5. And normally, I would be more upset about this, but PCs are getting all the good PlayStation games these days, \"God of War\" this week, whoop. - Whoop, I can finish it- - Whoop, (indistinct) 970. - (laughing) And a pig heart has been successfully transplanted into a human for the first time by doctors at the University of Maryland School of Medicine. - [James] You talk about your mother that way? - You can call her a pig. (laughing) The landmark procedure took steps to decrease the chances that the patient's body would reject the heart by taking it from a pig, genetically modified for justice purpose, using a new immunosuppressant chemical and even more interestingly, incubating the heart with a cocaine-laced solution. Wow, I feel great now. - [James] You don't even care that this is in kosher. - (laughing) The 57-year-old patient, David Bennett, had suffered advanced heart failure prior to the experimental treatment, but is now reportedly doing fine. Now, this was a one-time thing. So don't expect to get your own pig transplants anytime soon, but do keep an eye out for manbearpigs, because now we have evidence, they're real. - [James] And that's super serial. - And the real fact is that this episode is now over. Come back on Friday for more tech news. (sighing) I can only pray I've prepared you enough. (James grunting) (Riley shouting)",
    "transcript_keywords": [
        "Wordle",
        "Zephyr Pro",
        "Alder Lake Celeron",
        "Apple",
        "Alder Lake",
        "Razer Zephyr Pro",
        "real Wordle app",
        "Zach",
        "Zephyr",
        "Alder Lake desktop",
        "Wordle app",
        "app",
        "time",
        "Alder",
        "Intel",
        "Pro",
        "Zephyr Pro face",
        "Twitter",
        "Zoho CRM",
        "Lake Celeron"
    ],
    "transcript_entities": [
        [
            "Zephyr Pro",
            "ORG"
        ],
        [
            "Razer",
            "PERSON"
        ],
        [
            "Riley",
            "PERSON"
        ],
        [
            "Chan",
            "PERSON"
        ],
        [
            "the US National Institute for Occupational Safety and Health",
            "ORG"
        ],
        [
            "970",
            "CARDINAL"
        ],
        [
            "Twitter",
            "ORG"
        ],
        [
            "Samsung",
            "ORG"
        ],
        [
            "PlayStation 4s",
            "PRODUCT"
        ],
        [
            "Friday",
            "DATE"
        ],
        [
            "Nary",
            "ORG"
        ],
        [
            "AMD",
            "ORG"
        ],
        [
            "Nvidia",
            "ORG"
        ],
        [
            "David Bennett",
            "PERSON"
        ],
        [
            "Linus",
            "PERSON"
        ],
        [
            "PlayStation",
            "PRODUCT"
        ],
        [
            "Zephyr",
            "ORG"
        ],
        [
            "SMS",
            "ORG"
        ],
        [
            "Zoho",
            "ORG"
        ],
        [
            "10th",
            "ORDINAL"
        ],
        [
            "Alder",
            "ORG"
        ],
        [
            "Team Red and Green",
            "ORG"
        ],
        [
            "Zoho CRM",
            "ORG"
        ],
        [
            "Zach",
            "PERSON"
        ],
        [
            "Geekbench",
            "PRODUCT"
        ],
        [
            "Linux",
            "GPE"
        ],
        [
            "Zachary Wrecked",
            "PERSON"
        ],
        [
            "the Zephyr Pro",
            "ORG"
        ],
        [
            "Twitter",
            "PRODUCT"
        ],
        [
            "Alder Lake Celeron G6900",
            "ORG"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "Sony",
            "ORG"
        ],
        [
            "Bam",
            "PERSON"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "the Galaxy S22",
            "ORG"
        ],
        [
            "NIOSH",
            "ORG"
        ],
        [
            "this week",
            "DATE"
        ],
        [
            "CPU",
            "ORG"
        ],
        [
            "PlayStation 5 Console",
            "PRODUCT"
        ],
        [
            "UI",
            "ORG"
        ],
        [
            "January 11th",
            "DATE"
        ],
        [
            "a week later",
            "DATE"
        ],
        [
            "$42 US",
            "MONEY"
        ],
        [
            "Wordle",
            "WORK_OF_ART"
        ],
        [
            "YouTuber",
            "PERSON"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "iPhone",
            "ORG"
        ],
        [
            "N95",
            "ORG"
        ],
        [
            "God of War",
            "WORK_OF_ART"
        ],
        [
            "57-year-old",
            "DATE"
        ],
        [
            "Celeron",
            "ORG"
        ],
        [
            "SexyCyborg",
            "ORG"
        ],
        [
            "the next few weeks",
            "DATE"
        ],
        [
            "iMessage",
            "ORG"
        ],
        [
            "PS5",
            "ORG"
        ],
        [
            "these days",
            "DATE"
        ],
        [
            "Razer",
            "ORG"
        ],
        [
            "Android",
            "ORG"
        ],
        [
            "five",
            "CARDINAL"
        ],
        [
            "Exynos",
            "PRODUCT"
        ],
        [
            "the App Store",
            "ORG"
        ],
        [
            "James] Wordle",
            "PERSON"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "Super-Resolution",
            "ORG"
        ],
        [
            "CES",
            "ORG"
        ],
        [
            "yesterday",
            "DATE"
        ],
        [
            "Naomi Wu",
            "PERSON"
        ],
        [
            "Intel",
            "ORG"
        ],
        [
            "all day",
            "DATE"
        ],
        [
            "Josh Wordle",
            "PERSON"
        ],
        [
            "Half-Life 3",
            "WORK_OF_ART"
        ],
        [
            "the University of Maryland School of Medicine",
            "ORG"
        ],
        [
            "last month",
            "DATE"
        ],
        [
            "Zachary Schacht",
            "PERSON"
        ],
        [
            "Wordle",
            "ORG"
        ],
        [
            "AMD Graphics",
            "ORG"
        ],
        [
            "more than two",
            "CARDINAL"
        ],
        [
            "Hiroshi Lockheimer",
            "PERSON"
        ],
        [
            "Deep Learning Dynamic Super Resolution",
            "WORK_OF_ART"
        ],
        [
            "James] Zach",
            "PERSON"
        ],
        [
            "Pokemon",
            "PERSON"
        ],
        [
            "12th",
            "ORDINAL"
        ],
        [
            "TalkLinked Daily",
            "ORG"
        ],
        [
            "MSRP",
            "ORG"
        ],
        [
            "James",
            "PERSON"
        ],
        [
            "Zoho CRM's",
            "ORG"
        ]
    ]
}