{
    "video_id": "zF2KF-SVIXc",
    "title": "Nvidia Does Not Care",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-08-28T02:44:16Z",
    "video_url": "https://www.youtube.com/watch?v=zF2KF-SVIXc",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Nvidia",
        "RTX 3090 Super",
        "Geforce",
        "RTX 3090",
        "RTX 30 Super",
        "RTX Super",
        "3090 Super",
        "3090",
        "graphics card",
        "GPU",
        "stock",
        "buy",
        "specs",
        "leak",
        "benchmark"
    ],
    "views": 700807,
    "likes": 35268,
    "comments_count": 1280,
    "description": "Get the right tool for the job at https://iFixit.com/TechLinked\n\n► LISTEN TO THE TECH NEWS: https://lmg.gg/TechLinkedPodcast\n►GET MERCH: http://www.LTTStore.com/\n►SUPPORT US ON FLOATPLANE: https://www.floatplane.com/  \n►LTX EXPO: https://www.ltxexpo.com/   \n\nNEWS SOURCES: https://lmg.gg/gqvG5\n---------------------------------------------------\n\nTimestamps\n0:00 ok it wasn't though \n0:06 RTX 3090 Super rumored\n1:08 Apple anti-steering settlement\n2:15 Some Windows 11 shenanigans\n3:04 iFixit\n3:39 QUICK BITS\n3:46 TSMC raising prices\n4:09 WD makes SSDs worse\n4:37 Surface Duo 2 leaks\n5:12 Netflix Gaming\n5:39 T-Mobile hacker identity\n\nAFFILIATES & REFERRALS\n---------------------------------------------------\n►Affiliates, Sponsors & Referrals: https://lmg.gg/sponsors\n►Private Internet Access VPN: https://lmg.gg/pialinus2\n►MK Keyboards: https://lmg.gg/LyLtl\n►Nerd or Die Stream Overlays: https://lmg.gg/avLlO\n►Official Game Store: https://www.nexus.gg/ltt\n►Amazon Prime: https://lmg.gg/8KV1v\n►Audible Free Trial: https://lmg.gg/8242J\n►Our Gear on Amazon: https://geni.us/OhmF\n \nFOLLOW US ELSEWHERE\n---------------------------------------------------  \nTwitter: http://twitter.com/TechLinkedYT\nInstagram: http://instagram.com/TechLinkedYT\nFacebook: http://facebook.com/TechLinked  \n\nFOLLOW OUR OTHER CHANNELS\n---------------------------------------------------  \nLinus Tech Tips: https://lmg.gg/linustechtipsyt\nMac Address: https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw\nTechquickie: https://lmg.gg/techquickieyt\nShortCircuit: https://lmg.gg/shortcircuityt\nLMG Clips: https://lmg.gg/lmgclipsyt\nChannel Super Fun: https://lmg.gg/channelsuperfunyt\nCarpool Critics: https://lmg.gg/carpoolcriticsyt",
    "description_links": [
        "https://iFixit.com/TechLinked",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/gqvG5",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Anonymous has a message for you... It was Tech News the whole time! (excited chattering) Nvidia may be preparing to launch a G-Force RTX 3090 Super graphics card. - [Man] What? - Because according to a company spokesman, the past year and a half, hasn't been dumb enough. That's obviously a joke, kind of like the idea of an RTX 3090 Super, in this economy. - [Man] It's not enough dumb in there. - So, the rumor comes from a couple of Twitter leakers with a decent track record for these kinds of things. Greymon, of all the Digi Mon he's my favorite, Greymon55 and kopite7kimi who both claimed that the upcoming card will have a fully maxed out GA102 GPU with 10752 CUDA cores, compared to the measly 10,496 CUDA cores in the boring, regular, limp, broke dick version of Nvidia's current top tier card. - [Man] What is this, bush league? - If you can find one, the 3090 is usually going for around 2,500 US dollars right now, so it's totally understandable that Nvidia would produce a slightly more powerful version because you idiots buy it. (indistinct yelling) Will you stop? (indistinct yelling) My cousin has one, he's nice. Apple has agreed to a settlement in a two year long lawsuit that will have major ramifications for the iOS app store and consequently, Epic Games lawsuit against the company. There's two lawsuits guys. This lawsuit was brought by a small group of developers complaining about the app store's anti steering rules, forbidding communication with users about payment options outside of the app store. Under the settlement, iOS apps will now be able to directly tell users that they can go buy digital goods on the developer's website instead, avoiding Apple's 30% revenue cut. - [Man] 30% of what? Nothing! - They got information now. Obviously apple is trying to spin this as a generous decision on their part and have agreed to extend the small business program, which only takes a 15% cut from devs making under $1 million for three years. And they're also setting up a $100 million fund for small developers, 30 million of which is going to the lawyers. - [Man] Well, that's only right, they work hard. - The app store's anti steering rules were just one part of the Epic case, so we'll have to see how this element modifies that trial's final ruling. We're praying we can see naked banana men on our I-phones again soon. - [Man] I've missed them. - And Microsoft has thrown owners of older PCs a bone by adding Windows 11 support for a single Intel seventh gen CPU, the 7820 HQ and no first gen Ryzen processors at all. (indistinct chatter) - Wait, that's not a whole bone, that's like a bone shard. (indistinct chatter) - But, there's some actual good news, Redmond says you will be able to install Windows 11 on pretty much any hardware you want to, provided you're ready to deal with the potential technical problems involving drivers and firmware and all that good stuff. So yeah, Microsoft still isn't being the nicest it could be, but at least Asus will be releasing updated windows 11 compatible biosis for it's 200 series motherboards. And the new windows 11 health checkups shouldn't tell you that your PC is incompatible anymore, when it actually is compatible. The thing... That was gaslighting, gatekeeping. Now it's time for Quick Bits, brought to you by iFixit. They told me they want to make sure that you have the right bit for the job because they care about you and your bits. iFixit has a repair kit for any situation so you can take apart all your electronics. There's the Maaco with 64 small bits, the Mahi with 48 large bits, or the Monta, who's got all 112 bits. (indistinct chatter) It's crazy. Watch out for that one. Each kit includes, IFixit's famous swivel neural screwdriver thing that I love contained in a magnetic enclosed case with laser cut foam, get yours at IFixit.com/TechLinked. Life is confusing and complicated and the world's going to (bleep) have you considered quick bits? - [Man] Does it come in a cream? - What? (electronic stuttering) - TSMC has confirmed it plans to raise chip manufacturing prices by 10 or 20%, just like they promised to do last year, because why would they want a chip shortage to end? That's like expecting a dam operator to just let out some water because people are thirsty. What about the fish in there? - [Man] Yeah, you gotta sell the fish to the fish market. - This is a sea of silicon. - [Man] That's a bad analogy. - Western Digital has been caught secretly making its storage drives worse, again. Swapping out the NAND modules in its budget SSD offerings, which degrades performance by as much as 50%. - [Man] That's half! - That's a lot of the pie! WD follows Crucial and Samsung doing the same thing. Although to be fair Samsung's NAND swap is more of a side grade, but still. Why won't they leave working class SSDs alone? They're having enough of a hard time as it is. - [Man] (indistinct) - It looks more certain than ever that Microsoft will soon be releasing the sequel to its disappointing dual display Surface Duo Android phone, following images that leaked earlier this year, a related device on Geek Bench has appeared with a Snapdragon 888, and eight gigabytes of Ram. Damn, that's a lucky phone. Those are specs that would address the first one's primary failing, which was slow performance. But the Snapdragon 888 is already a bit out of date. The 888 plus is starting to show up in phones, so here we were thinking, this is the last one. - [Man] Yeah, we're just gonna keep making chips, I guess. I bet you can't make one more. - Netflix is already rolling out a test of it's long rumored gaming service, but only in Poland where people actually watch their horrible reality shows. - [Man] I'm just making that up, I don't know whether they watch them or not. Love Island? No more. - I don't get it. Turns out, the add on gaming perk is not cloud-based as many assumed. Existing Netflix subscribers will instead get free access to certain Android games, starting with a pair of Stranger Things titles. - [Man] No way! Oh that's cool! - It's so on-brand, you know. I'm totally not going to cancel my sub now. And the hacker behind the recent attack on T-Mobile that saw 50 million users accounts compromised has come forward in an interview with the Wall Street Journal. The hacker who calls himself John Binns... John's been in your data. Called T-Mobile security, \"awful,\" and claimed the government has tried to convince him to buy missiles from the FBI and has attacked him with psychic and energy weapons. This is turning. The FBI denied Binns was being investigated before zapping reporters with ray guns. So I guess we'll never know what really happened. - [Man] What are you hiding? - You know... (indistinct chatter) (laughing) I was going to make a joke about the flat earth tilting and us all falling off, but we'll do that on Monday when this show returns, cause this episode's over, so come back then for more Tech News. (yelling)",
    "transcript_keywords": [
        "Bits",
        "Super graphics card",
        "app store",
        "Windows",
        "CUDA cores",
        "Quick Bits",
        "Nvidia",
        "year",
        "million",
        "Microsoft",
        "small",
        "RTX",
        "Super",
        "making",
        "thing",
        "card",
        "app",
        "Apple",
        "lawsuit",
        "GForce RTX"
    ],
    "transcript_entities": [
        [
            "last year",
            "DATE"
        ],
        [
            "earlier this year",
            "DATE"
        ],
        [
            "John",
            "PERSON"
        ],
        [
            "30%",
            "PERCENT"
        ],
        [
            "10752",
            "CARDINAL"
        ],
        [
            "Twitter",
            "ORG"
        ],
        [
            "Samsung",
            "ORG"
        ],
        [
            "Quick Bits",
            "PRODUCT"
        ],
        [
            "IFixit",
            "ORG"
        ],
        [
            "48",
            "CARDINAL"
        ],
        [
            "$1 million",
            "MONEY"
        ],
        [
            "Surface Duo Android",
            "ORG"
        ],
        [
            "Netflix",
            "ORG"
        ],
        [
            "Nvidia",
            "ORG"
        ],
        [
            "the Digi Mon",
            "FAC"
        ],
        [
            "NAND",
            "PRODUCT"
        ],
        [
            "Epic Games",
            "ORG"
        ],
        [
            "7820",
            "DATE"
        ],
        [
            "G-Force",
            "ORG"
        ],
        [
            "50 million",
            "CARDINAL"
        ],
        [
            "FBI",
            "ORG"
        ],
        [
            "the past year and a half",
            "DATE"
        ],
        [
            "CUDA",
            "ORG"
        ],
        [
            "as much as 50%",
            "PERCENT"
        ],
        [
            "Maaco",
            "ORG"
        ],
        [
            "Western Digital",
            "ORG"
        ],
        [
            "3090",
            "PRODUCT"
        ],
        [
            "112",
            "CARDINAL"
        ],
        [
            "Poland",
            "GPE"
        ],
        [
            "John Binns",
            "PERSON"
        ],
        [
            "11",
            "CARDINAL"
        ],
        [
            "30 million",
            "CARDINAL"
        ],
        [
            "WD",
            "ORG"
        ],
        [
            "Ryzen",
            "NORP"
        ],
        [
            "seventh",
            "ORDINAL"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "GA102 GPU",
            "ORG"
        ],
        [
            "Asus",
            "ORG"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "Tech News",
            "ORG"
        ],
        [
            "Monday",
            "DATE"
        ],
        [
            "Crucial",
            "ORG"
        ],
        [
            "10,496",
            "CARDINAL"
        ],
        [
            "Windows 11",
            "PRODUCT"
        ],
        [
            "CPU",
            "ORG"
        ],
        [
            "SSD",
            "ORG"
        ],
        [
            "three years",
            "DATE"
        ],
        [
            "one",
            "CARDINAL"
        ],
        [
            "Mahi",
            "LOC"
        ],
        [
            "iFixit",
            "ORG"
        ],
        [
            "T-Mobile",
            "ORG"
        ],
        [
            "200",
            "CARDINAL"
        ],
        [
            "Microsoft",
            "ORG"
        ],
        [
            "Monta",
            "ORG"
        ],
        [
            "Ram",
            "PERSON"
        ],
        [
            "Android",
            "ORG"
        ],
        [
            "Greymon",
            "ORG"
        ],
        [
            "Greymon55",
            "PERSON"
        ],
        [
            "Redmond",
            "PERSON"
        ],
        [
            "Apple",
            "ORG"
        ],
        [
            "half",
            "CARDINAL"
        ],
        [
            "iOS",
            "ORG"
        ],
        [
            "888",
            "CARDINAL"
        ],
        [
            "the Wall Street Journal",
            "ORG"
        ],
        [
            "Intel",
            "ORG"
        ],
        [
            "Binns",
            "PERSON"
        ],
        [
            "bush",
            "PERSON"
        ],
        [
            "10 or 20%",
            "PERCENT"
        ],
        [
            "64",
            "CARDINAL"
        ],
        [
            "TSMC",
            "ORG"
        ],
        [
            "windows 11",
            "PRODUCT"
        ],
        [
            "eight gigabytes",
            "QUANTITY"
        ],
        [
            "Epic",
            "PERSON"
        ],
        [
            "Geek Bench",
            "PERSON"
        ],
        [
            "around 2,500 US dollars",
            "MONEY"
        ],
        [
            "NAND",
            "ORG"
        ],
        [
            "two year",
            "DATE"
        ],
        [
            "Love Island",
            "LOC"
        ],
        [
            "15%",
            "PERCENT"
        ],
        [
            "$100 million",
            "MONEY"
        ]
    ]
}