{
    "video_id": "3Q0DnSXlsR4",
    "title": "The $300 Xbox Series S is Real.",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-09-08T08:24:33Z",
    "video_url": "https://www.youtube.com/watch?v=3Q0DnSXlsR4",
    "category": "Science & Technology",
    "tags": [
        "xbox series s",
        "xbox",
        "xbox series x",
        "series s",
        "xbox series",
        "new xbox",
        "ps5",
        "playstation 5",
        "series s vs ps5",
        "xbox series s vs ps5",
        "xbox series s vs series x",
        "series s vs series x",
        "game console",
        "microsoft",
        "sony",
        "vs",
        "announcement",
        "official",
        "leak",
        "the test drivers",
        "test drivers",
        "this is",
        "austin evans"
    ],
    "views": 1005477,
    "likes": 43901,
    "comments_count": 6678,
    "description": "PS5 vs Xbox Series X vs Xbox Series S is about to get SPICY. 🌶\nOur hands on of Xbox Series X: https://youtu.be/7Fjn4GRw8qE\nXbox Series X vs PlayStation 5 gameplay: https://youtu.be/UZR3AF68wBc\n\nXbox Series S official announcement: https://twitter.com/Xbox/status/1303230071033880576\nXbox Series S leaks: \nhttps://twitter.com/bdsams/status/1303152184377344001\nhttps://twitter.com/_h0x0d_/status/1303165187369832448\nhttps://www.windowscentral.com/xbox-series-x-and-xbox-series-s-release-date-and-price-finally-revealed\n\nMy new podcast The Test Drivers! https://www.relay.fm/testdrivers\nOur second channel @thisis! http://www.youtube.com/thisis\nI stream on Twitch now! https://www.twitch.tv/austinevans\nWe have a new Discord: https://discord.gg/sQ8Sw27\nSubscribe! http://www.youtube.com/austinevans\nInstagram: http://instagram.com/austinnotduncan\nTwitter: http://twitter.com/austinnotduncan",
    "description_links": [
        "https://youtu.be/7Fjn4GRw8qE",
        "https://youtu.be/UZR3AF68wBc",
        "https://twitter.com/Xbox/status/1303230071033880576",
        "https://twitter.com/bdsams/status/1303152184377344001",
        "https://twitter.com/_h0x0d_/status/1303165187369832448",
        "https://www.windowscentral.com/xbox-series-x-and-xbox-series-s-release-date-and-price-finally-revealed",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "https://discord.gg/sQ8Sw27",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- The Xbox Series S is looking very, very real. So it's late, and we've just seen a absolute avalanche of leaks all over Twitter about the brand new lower-end version of the Xbox Series X actually named the Xbox Series S. Right now it looks like we are on November 10th, going to be looking at two brand new next-generation, Xbox consoles. First of all, the one that we already know, the Xbox Series X looks to launch at the $500 price point, at least assuming that all of these leaks, which have just absolutely taken over tonight are true. Now that's an aggressive price point, but we'll talk a little bit about that later, because what's really exciting is the Xbox Series S at $299. Yeah, so this next generation is looking at, look at spicy. So not only are their photos of this Xbox Series, that's floating around, but there's even a snippet of why I can only assume as the Microsoft launch video for the Series S, I'll play it for you now. - [Narrator] See it in its actual form for the first time and how small it is. It is. - So what this clip really shows is the size of that Series S. So it is much more akin to something like the Xbox One S compared to the Series X, which while when you look at it, besides something like a PlayStation five is actually relatively reasonably sized, but it's a little bit of a thick boy. However, with the Series S, I'm assuming that they're going to go with a much more traditional cooling, and therefore they're going to go for a console, which looks a lot more like what we're used to seeing. And it's kind of hard to see from this specific video, the exact dimensions, but inside you're going to be getting a lot of that next-generation capabilities. So the X box Series S at $299, of course, does have some cutbacks compared to the full Series X. So first and foremost, the most obvious thing is going to be the fact that it will not have a disc drive. Now, this is something that has been rumored for almost a year, maybe year and a half at this point. And pretty much from the beginning, it was meant to be almost like a spiritual successor to the Xbox One S all-digital edition. So while you're giving up the optical drive, which let's face it, probably not that important to most of you. And of course, there is also a PlayStation 5 with no optical drive. But beyond that, there are a few more cuts. Essentially, this is meant to be a console, which is focused at 10 ADP and maybe a little bit of 1440 P gaining. Whereas the Series X, if you want to pay another $200 for it, we'll give you that full-fat 4k experience with a lot of games running at 120 FPS. So the spec right now seems to indicate that we will be looking at about a four teraflop GPU on the Series as compared to 12 teraflops on the Series X. However, these aren't quite apples to apples compared to something like the Xbox One X, which famously had a six teraflop GPU. So there are a few reasons behind this. First of all, a teraflop is not just a teraflop. You can't actually directly compare them between generations. So there've been a lot of improvements on the AMD, RDNA 2.0 side on the very technical level to give you more performance per flop. So I wouldn't be surprised if the graphics are roughly on par with what we're able to see on the Xbox One X, however, it is going to be much than pretty much all other aspects. So it very much seems like it's going to have the same, if not very similar CPU performance. So going from those ancient slow Jaguars CPU cores on the current generation to much faster, AMD Ryzen based cores are more specifically Zen 2 based cores. So thanks something like a current-day rise in seven in performance. On top of that, it will also of course have a standard SSD. And this is important just like we have with the Xbox One today, you'll be able to buy a game once on the Series Series S, Series X, the Xbox Series, I guess we need to think about the name for this next generation. Anyway, regardless, you'll be able to buy the same game. And of course, it will run on Series S as well as Series X, but the main difference will really be in the actual level of performance. The Series X is very clearly the more capable of the two consoles, but it's $200 more, or almost double the price. You kind of expect that so it is of course supporting 4k and 120 FPS and all that kind of stuff. And I'm really going to be curious to see what the Series S, is actually really able to be able to kick out, right? I mean, sure it'll 100% support 4K in theory, right? You'll be able to watch 4K YouTube, and Netflix and everything. But beyond that, the games, I assume, well, just like the current Xbox One S and One X be able to be upscaled to 4K, right? So if you're playing at 10 ADP or 1440, and of course, because modern games are really very heavily reliant on dynamic resolution, it likely be kind of in that sort of area. So if you have a 10 ADP display, then I'm sure it'll look beautiful and clean and honestly, probably not that different than the Xbox Series X. But if you do have a 4K TV, like more and more people are these days, you should still see some advantage over going up to that higher resolution. It absolutely will not look as clear and crisp, and you may not have things like 120fsp support like you do on the Series X, but when you look at a brand new next year console available for $300, I think that is a really, really compelling pitch. Maybe on purely just the $299 price for the Series S the $499 price for the Series X, these videos, as well as the November 10th launch date, we also have word that they will be available with the all-access. Well, let's say subscription, but it's almost like a financing plan. So this is actually something that is available for the Xbox One right now. So you can pay a small monthly fee, get the console, and you also get things like game pass included as well. So this time around it does seem like they will be offering it, and they'll be offering it at a pretty aggressive price point. So of course, keep in mind, you can still purchase these consoles outright, just like you can before. However, supposedly for only $25 a month, you'd be able to purchase an Xbox Series S console and you will also get that game pass subscription, which considering that that's usually 10 to $15 based on which one they include is actually really not bad. I mean, that's like 15 bucks a month for the Xbox. Now, if you want to go up to the Xbox Series X, supposedly that will be available with this subscription. It only $35 a month. Now, of course, there's some questions as far as how this will actually be implemented. But if you're talking about the idea these consoles are going to be relatively affordable, I mean, even if you pay full price, but especially if you do the monthly plan. And on top of that, it's coming with game pass, which comes with lots and lots of great exclusives, including basically everything first party. So Flight Simulator, whenever that shows up on Xbox, Halo, et cetera, et cetera, will all be included for 25 to $35 a month. That is a really, really compelling price. Now, of course, grain of salts warning, like always, but if this is the case, look, I'm not gonna say that I think right now, before, especially seeing all these leaks that I was like, \"Oh, of course, Xbox is gonna win.\" I mean, Sony has a ton of momentum from the PlayStation 4. The PS5 does look good, especially the game lineup looks crazy for the PS5. When you start playing around with these very, what I would say, reasonable prices, very much likely that they're going to be cheaper than something like the PS5 or even the PS5 Digital Edition. I think there's a lot of people who might be a little bit more interested in Xbox this time around, right? I mean, even if you have it as a secondary console, you're talking of 25 bucks a month, 35 bucks a month, or even three to $500. I mean, you consider that these consoles and especially that Xbox Series X are going to be more powerful than the vast majority of gaming PCs out there. Maybe not on the complete crazy high end, but still this is a major, major step forward. At $500, I think that's a pretty reasonable price. I think Sony is going to be right around that level, give or take $50. But when you look at something like the Series S I don't think Sony has any kind of response to it. $300 for a next-generation console is kind of nuts. And while sure, you're going to be losing the optical drive, which may or may not be important to you. And of course, you are going to be losing some of that performance, but if you're able to play these same games with all the next-gen features and all you're really losing is a little bit of resolution. I think that's a very, very reasonable trade especially if you're someone who's leaning on the Sony side of the fence, you're about ready to go out and buy that PS5. Well, 300 bucks, you can also get yourself an Xbox and you can really kinda have the best of both worlds play the Microsoft exclusives, especially the ones that don't make it too well. I was about to say the ones that don't make it to PC, but I don't think there's a lot of those these days. And of course, you still get all of these Sony games on that PlayStation side of the camp as well. So anyway, I'm very excited, but I'm curious. What do you think about the brand new Xbox Series S? More importantly, are you gonna buy an Xbox Series S, or an X or PS5 or you're just gonna save your shekels for an RTX 3090? Don't do that. It seems like a bad idea. Anyway, thank you very much for watching. Make sure to subscribe for lots more console content like this, and I will catch you after I finally go to sleep. It's late.",
    "transcript_keywords": [
        "Xbox Series",
        "Series",
        "Xbox",
        "Series Series",
        "price",
        "console",
        "Xbox consoles",
        "Sony",
        "game",
        "kind",
        "lot",
        "consoles",
        "games",
        "month",
        "full Series",
        "price point",
        "bit",
        "current Xbox",
        "performance",
        "point"
    ],
    "transcript_entities": [
        [
            "PlayStation five",
            "PRODUCT"
        ],
        [
            "35 bucks",
            "MONEY"
        ],
        [
            "120 FPS",
            "MONEY"
        ],
        [
            "The Series X",
            "EVENT"
        ],
        [
            "K TV",
            "ORG"
        ],
        [
            "Digital Edition",
            "WORK_OF_ART"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "Twitter",
            "ORG"
        ],
        [
            "15 bucks",
            "MONEY"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "AMD",
            "PRODUCT"
        ],
        [
            "120fsp",
            "CARDINAL"
        ],
        [
            "500",
            "MONEY"
        ],
        [
            "a ton",
            "QUANTITY"
        ],
        [
            "the Xbox Series",
            "EVENT"
        ],
        [
            "499",
            "MONEY"
        ],
        [
            "secondary",
            "ORDINAL"
        ],
        [
            "GPU",
            "ORG"
        ],
        [
            "six",
            "CARDINAL"
        ],
        [
            "next year",
            "DATE"
        ],
        [
            "12 teraflops",
            "QUANTITY"
        ],
        [
            "the PlayStation 4",
            "PRODUCT"
        ],
        [
            "PlayStation 5",
            "PRODUCT"
        ],
        [
            "the Series S",
            "EVENT"
        ],
        [
            "the Xbox Series S.",
            "LAW"
        ],
        [
            "K YouTube",
            "ORG"
        ],
        [
            "PlayStation",
            "PRODUCT"
        ],
        [
            "300 bucks",
            "MONEY"
        ],
        [
            "Xbox",
            "FAC"
        ],
        [
            "the Xbox Series X",
            "PRODUCT"
        ],
        [
            "these days",
            "DATE"
        ],
        [
            "Xbox One X",
            "PRODUCT"
        ],
        [
            "the Series X",
            "EVENT"
        ],
        [
            "4k",
            "CARDINAL"
        ],
        [
            "the Series S I",
            "EVENT"
        ],
        [
            "maybe year and a half",
            "DATE"
        ],
        [
            "Xbox One S",
            "ORG"
        ],
        [
            "seven",
            "CARDINAL"
        ],
        [
            "tonight",
            "TIME"
        ],
        [
            "this Xbox Series",
            "EVENT"
        ],
        [
            "today",
            "DATE"
        ],
        [
            "November 10th launch date",
            "DATE"
        ],
        [
            "PS5",
            "ORG"
        ],
        [
            "25 bucks",
            "MONEY"
        ],
        [
            "10",
            "CARDINAL"
        ],
        [
            "1440",
            "DATE"
        ],
        [
            "10 to $15",
            "MONEY"
        ],
        [
            "300",
            "MONEY"
        ],
        [
            "Xbox",
            "ORG"
        ],
        [
            "only $25",
            "MONEY"
        ],
        [
            "100%",
            "PERCENT"
        ],
        [
            "Sony",
            "ORG"
        ],
        [
            "1440",
            "CARDINAL"
        ],
        [
            "Jaguars",
            "PRODUCT"
        ],
        [
            "the Xbox Series X",
            "EVENT"
        ],
        [
            "Xbox Series X",
            "PRODUCT"
        ],
        [
            "200",
            "MONEY"
        ],
        [
            "Zen 2",
            "ORG"
        ],
        [
            "Microsoft",
            "ORG"
        ],
        [
            "CPU",
            "ORG"
        ],
        [
            "3090",
            "PRODUCT"
        ],
        [
            "299",
            "MONEY"
        ],
        [
            "another $200",
            "MONEY"
        ],
        [
            "ADP",
            "ORG"
        ],
        [
            "One",
            "CARDINAL"
        ],
        [
            "current-day",
            "DATE"
        ],
        [
            "the Series Series S, Series X",
            "EVENT"
        ],
        [
            "First",
            "ORDINAL"
        ],
        [
            "the Series S",
            "ORG"
        ],
        [
            "Netflix",
            "ORG"
        ],
        [
            "monthly",
            "DATE"
        ],
        [
            "Xbox Series S",
            "ORG"
        ],
        [
            "Series S",
            "WORK_OF_ART"
        ],
        [
            "25 to $35",
            "MONEY"
        ],
        [
            "120 FPS",
            "QUANTITY"
        ],
        [
            "the Series X.",
            "EVENT"
        ],
        [
            "November 10th",
            "DATE"
        ],
        [
            "almost a year",
            "DATE"
        ],
        [
            "50",
            "MONEY"
        ],
        [
            "4",
            "CARDINAL"
        ],
        [
            "three to $500",
            "MONEY"
        ],
        [
            "only $35",
            "MONEY"
        ],
        [
            "the Xbox Series S",
            "EVENT"
        ],
        [
            "Series",
            "EVENT"
        ]
    ]
}