{
    "video_id": "onZ7D2ETvcE",
    "title": "Best of CES 2018!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-01-13T17:17:10Z",
    "video_url": "https://www.youtube.com/watch?v=onZ7D2ETvcE",
    "category": "Science & Technology",
    "tags": [
        "ces",
        "ces 2018",
        "2018",
        "tech",
        "gadgets",
        "technology",
        "gaming",
        "monitor",
        "display",
        "8k",
        "laptop",
        "tv",
        "headphones",
        "audio",
        "austin evans"
    ],
    "views": 676456,
    "likes": 17964,
    "comments_count": 650,
    "description": "CES 2018 has some crazy technology but here's my favorite.\nRazer Project Linda: https://www.youtube.com/watch?v=o2P6wVJiBNw\nThe Weirdest Tech of CES 2018: https://www.youtube.com/watch?v=tHNrBuN4V3U\n\nFrom the Sennheiser HD 820 headphones to the Sony 8K TV, Razer Synapse support for Phillips Hue to a $3500 In Win WINBOT gaming PC case and a $50,000 2.5D Casio Mofrel printer to an LG 5K UltraWide monitor this is the best of CES 2018.\n\nSubscribe! http://www.youtube.com/austinevans\nInstagram: http://instagram.com/austinnotduncan\nTwitter: http://twitter.com/austinnotduncan\nFacebook: https://www.facebook.com/austinnotduncan",
    "description_links": [
        "https://www.youtube.com/watch?v=o2P6wVJiBNw",
        "https://www.youtube.com/watch?v=tHNrBuN4V3U",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. I'm today I'm here with the very best tech of CES 2018. One of the first things that jumped out to me is the In Win Winbot case. Now, normally PC cases, not all that exciting, but here at CES, things get a little bit more interesting. One look at this and you're gonna get some Death Star vibes. So it is a clear case that is going to actually be able to house some pretty serious components, but what really makes it cool is the fact that it is going to be completely motorized, so not only can you open and close the case like Pac-Man, but the entire thing will spin around like a robot. Now, at 3,500 dollars, the best doesn't necessarily mean the most practical, but I've got to say, it's actually a lot cooler than I thought. Something else cool is -- (cooing) The pigeon declined to be interviewed. Continuing on the gaming train, we have the Razer Project Linda. Now this is one of my favorite things from the show this year. So much so that we actually already did an entire video about it, but the idea is that this takes the Razer phone and turns it into a laptop. So you plug it via USB-C, it functions as the track pad, as the speakers, and the guts of the phone are enough to run the entire laptop. So if you guys want more about that, definitely be sure to go check out our full video on Razer Project Linda. Speaking of Razer, they are also showing off their Synapse support for Phillips Hue. So you guys probably know that Razer is all about RGB literally everything and they're taking that up a notch by letting you add your Hue lights to their Synapse software. The way this works is that inside their Synapse software, you can control your Hue lights alongside all of your accessories. So say you want to get a super cool rave going, you can hit a key and the entire Wave will come all the way around your room. It's kind of ridiculous, but I mean, actually, I thought it's pretty cool, so, you know. Something I think everyone will think is cool is Sony's 8K TV. Now 8K is slowly been showing up at CES, even though you can't really buy them in stores just yet. However, Sony upped the game with not only a full HDR-compatible TV but it goes up to 10,000 nits. How bright is 10,000 nits? - It's really bright. - You heard it here first. It's really bright. Almost as bright as the light that's in my face right now. (laughs) To put this in context, most standard TVs, even our HDR-compatible, might top at around 500 nits, whereas this guy can go all the way up to 10,000. Now what's cool about this is that especially for some games, like Gran Turismo for example, which have been designed with some proper HDR support in mind, you can have incredibly bright specific sources. So say that you see the headlights of a car or a bright sunset. That can be way, way brighter than the rest of the scene, giving actually a really impressive bit of contrast. Of course, that's to say nothing about the idea that it is that it is an 85-inch 8K TV, which looks ridiculous, but it's actually the HDR stuff that really sort of blew me away. It looks so, so good. Samsung were also showing off The Wall. Now this is a new type of display technology called Micro LED. The idea here is that it actually is going to be modular to a degree, so while they were showing off a 146-inch version, you could, at least in theory, build pretty much as big of a TV as you wanted, assuming you have a lot of money. LG was also showing off a pair of new displays, so they have not only a 4K option but they also have a 5K ultra-wide. So we've been using their ultra-fine 5K displays to edit on for a little while, and they're really nice. However, what they're adding with these new displays is HDR. At least kind of. They're using HDR-600, which is brighter than standard displays. However, because neither Windows or Mac actually support HDR yet, it's still kind of a little bit in the middle right now. What's cool is the 4K option support Thunderbolt Three as well as daisy chaining. So off of a single Thunderbolt Three port, you can actually run two of these 4K displays. So what I think a lot of people are going to be interested in is the new 5K Ultra-wide. So with a resolution of 5120 by 2160, this is basically like a super-wide 4K display and especially for gaming, if you have some crazy, over-the-top system, it's gonna look nice. Moving to the audio side of things, we have the new Sennheiser HD-820 headphones. Now the HD-800s are regarded as some of the best-sounding headphones pretty much anywhere and the 820s add a glass back to the headphones. This might sound weird. However, the 800s, they leak like crazy, so if you're in the same room, you can hear exactly what someone's listening to, whereas with the 820s, that glass helps to give it a little bit more of a closed sound while still sounding absolutely incredible. Seriously, either these things are gonna be probably well over 2,000 dollars, they're some of the best-sounded headphones I've ever tried. Moving to laptops, there's the 2018 LG Gram. So you guys'll probably know that I love the original Gram. I've done a couple of videos on it. It's one of my favorite laptops of last year, but for 2018, not only are they going to be bumping it up to quad core processors but it has an almost ridiculously large 72 watt-hour battery. There are also some nice additions, including the option of adding a Thunderbolt Three port instead of USBC, which is especially nice for those LG displays. You also now get dual SSD slots, so you can actually open this guy up and not only add some more memory but also another SSD. This is definitely a laptop I wanna check out as soon as it comes out in the next few months. Something I found surprisingly cool at this year's show is the Casio Mofrel 2.5d printer. So you guys are probably familiar with 3D printers that will print full 3D objects and especially when you get up higher in the budgets, you can do some really cool stuff with that. However, with the Mofrel, you're actually printing textures, so with our demo, they printed a mesh material, but in about five minutes, you can do all kinds of different textiles, you can do fake leather, you can even do things like stone. Now, of course, this is going to be more on the manufacturing side, so say you wanna build like a prototype really quickly, it's cool, and they're 50,000 dollars. It will not come cheap. But it is really cool to be able to print stuff that looks and feels surprising real in just a few minutes. Ken, are we done? Is this is it for CES? Can we go home now? I don't have a voice anymore. I've been looking at tech all week. Hopefully you guys enjoyed our best of CES. If you missed any of the videos, check 'em out over here. Or over here. I don't know. No, no, not there. There's no videos up there, Ken.",
    "transcript_keywords": [
        "Razer Project Linda",
        "cool",
        "Win Winbot case",
        "Razer Project",
        "Razer",
        "CES",
        "things",
        "guys",
        "Project Linda",
        "Austin",
        "displays",
        "bright",
        "Win Winbot",
        "HDR",
        "Hey guys",
        "showing",
        "Winbot case",
        "Hue lights",
        "Synapse",
        "Hue"
    ],
    "transcript_entities": [
        [
            "just a few minutes",
            "TIME"
        ],
        [
            "Razer Project",
            "ORG"
        ],
        [
            "10,000",
            "CARDINAL"
        ],
        [
            "HDR-600",
            "PERSON"
        ],
        [
            "this year",
            "DATE"
        ],
        [
            "Razer",
            "PERSON"
        ],
        [
            "5",
            "CARDINAL"
        ],
        [
            "72 watt-hour",
            "QUANTITY"
        ],
        [
            "146-inch",
            "QUANTITY"
        ],
        [
            "Synapse",
            "ORG"
        ],
        [
            "Linda",
            "PERSON"
        ],
        [
            "Death Star",
            "ORG"
        ],
        [
            "2018",
            "DATE"
        ],
        [
            "K TV",
            "ORG"
        ],
        [
            "USB-C",
            "ORG"
        ],
        [
            "Phillips Hue",
            "PERSON"
        ],
        [
            "Windows",
            "ORG"
        ],
        [
            "820s",
            "PRODUCT"
        ],
        [
            "50,000 dollars",
            "MONEY"
        ],
        [
            "Three",
            "CARDINAL"
        ],
        [
            "Casio",
            "ORG"
        ],
        [
            "first",
            "ORDINAL"
        ],
        [
            "Synapse",
            "LOC"
        ],
        [
            "Wave",
            "ORG"
        ],
        [
            "Micro",
            "ORG"
        ],
        [
            "Ken",
            "PERSON"
        ],
        [
            "Samsung",
            "ORG"
        ],
        [
            "Austin",
            "PERSON"
        ],
        [
            "Mofrel 2.5d",
            "PRODUCT"
        ],
        [
            "RGB",
            "ORG"
        ],
        [
            "two",
            "CARDINAL"
        ],
        [
            "Sennheiser",
            "ORG"
        ],
        [
            "all week",
            "DATE"
        ],
        [
            "Winbot",
            "PERSON"
        ],
        [
            "LG",
            "ORG"
        ],
        [
            "Thunderbolt Three",
            "PRODUCT"
        ],
        [
            "USBC",
            "ORG"
        ],
        [
            "4",
            "CARDINAL"
        ],
        [
            "Sony",
            "ORG"
        ],
        [
            "8",
            "CARDINAL"
        ],
        [
            "about five minutes",
            "TIME"
        ],
        [
            "Gran Turismo",
            "PERSON"
        ],
        [
            "CES",
            "ORG"
        ],
        [
            "year",
            "DATE"
        ],
        [
            "500",
            "CARDINAL"
        ],
        [
            "2160",
            "CARDINAL"
        ],
        [
            "SSD",
            "ORG"
        ],
        [
            "last year",
            "DATE"
        ],
        [
            "the next few months",
            "DATE"
        ],
        [
            "Mac",
            "ORG"
        ],
        [
            "3,500 dollars",
            "MONEY"
        ],
        [
            "LG Gram",
            "EVENT"
        ],
        [
            "85-inch",
            "QUANTITY"
        ],
        [
            "well over 2,000 dollars",
            "MONEY"
        ],
        [
            "Hue",
            "GPE"
        ],
        [
            "One",
            "CARDINAL"
        ],
        [
            "5120",
            "CARDINAL"
        ],
        [
            "Mofrel",
            "PERSON"
        ],
        [
            "the Razer Project Linda",
            "ORG"
        ],
        [
            "Gram",
            "PRODUCT"
        ],
        [
            "Pac-Man",
            "PERSON"
        ]
    ]
}